[
  {
    "id": "a_taste_for_death_aoa",
    "name": "A Taste for Death (Abundance of Apocrypha)",
    "cost": 20,
    "prerequisites": {
      "keywords": [
        "YNNARI"
      ],
      "species": [
        "aeldari",
        "drukhari"
      ]
    },
    "effect": "You may spend a Soul token to add +Rank bonus dice to your next attack.",
    "flavor": "When one of the Reborn sees the soul of their foes departing their bodies, they feel a renewed sense of purpose.",
    "source": "apocrypha",
    "page": 231
  },
  {
    "id": "abhor_the_witch_destroy_the_witch_vow_aoa",
    "name": "Abhor the Witch, Destroy the Witch [Vow] (Abundance of Apocrypha)",
    "cost": 20,
    "prerequisites": {
      "keywords": [
        "BLACK TEMPLARS"
      ]
    },
    "effect": "Once per battle, when an enemy PSYKER is within your line of sight at the start of your turn, you may add +Double Rank to your Speed. In addition, you may re-roll all ED which roll a 1 on melee attacks made against PSYKERS. However, you add +2DN to all non-attack skill tests attempted while you can see a PSYKER. You may only have one Vow talent. During downtime, you may replace this talent with any other BLACK TEMPLARS talent marked as a Vow.",
    "flavor": "Your disdain for sorcery is palpable, repelling the vile arts of wyrd and witch.",
    "source": "apocrypha",
    "page": 230
  },
  {
    "id": "absolute_incineration",
    "name": "Absolute Incineration",
    "cost": 20,
    "prerequisites": {},
    "effect": "When you use a weapon with the Melta Trait at Short Range, increase both the ED and AP by +Rank.",
    "flavor": "You unleash a blistering thermal assault that reduces flesh and armour alike to liquid.",
    "source": "redacted1",
    "page": 60
  },
  {
    "id": "accept_any_challenge_no_matter_the_odds_vow_aoa",
    "name": "Accept any Challenge, No Matter the Odds [Vow] (Abundance of Apocrypha)",
    "cost": 20,
    "prerequisites": {
      "keywords": [
        "BLACK TEMPLARS"
      ]
    },
    "effect": "When you’re engaged with an enemy, add +Rank bonus dice to your melee attacks, and improve the AP of your melee weapons by 1. However, you may not Fall Back. You may only have one Vow talent. During downtime, you may replace this talent with any other BLACK TEMPLARS talent marked as a Vow.",
    "flavor": "You cannot rest while the enemy remains breathing.",
    "source": "apocrypha",
    "page": 230
  },
  {
    "id": "acolyte_of_ynnead_aoa",
    "name": "Acolyte of Ynnead (Abundance of Apocrypha)",
    "cost": 15,
    "prerequisites": {
      "keywords": [
        "PSYKER",
        "YNNARI"
      ],
      "species": [
        "aeldari"
      ]
    },
    "effect": "When you attempt a Psychic Mastery test, you may spend 1 Soul token to add +Rank bonus dice to the test.",
    "flavor": "Those psykers amongst the Ynnari hosts can use the souls of the recently dead to focus their powers.",
    "source": "apocrypha",
    "page": 230
  },
  {
    "id": "acute_sense",
    "name": "Acute Sense",
    "cost": 20,
    "prerequisites": {},
    "effect": "Pick one of your 5 senses (sight, hearing, smell, taste, or touch). Whenever you make an Awareness Test based on that sense, you gain +Rank bonus dice.",
    "flavor": "",
    "requiresChoice": true,
    "choiceType": "sense",
    "choiceOptions": [
      "Sight",
      "Hearing",
      "Smell",
      "Taste",
      "Touch"
    ],
    "source": "core",
    "page": 129
  },
  {
    "id": "adaptive_strategy",
    "name": "Adaptive Strategy",
    "cost": 20,
    "prerequisites": {
      "attributes": {
        "intellect": 4
      },
      "keywords": [
        "ADEPTUS ASTARTES"
      ]
    },
    "effect": "When spending a point of Wrath to make a Narrative Declaration (Wrath & Glory Core Rulebook, page 164), you may roll a die if the GM approves your declaration. If this die rolls an Icon, the point of Wrath is not spent. If the die rolls an Exalted Icon, the results of the Narrative Declaration are more impressive than usual, and the Wrath point is not spent.",
    "flavor": "Informed by your Chapter doctrines or the Codex Astartes, you can overcome whatever obstacles emerge on your path to victory. Your battle plans are comprehensive, and what you cannot plan for, you overcome with cunning improvisation.",
    "source": "voa",
    "page": 44
  },
  {
    "id": "aegis_of_the_emperor",
    "name": "Aegis of the Emperor",
    "cost": 20,
    "prerequisites": {
      "attributes": {
        "willpower": 3
      },
      "keywords": [
        "ADEPTA SORORITAS",
        "ADEPTUS MINISTORUM"
      ],
      "keywordsAny": true
    },
    "effect": "You gain +1 Faith. As an Action you may target a Human within 5m. Your target cannot be targeted by Psychic Powers for 1 hour. You can target yourself.",
    "flavor": "It is said that among the oldest invocations of the Emperor's strength are the three words, 'The Emperor Protects.' By repeating this phrase, or one very like it, you steel the will of the faithful against the blasphemous sorcery of the Emperor's enemies.",
    "isFaithTalent": true,
    "source": "redacted2",
    "page": 68
  },
  {
    "id": "aggressor_imperative_aoa",
    "name": "Aggressor Imperative (Abundance of Apocrypha)",
    "cost": 20,
    "prerequisites": {
      "keywords": [
        "SKITARII"
      ]
    },
    "effect": "At the start of any of your turns, you may activate the Aggressor Imperative. This adds +Rank to your Speed but reduces your Resilience by 2. At the end of a turn in which you activate the Aggressor Imperative, you suffer 1d3+2 Shock.",
    "flavor": "Though doctrina imperatives are normally initiated by a Tech-Priest overseeing the Skitarii in action, you have been equipped with protocols for independent action. You can engage an imperative which enhances your mobility for short periods.",
    "source": "apocrypha",
    "page": 230
  },
  {
    "id": "alphalevel_psyker_aoa",
    "name": "Alpha-level Psyker (Abundance of Apocrypha)",
    "cost": 60,
    "prerequisites": {
      "tier": 5,
      "keywords": [
        "PSYKER"
      ],
      "species": [
        "human",
        "adeptus astartes",
        "primaris astartes"
      ]
    },
    "effect": "When you successfully use a psychic power at the Transcendent power level, you may add up to Double Rank additional Exalted Icons to apply to the power’s Potency options. However, you add +30 to any roll on the Perils of the Warp table. You gain 3d3 Corruption when you take this talent. You may not select the Beta-level Psyker or Gamma-level Psyker talents.",
    "flavor": "Your raw power is beyond that of most psykers encountered by the Imperium, but such power is incredibly unstable.",
    "source": "apocrypha",
    "page": 179
  },
  {
    "id": "ambush_aoa",
    "name": "Ambush (Abundance of Apocrypha)",
    "cost": 30,
    "prerequisites": {
      "keywords": [
        "ASPECT WARRIOR"
      ],
      "other": "Striking Scorpion aspect, Stealth rating 5+"
    },
    "effect": "You have a perfect sense of precision and timing, and your ambushes are virtually impossible to detect. You and your squad add +Rank to your Stealth Scores, and enemies may not spend Ruin to become aware of the ambushing Striking Scorpions.",
    "flavor": "",
    "source": "apocrypha",
    "page": 244
  },
  {
    "id": "anathema_aoa",
    "name": "Anathema (Abundance of Apocrypha)",
    "cost": 20,
    "prerequisites": {
      "species": [
        "pariah"
      ]
    },
    "effect": "Whenever you succeed at a melee attack against a creature with the DAEMON or PSYKER keywords, your attack inflicts mortal wounds equal to your Rank in addition to any other damage inflicted. In addition, creatures with the DAEMON keyword within a number of metres of you equal to your Willpower may not attempt to roll Determination.",
    "flavor": "Your mere presence is bane to daemons and psykers.",
    "source": "apocrypha",
    "page": 179
  },
  {
    "id": "anatomical_scourge",
    "name": "Anatomical Scourge",
    "cost": 20,
    "prerequisites": {
      "keywords": [
        "PSYKER"
      ],
      "keywordsAny": true,
      "other": "PSYKER Keyword or Medicae 2+"
    },
    "effect": "You gain +2ED when making Called Shots.",
    "flavor": "Whether you're a trained medic, a Sister Hospitaller, a Mechanicus Biologis, or even a Psyker trained in Biomancy, your knowledge of anatomy and biology can be extremely useful for targeting vital organs with precision shots.",
    "source": "redacted1",
    "page": 60
  },
  {
    "id": "and_they_shall_know_no_fear_aoa",
    "name": "And They Shall Know No Fear (Abundance of Apocrypha)",
    "cost": 5,
    "prerequisites": {
      "species": [
        "adeptus astartes",
        "primaris astartes"
      ]
    },
    "effect": "You may re-roll any failures on any Resolve test you make.",
    "flavor": "You are one of the Defenders of Humanity, a bulwark against terror forged in the furnace of war.",
    "source": "apocrypha",
    "page": 145
  },
  {
    "id": "angel_of_death",
    "name": "Angel Of Death",
    "cost": 30,
    "prerequisites": {
      "rank": 2,
      "species": [
        "astartes",
        "primaris"
      ]
    },
    "effect": "Add +Rank to the total Damage Value of successful attacks with the following weapons: Chainswords, Chainaxes, Power Swords, Power Fists, Unarmed strikes, Bolt weapons, Any weapon with the ADEPTUS ASTARTES Keyword. At the GM's discretion, this Talent may also apply to weapons with the CHAOS Keyword for Chaos Space Marines.",
    "flavor": "You are a Space Marine — one of the most feared warriors in the galaxy. You are a highly trained superhuman veteran of hundreds of battles and have mastered the use of many deadly weapons.",
    "source": "core",
    "page": 129
  },
  {
    "id": "angel_of_mercy",
    "name": "Angel Of Mercy",
    "cost": 10,
    "prerequisites": {
      "skills": {
        "medicae": 2
      }
    },
    "effect": "Add +Rank to your Medicae (Int) dice pool to determine how many Wounds you can remove in a Regroup of an hour or longer. You can split the number of Wounds you remove between multiple characters, rather than a single target.",
    "flavor": "You are resolved to lend medical assistance to as many as you can, never resting when there is work to be done.",
    "source": "redacted1",
    "page": 60
  },
  {
    "id": "animal_companion",
    "name": "Animal Companion",
    "cost": 30,
    "prerequisites": {
      "skills": {
        "leadership": 2,
        "survival": 2
      }
    },
    "effect": "Choose any Threat with the BEAST Keyword that is not an Adversary at your Tier. You have tamed a single creature of that type. It follows you and attempts actions in combat as you command, taking its own slot in the Initiative Order like an Agent. It does not interact with Wrath or Ruin, unless another ability indicates otherwise. If you suffer an attack whilst the creature is within half its Speed of you, it may take a DN 5 Initiative Test as a Reflexive Action. If it succeeds, the attack is redirected onto the creature. Slain creatures may be replaced for free the next time you visit the replacement creature's habitat, or a location where it is raised in captivity.",
    "flavor": "You have tamed a creature to follow your commands and respect you as its master.",
    "source": "aeldari",
    "page": 60
  },
  {
    "id": "animal_wrangler",
    "name": "Animal Wrangler",
    "cost": 10,
    "prerequisites": {
      "skills": {
        "survival": 2
      }
    },
    "effect": "You gain +Double Rank bonus dice on any social Skill Test against a target with the BEAST Keyword. You may choose to use the Survival (Wil) Skill for any social Skill Tests against these targets.",
    "flavor": "You have a background in taming wild beasts, domesticating them as beasts of burden or relating to them as one animal to another.",
    "source": "redacted1",
    "page": 60
  },
  {
    "id": "arch_performer",
    "name": "Arch-Performer",
    "cost": 10,
    "prerequisites": {},
    "effect": "Choose a type of performance appropriate for the 41st Millennium — choral singing, organ playing, hagiographic recital, ritual dance, etc. You excel at this art form or craft. If an enthusiast of the arts witnesses your performance, you gain +Rank bonus dice to social Skills targeting them for the rest of the scene. If you ever undertake a skill Test to determine the success of the performance itself — rolling Deception (Fel) to attract attention away from companions, for example — you gain +Double Rank bonus dice on the Test. If you have a chance to practise your performing art during a Regroup, you reduce your Shock to zero.",
    "flavor": "You have devoted your body to a creative endeavour you perform live before an audience. As well as providing personal fulfilment, it occasionally provides an excellent distraction.",
    "requiresChoice": true,
    "choiceType": "freeform",
    "choiceLabel": "Performance Type",
    "choiceDescription": "Choose a type of performance (choral singing, organ playing, hagiographic recital, ritual dance, etc.)",
    "source": "redacted1",
    "page": 61
  },
  {
    "id": "armour_of_contempt",
    "name": "Armour of Contempt",
    "cost": 30,
    "prerequisites": {
      "attributes": {
        "willpower": 5
      },
      "keywords": [
        "ADEPTUS ASTARTES"
      ],
      "other": "Must have received the Black Carapace"
    },
    "effect": "You may spend a point of Wrath to roll Determination against Mortal Wounds as if a standard source of damage inflicted them.",
    "flavor": "No fell sorcery or malign xenotechnology is sufficient to overcome your armour, for you are clad in righteous faith as well as ceramite.",
    "source": "voa",
    "page": 45
  },
  {
    "id": "armour_of_contempt_aoa",
    "name": "Armour of Contempt (Abundance of Apocrypha)",
    "cost": 20,
    "prerequisites": {},
    "effect": "When you roll Determination, you add +Double Rank bonus dice to the roll.",
    "flavor": "You will not yield while there is still a battle to be won, nor while an enemy of the Imperium still draws breath.",
    "source": "apocrypha",
    "page": 231
  },
  {
    "id": "armourbane",
    "name": "Armourbane",
    "cost": 20,
    "prerequisites": {
      "skills": {
        "weaponSkill": 2
      }
    },
    "effect": "...Your weapon must have one of the following Keywords to activate this Talent: BLADE, CHAIN, FORCE, POWER FIELD.",
    "flavor": "Your furious strikes rend armour, leaving it broken and useless.",
    "source": "core",
    "page": 129
  },
  {
    "id": "armourmonger_aoa",
    "name": "Armour-Monger (Abundance of Apocrypha)",
    "cost": 20,
    "prerequisites": {
      "keywords": [
        "ADEPTUS MECHANICUS",
        "CULT MECHANICUS"
      ]
    },
    "effect": "Select a single suit of armour you possess when you choose this Talent. When you wear that armour, increase the Armour Rating by +Rank. You must be able to spend at least an hour a day maintaining and adjusting the armour in order to gain this bonus.",
    "flavor": "Your craft allows you to enhance the effectiveness of your armour.",
    "source": "apocrypha",
    "page": 231
  },
  {
    "id": "arsonist",
    "name": "Arsonist",
    "cost": 10,
    "prerequisites": {},
    "effect": "When you inflict the On Fire Condition, your victims suffer an additional +Rank Mortal Wounds at the start of each of your Turns. The DN for the Athletics (S) Test for your victims to remove the Condition is also increased by +Rank.",
    "flavor": "You keep starting fires, and they burn long into the night.",
    "source": "redacted1",
    "page": 61
  },
  {
    "id": "assault_doctrine",
    "name": "Assault Doctrine",
    "cost": 30,
    "prerequisites": {
      "species": [
        "astartes"
      ],
      "tier": 3,
      "other": "Not Primaris"
    },
    "effect": "You receive a Bolt Pistol, Astartes Chainsword (page 49), Aquilla Mark VII armour, and Jump Pack, if you don't already have them. You gain additional +Rank AP on any melee weapon you wield, or any ranged weapons with the Pistol Trait. An Agent Ascending from Tier 2 to Tier 3 may purchase this Talent instead of an Ascension Package.",
    "flavor": "You fight at the vanguard of any advance, shrieking across the battlefield to bring the might of your Astartes physiology to bear.",
    "source": "redacted1",
    "page": 61
  },
  {
    "id": "augmetic",
    "name": "Augmetic",
    "cost": 20,
    "prerequisites": {},
    "effect": "You replace part of your biology with an augmetic, the common name for cybernetic implants in the Imperium. You may take this Talent more than once. Each time you take this Talent you may select two augmetics of Rare or lower rarity, or a single Very Rare augmetic. See p.242 for more information on Augmetics. The GM determines which augmetics are available (usually any of those designed for your Species) and who can perform the necessary installation procedure.",
    "flavor": "",
    "requiresChoice": true,
    "choiceType": "augmetics",
    "choiceLabel": "Augmetic Selection",
    "choiceDescription": "Choose augmetics (two Rare or lower, or one Very Rare)",
    "source": "core",
    "page": 90
  },
  {
    "id": "avatar_of_blood_aoa",
    "name": "Avatar of Blood (Abundance of Apocrypha)",
    "cost": 20,
    "prerequisites": {
      "skills": {
        "weaponSkill": 3
      }
    },
    "effect": "Whenever you inflict a Critical Hit with a melee attack, you immediately recover Double Rank Shock.",
    "flavor": "Bloodshed inspires and invigorates you.",
    "source": "apocrypha",
    "page": 231
  },
  {
    "id": "avenging_strikes_aoa",
    "name": "Avenging Strikes (Abundance of Apocrypha)",
    "cost": 20,
    "prerequisites": {
      "keywords": [
        "ASPECT WARRIOR"
      ],
      "other": "Dire Avenger aspect, Willpower 4+"
    },
    "effect": "Little can withstand your cold fury when you avenge the fallen. If your squad has taken any casualties during the current day, then you and any remaining member of your squad add +Rank bonus dice to all melee and ranged attacks you make until your next Respite.",
    "flavor": "",
    "source": "apocrypha",
    "page": 247
  },
  {
    "id": "back_from_the_brink_aoa",
    "name": "Back from the Brink (Abundance of Apocrypha)",
    "cost": 20,
    "prerequisites": {
      "keywords": [
        "YNNARI"
      ],
      "species": [
        "aeldari",
        "drukhari"
      ]
    },
    "effect": "When you start Dying, you may immediately spend a Soul token to heal 1 Wound.",
    "flavor": "Those infused with death are not easy to slay.",
    "source": "apocrypha",
    "page": 231
  },
  {
    "id": "baleful_acolyte_aoa",
    "name": "Baleful Acolyte (Abundance of Apocrypha)",
    "cost": 10,
    "prerequisites": {
      "other": "CHAOS keyword, you may not be a PSYKER"
    },
    "effect": "You gain the PSYKER keyword and learn the Smite psychic power. You may learn minor psychic powers, and powers from a single Chaos Discipline (any Discipline with powers with the CHAOS keyword). You rely on a focal item: a balefire tome, a ritual dagger, or similar, and can only use your powers when you have that item in hand.",
    "flavor": "You have dabbled in sorcerous power, drawing power from vile artefacts and malign grimoires.",
    "source": "apocrypha",
    "page": 231
  },
  {
    "id": "battle_company_doctrine",
    "name": "Battle Company Doctrine",
    "cost": 60,
    "prerequisites": {
      "keywords": [
        "ADEPTUS ASTARTES"
      ],
      "tier": 3
    },
    "effect": "You have battled across countless worlds and faced all manner of heretics and xenos threats. You have mastered numerous weapons and and your skills and conviction has earned you a place amongst a Battle Company of the Chapter. You gain the Bolter Discipline, Built Tough or Chainsaw Warrior talent and a further instance of the Hatred talent (against a different enemy if you already possess this talent). You gain +2 Influence, and 1 item of Uncommon Wargear.",
    "flavor": "[AI-Generated] You have proven yourself worthy of the Battle Companies, the core of the Chapter's fighting strength.",
    "isAscension": true,
    "source": "voa",
    "page": 43
  },
  {
    "id": "battle_focus",
    "name": "Battle Focus",
    "cost": 20,
    "prerequisites": {
      "keywords": [
        "ASURYANI"
      ]
    },
    "effect": "When you make a ranged attack, you may move up to your Speed as a Free Action. You may use this Talent up to Rank times per combat, and never more than once per Turn.",
    "flavor": "You wage war in a semi-conscious trance, striking with deadly aim, and evading blows with instinctive athleticism.",
    "source": "aeldari",
    "page": 60
  },
  {
    "id": "battle_focus_aoa",
    "name": "Battle Focus (Abundance of Apocrypha)",
    "cost": 10,
    "prerequisites": {
      "keywords": [
        "ASURYANI"
      ],
      "species": [
        "aeldari"
      ]
    },
    "effect": "You do not have to move in a straight line when you sprint. Further, when you Sprint, you may make a ranged attack with any weapon as if that weapon had the Assault trait. You do not suffer the normal +2DN on the attack for doing this. This does not apply to weapons with the Heavy trait.",
    "flavor": "The warriors of the Craftworlds are swift and certain, able to fight on the move with startling effectiveness.",
    "source": "apocrypha",
    "page": 83
  },
  {
    "id": "battle_fortune_aoa",
    "name": "Battle Fortune (Abundance of Apocrypha)",
    "cost": 25,
    "prerequisites": {
      "keywords": [
        "ASPECT WARRIOR"
      ],
      "other": "Dire Avenger aspect"
    },
    "effect": "You are protected by fate, warded from death until your purpose is done. You may roll Determination against Mortal Wounds. In addition, when you Roll Determination, you do not suffer Shock.",
    "flavor": "",
    "source": "apocrypha",
    "page": 247
  },
  {
    "id": "battle_psyker",
    "name": "Battle-Psyker",
    "cost": 20,
    "prerequisites": {
      "skills": {
        "psychicMastery": 4
      }
    },
    "effect": "When you successfully use a psychic power that forces targets to take a Test to resist its effects, the DN of that Test is increased by +Rank.",
    "flavor": "You wield your powers with unstoppable force, compelling your victims to submit to your will.",
    "source": "redacted1",
    "page": 61
  },
  {
    "id": "battle_psyker_aeldari",
    "name": "Battle Psyker (Aeldari)",
    "cost": 10,
    "prerequisites": {
      "skills": {
        "psychicMastery": 4
      }
    },
    "effect": "When you successfully activate a power from the Runes of Battle Discipline (pages 72–73), you activate both of the power's listed effects, rather than just one.",
    "flavor": "You have walked the Path of the Warlock long enough to balance its augmenting and destructive powers against one another.",
    "source": "aeldari",
    "page": null
  },
  {
    "id": "benediction_of_darkness_aoa",
    "name": "Benediction of Darkness (Abundance of Apocrypha)",
    "cost": 20,
    "prerequisites": {
      "keywords": [
        "CHAOS",
        "PRIEST"
      ],
      "other": "Prayers to the Dark Gods"
    },
    "effect": "If this Prayer is successful, you and all allies with the CHAOS keyword within 12m, gain + Double Rank to Defence against ranged attacks while the Prayer remains in effect.",
    "flavor": "As your words grow louder, inly blackness pours from your eyes, forming a swirling mist around your allies.",
    "source": "apocrypha",
    "page": 256
  },
  {
    "id": "berzerker",
    "name": "Berzerker",
    "cost": 20,
    "prerequisites": {},
    "effect": "Whenever you see an individual within 30 metres of you suffer a Critical Hit or the Bleeding Condition, you gain 1 point of Wrath. The GM may ask you to make a DN 1 Corruption Test whenever this Talent is activated.",
    "flavor": "The very sight of blood energises you in battle.",
    "source": "core",
    "page": 130
  },
  {
    "id": "betalevel_psyker_aoa",
    "name": "Beta-Level Psyker (Abundance of Apocrypha)",
    "cost": 50,
    "prerequisites": {
      "tier": 4,
      "keywords": [
        "PSYKER"
      ],
      "species": [
        "human",
        "adeptus astartes",
        "primaris astartes"
      ]
    },
    "effect": "When you attempt to use a psychic power at the Transcendent power level, you may set any of the Wrath dice to a 6 rather than rolling it. If you set any Wrath die in this way, you must roll on the Perils of the Warp table and add +10 to the Perils of the Warp roll for each Wrath die set to a 6. You gain 2d3 Corruption points when you take this talent. You may not select the Alpha-level Psyker or Gamma-level Psyker talents.",
    "flavor": "You are an exceptionally potent psyker and can draw deeply from the Warp if you’re willing to risk the consequences.",
    "source": "apocrypha",
    "page": 232
  },
  {
    "id": "betrayer",
    "name": "Betrayer",
    "cost": 20,
    "prerequisites": {
      "keywords": [
        "CHAOS"
      ]
    },
    "effect": "You gain +1 Corruption. You can sacrifice a willing or unconscious individual — such as a devotee or follower — to gain a point of Wrath. At the GM's discretion, this sacrifice triggers a DN 5 Corruption Test.",
    "flavor": "You can make mortal sacrifices to the Chaos Gods to gain their favour.",
    "source": "core",
    "page": 130
  },
  {
    "id": "beyond_mortality",
    "name": "Beyond Mortality",
    "cost": 10,
    "prerequisites": {
      "keywords": [
        "DRUKHARI"
      ],
      "other": "Influence 4+"
    },
    "effect": "To use this Talent, one of your allies must recover at least a fraction of your body and return it to the Dark City for operation. After a recovery period in the care of the Covens, you return to life with all Wounds and Traumatic Injuries cleared. Each time you return from the dead, you gain 1 Corruption Point, which cannot be resisted with a Corruption Test.",
    "flavor": "You have brokered a deal with a Haemonculus Coven so that, if you die, they can restore you to life through agonising fleshcrafting procedures.",
    "source": "aeldari",
    "page": 60
  },
  {
    "id": "binary_chatter",
    "name": "Binary Chatter",
    "cost": 20,
    "prerequisites": {
      "keywords": [
        "ADEPTUS MECHANICUS"
      ]
    },
    "effect": "You gain +Double Rank bonus dice whenever you attempt to instruct, program, or question a servitor or a similar construct, such as a cherub or a servo-skull.",
    "flavor": "You are adept at controlling mechanical constructs.",
    "source": "core",
    "page": 129
  },
  {
    "id": "blade_artist",
    "name": "Blade Artist",
    "cost": 20,
    "prerequisites": {
      "skills": {
        "weaponSkill": 2
      },
      "keywords": [
        "DRUKHARI"
      ]
    },
    "effect": "When you use an AELDARI or DRUKHARI melee weapon, it gains the Rending (Rank) Trait. If it already has the Rending Trait, increase its Rending rating by +Rank.",
    "flavor": "Paranoia is rife in the Dark City, and many wear hidden blades or armour-implanted spikes so they are never entirely disarmed. You have trained in the use of melee weapons, either to savour your kills up close, or employ as a last resort.",
    "source": "aeldari",
    "page": 60
  },
  {
    "id": "blademaster",
    "name": "Blademaster",
    "cost": 20,
    "prerequisites": {
      "skills": {
        "weaponSkill": 2
      }
    },
    "effect": "Any weapons you use with the BLADE Keyword gain the Parry Trait. When using a weapon that already has the Parry Trait (whether it has the BLADE Keyword or not), you gain additional +Rank Defence against melee attacks.",
    "flavor": "You have mastered the art of blocking and riposting, giving you the edge when you clash swords with an opponent.",
    "source": "redacted1",
    "page": 61
  },
  {
    "id": "blademaster_aoa",
    "name": "Blademaster (Abundance of Apocrypha)",
    "cost": 40,
    "prerequisites": {
      "keywords": [
        "ASPECT WARRIOR"
      ],
      "other": "Weapon Skill rating 7+"
    },
    "effect": "Your mastery of the blade is incomparable, and few foes can overcome your defences or withstand your attacks. You increase the bonus to Defence from weapons with the Parry quality to +2, and you add +2ED to damage with all melee weapons with the BLADE or POWER FIELD keywords.",
    "flavor": "",
    "source": "apocrypha",
    "page": 247
  },
  {
    "id": "bladestorm",
    "name": "Bladestorm",
    "cost": 20,
    "prerequisites": {},
    "effect": "When you use a SHURIKEN weapon, increase the Salvo rating by +Rank.",
    "flavor": "When outnumbered, as the Aeldari often are, you can even the odds with a hail of monomolecular-edged discs, discharged with an extraordinary rate of fire.",
    "source": "aeldari",
    "page": 61
  },
  {
    "id": "bladestorm_aoa",
    "name": "Bladestorm (Abundance of Apocrypha)",
    "cost": 10,
    "prerequisites": {
      "species": [
        "aeldari"
      ]
    },
    "effect": "When you make a shooting attack with a SHURIKEN weapon, for each exalted icon you roll, you may roll one bonus die on that attack. These additional dice cannot themselves generate bonus dice.",
    "flavor": "Well-trained Aeldari can lay down a hail of fire from their shuriken weapons, their superior reflexes allowing them to track even the most sudden movement and place every shot perfectly,",
    "source": "apocrypha",
    "page": 232
  },
  {
    "id": "blindfighter",
    "name": "Blindfighter",
    "cost": 20,
    "prerequisites": {
      "skills": {
        "awareness": 3
      }
    },
    "effect": "The Blinded Condition does not affect your attack Tests using your Weapon Skill (I).",
    "flavor": "You have trained to fight blind, relying on your instincts and other senses to detect and dispatch your foes even when you cannot see.",
    "source": "core",
    "page": 130
  },
  {
    "id": "blissful_devotion_aoa",
    "name": "Blissful Devotion (Abundance of Apocrypha)",
    "cost": 20,
    "prerequisites": {
      "keywords": [
        "CHAOS",
        "PRIEST",
        "SLAANESH"
      ],
      "other": "Prayers to the Dark Gods"
    },
    "effect": "If this Prayer is successful, then while the Prayer remains in effect, increase your Speed by +Double Rank when advancing or charging",
    "flavor": "You ask your beloved Prince of Pleasure to grant you the unnatural swiftness of their daemonic children.",
    "source": "apocrypha",
    "page": 257
  },
  {
    "id": "blood_for_the_blood_god_aoa",
    "name": "Blood for the Blood God (Abundance of Apocrypha)",
    "cost": 30,
    "prerequisites": {
      "keywords": [
        "CHAOS",
        "KHORNE"
      ]
    },
    "effect": "You gain +1d3 Corruption. After you make a melee attack, you may spend 1 Wrath to make an additional attack.",
    "flavor": "You are a blood-soaked devotee of the Lord of Skulls, and your desire to slay cannot be sated.",
    "source": "apocrypha",
    "page": 174
  },
  {
    "id": "blood_must_flow",
    "name": "Blood Must Flow!",
    "cost": 20,
    "prerequisites": {
      "skills": {
        "weaponSkill": 2
      }
    },
    "effect": "You may spend an Exalted Icon whenever you make a successful Weapon Skill (I) attack to inflict the Bleeding Condition to your target.",
    "flavor": "You know how to place your strikes to inflict haemorrhaging injuries.",
    "source": "core",
    "page": 130
  },
  {
    "id": "blood_surge_aoa",
    "name": "Blood Surge (Abundance of Apocrypha)",
    "cost": 20,
    "prerequisites": {
      "keywords": [
        "CHAOS",
        "KHORNE"
      ]
    },
    "effect": "You gain +1d3 Corruption. Whenever an enemy makes a ranged attack against you, after the attack has been resolved, you may move up to your Speed directly towards the shooter as a Reflexive Action.",
    "flavor": "Little can restrain your desire to close with the enemy and tear them limb from limb.",
    "source": "apocrypha",
    "page": 232
  },
  {
    "id": "bloodhound",
    "name": "Bloodhound",
    "cost": 10,
    "prerequisites": {},
    "effect": "You may nominate a single creature or individual as the target of this Talent — you cannot switch targets until the next Regroup. You gain +Rank bonus dice to Survival (Wil) Tests to track the target, and any attack Tests you make against the target.",
    "flavor": "Once you have the scent of a potential target, nothing short of their death or yours can end your pursuit.",
    "source": "redacted1",
    "page": 61
  },
  {
    "id": "bloodlust_aoa",
    "name": "Bloodlust (Abundance of Apocrypha)",
    "cost": 20,
    "prerequisites": {},
    "effect": "Immediately after you kill an enemy with a melee attack, you may move up to half your Speed towards the next nearest enemy. You may make this move a number of times per round equal to your Rank.",
    "flavor": "Your fury has not been sated by those you have already slain… maybe the next one will quench your thirst for blood.",
    "source": "apocrypha",
    "page": 154
  },
  {
    "id": "bolstering_purity",
    "name": "Bolstering Purity",
    "cost": 40,
    "prerequisites": {
      "keywords": [
        "ADEPTUS MINISTORUM",
        "ADEPTA SORORITAS"
      ],
      "keywordsAny": true
    },
    "effect": "You gain +1 Faith. As a Reflexive Action, you can spend 1 Faith to bolster another's purity. Select one character with the IMPERIUM keyword within hearing range — this can be yourself. The character automatically succeeds all Resolve and Conviction Tests until the end of the Round. Once you have used this ability, you cannot use it again until you have completed a Regroup.",
    "flavor": "Your words drip with the Emperor's immaculate will, reinforcing the faith of your allies.",
    "isFaithTalent": true,
    "source": "core",
    "page": 142
  },
  {
    "id": "bolter_discipline",
    "name": "Bolter Discipline",
    "cost": 10,
    "prerequisites": {
      "keywords": [
        "ADEPTUS ASTARTES"
      ]
    },
    "effect": "When you use a weapon with the BOLT Keyword, it gains the Rapid Fire (2) Trait. If the weapon already has the Rapid Fire Trait, add +Rank to the weapon's Rapid Fire rating.",
    "flavor": "Your Bolter spits forth a storm of iron that pulverises threats in an unyielding sequence of explosions.",
    "source": "redacted1",
    "page": 62
  },
  {
    "id": "bolter_drill_aoa",
    "name": "Bolter Drill (Abundance of Apocrypha)",
    "cost": 20,
    "prerequisites": {
      "keywords": [
        "CRIMSON FISTS"
      ]
    },
    "effect": "When you make a successful attack with a weapon with the Bolt keyword, and you roll a 6 on your Wrath die, instead of inflicting a critical hit you may choose to spend 1 ammo and make an additional attack with that weapon immediately. This additional attack may not generate any further attacks.",
    "flavor": "Your aim is guided by years, even decades, of marksmanship training, and you can unleash a devastating fusillade of bolter fire.",
    "source": "apocrypha",
    "page": 232
  },
  {
    "id": "bombardier",
    "name": "Bombardier",
    "cost": 20,
    "prerequisites": {},
    "effect": "Any weapons you use with the Blast Trait increase their Blast rating by +Double Rank. Against Mobs (or when using a simplified theatre of the mind approach) this therefore increases the number of targets hit by +Rank.",
    "flavor": "Your munitions are modified to be extra explosive and pitched at the perfect arc to cause maximum carnage.",
    "source": "redacted1",
    "page": 62
  },
  {
    "id": "bombardment",
    "name": "Bombardment",
    "cost": 40,
    "prerequisites": {
      "rank": 2,
      "keywords": [
        "ADEPTUS ASTARTES",
        "AELDARI",
        "ASTRA MILITARUM",
        "CHAOS",
        "ORK",
        "ROGUE TRADER"
      ],
      "keywordsAny": true
    },
    "effect": "Once per game session, a character with this Talent and access to communications with their vessel or other forces may call in a bombardment. The bombardment attack deals 20 damage +Double Rank ED to all targets within Rank x 10 metres of the designated target.",
    "flavor": "You have the connections and military backup to call in an airstrike. A bombardment may come from ground-based artillery, aircraft, or even a voidship in low orbit. In all cases, the attacks are devastating to their targets.",
    "source": "core",
    "page": 129
  },
  {
    "id": "born_survivor",
    "name": "Born Survivor",
    "cost": 10,
    "prerequisites": {
      "skills": {
        "survival": 2
      }
    },
    "effect": "You can use Survival (Wil) instead of Medicae (Int) to remove your own Wounds, Shock, or Conditions (Wrath & Glory, page 124). You do not suffer the usual DN penalties for using this ability on yourself.",
    "flavor": "You are aggressively self-reliant, substituting your culture's folk remedies for formal medical training.",
    "source": "redacted1",
    "page": 62
  },
  {
    "id": "bounding_leap_aoa",
    "name": "Bounding Leap (Abundance of Apocrypha)",
    "cost": 30,
    "prerequisites": {
      "keywords": [
        "ASPECT WARRIOR"
      ],
      "other": "Athletics rating 5+"
    },
    "effect": "Your speed and grace are superlative, and little can match the pace at which you cross the battlefield. You may use you Agility instead of your Strength for all Athletics tests, and you use your Agility to calculate how far you can jump. Finally, you may Fall Back as a Simple Action.",
    "flavor": "",
    "source": "apocrypha",
    "page": 247
  },
  {
    "id": "brawler_aoa",
    "name": "Brawler (Abundance of Apocrypha)",
    "cost": 10,
    "prerequisites": {
      "skills": {
        "athletics": 2,
        "weaponSkill": 2
      }
    },
    "effect": "Your unarmed strike inflicts (S) + Double Rank +1ED damage. In addition, when you succeed at an Athletics Interaction Attack, you may shift one Exalted Icon to inflict your unarmed strike damage to the enemy.",
    "flavor": "Your body is as dangerous as your weapons.",
    "source": "apocrypha",
    "page": 233
  },
  {
    "id": "brotherhood_of_psykers_aoa",
    "name": "Brotherhood of Psykers (Abundance of Apocrypha)",
    "cost": 10,
    "prerequisites": {
      "keywords": [
        "GREY KNIGHTS",
        "PSYKER"
      ]
    },
    "effect": "When you cast a Sanctic psychic power which affects only yourself, then each GREY KNIGHT with this talent within 10m of you also receives the effects of the power.",
    "flavor": "Your mind is a piece of a greater weapon against the darkness, one that is only complete alongside the wills of your brothers.",
    "source": "apocrypha",
    "page": 233
  },
  {
    "id": "brutalist",
    "name": "Brutalist",
    "cost": 20,
    "prerequisites": {
      "attributes": {
        "strength": 3
      }
    },
    "effect": "Every melee weapon you wield has the Brutal Weapon Trait (p.209), including your unarmed strikes. If you make a successful melee attack with a weapon that already has the Brutal Weapon Trait, you deal an additional +1 damage. This bonus damage is applied after calculating your total damage, not to the weapon's Damage value.",
    "flavor": "You strike brutal blows regardless of the weapon you wield.",
    "source": "core",
    "page": 130
  },
  {
    "id": "built_tough",
    "name": "Built Tough",
    "cost": 10,
    "prerequisites": {
      "attributes": {
        "strength": 3,
        "toughness": 3
      }
    },
    "effect": "Any weapons you carry with the Heavy (X) Trait halve their Heavy rating.",
    "flavor": "You have the squat, sturdy physique and temperament to manage heavy loads without complaint.",
    "source": "redacted1",
    "page": 62
  },
  {
    "id": "bulging_biceps_aoa",
    "name": "Bulging Biceps (Abundance of Apocrypha)",
    "cost": 10,
    "prerequisites": {
      "attributes": {
        "strength": 4
      }
    },
    "effect": "When you wield a Heavy weapon, you are no longer knocked Prone by a Complication when firing the weapon. You may wield weapons with the TWO-HANDED keyword in one hand.",
    "flavor": "Your powerful form allows you to wield heavy weapons more easily.",
    "source": "apocrypha",
    "page": 233
  },
  {
    "id": "bull_charge_aoa",
    "name": "Bull Charge (Abundance of Apocrypha)",
    "cost": 10,
    "prerequisites": {
      "attributes": {
        "strength": 3
      }
    },
    "effect": "When you Charge, your melee weapons gain the Inflict (Prone) trait for that attack. This has no effect on enemies who are larger than you.",
    "flavor": "The force of your charge is undeniable.",
    "source": "apocrypha",
    "page": 233
  },
  {
    "id": "bullet_hell",
    "name": "Bullet Hell",
    "cost": 20,
    "prerequisites": {},
    "effect": "Any weapons you carry with the PROJECTILE Keyword increase their Salvo rating by +Rank.",
    "flavor": "You discharge a hailstorm of lead from your shooter, spent bullet casings puddling around your feet.",
    "source": "redacted1",
    "page": 62
  },
  {
    "id": "bulwark_imperative_aoa",
    "name": "Bulwark Imperative (Abundance of Apocrypha)",
    "cost": 20,
    "prerequisites": {
      "keywords": [
        "SKITARII"
      ]
    },
    "effect": "At the start of any of your turns, you may activate the Bulwark Imperative. This adds +Rank to your Resilience but reduces your Speed by 3. At the end of a turn in which you activate the Bulwark Imperative, you suffer 1d3+2 Shock.",
    "flavor": "Though doctrina imperatives are normally initiated by a Tech-Priest overseeing the Skitarii in action, you have been equipped with protocols for independent action. You can engage an imperative which braces you against incoming fire.",
    "source": "apocrypha",
    "page": 233
  },
  {
    "id": "burning_bright",
    "name": "Burning Bright",
    "cost": 10,
    "prerequisites": {},
    "effect": "You reduce the number of Traumatic Injuries required to kill you by 1 (to a minimum of 1). Your party begins each session with +1 Glory (up to the usual maximum).",
    "flavor": "The doom of your people is written in stone, but you are determined to fight till the end with fire in your heart.",
    "source": "aeldari",
    "page": 61
  },
  {
    "id": "burning_heat_aoa",
    "name": "Burning Heat (Abundance of Apocrypha)",
    "cost": 25,
    "prerequisites": {
      "keywords": [
        "ASPECT WARRIOR"
      ],
      "other": "Fire Dragon aspect, Toughness 5+"
    },
    "effect": "Enemies who close with you find their strength and their will to fight sapped by searing, stifling heat. Whenever an enemy makes a melee attack against you or a member of your squad, they add +2 to the DN required to hit.",
    "flavor": "",
    "source": "apocrypha",
    "page": 247
  },
  {
    "id": "by_his_will",
    "name": "By His Will",
    "cost": 20,
    "prerequisites": {
      "keywords": [
        "ADEPTUS MINISTORUM",
        "ADEPTA SORORITAS"
      ],
      "keywordsAny": true
    },
    "effect": "You gain +1 Faith. When you Help a character with the IMPERIUM Keyword, you add triple the number of bonus dice if you spend 1 Faith.",
    "flavor": "The depth of your faith allows you to call upon the God-Emperor to assist you when you work with another of His children.",
    "isFaithTalent": true,
    "source": "core",
    "page": 142
  },
  {
    "id": "canticle_of_hate_aoa",
    "name": "Canticle of Hate (Abundance of Apocrypha)",
    "cost": 20,
    "prerequisites": {
      "keywords": [
        "ADEPTUS ASTARTES",
        "IMPERIUM",
        "PRIEST"
      ],
      "other": "Litanies of Devotion"
    },
    "effect": "If this Prayer is successful, you and all allies with the IMPERIUM keyword within 12m of you may add +Rank to Speed when charging until the end of your next turn.",
    "flavor": "Bellowing your hatred of the foe, you lead your allies to the wholesale destruction of the enemy.",
    "source": "apocrypha",
    "page": 255
  },
  {
    "id": "castigate_the_witch",
    "name": "Castigate the Witch",
    "cost": 20,
    "prerequisites": {
      "attributes": {
        "willpower": 3
      },
      "keywords": [
        "ADEPTA SORORITAS",
        "ADEPTUS MINISTORUM"
      ],
      "keywordsAny": true
    },
    "effect": "You gain +1 Faith. When a Psychic Power targeting you fails to have an effect, you may spend 1 Faith as a Reflexive Action. The psyker who targeted you immediately suffers 2+Double Rank Shock.",
    "flavor": "When foul psykers fail, your righteous castigation causes anguish to their heretical form.",
    "isFaithTalent": true,
    "source": "redacted2",
    "page": 68
  },
  {
    "id": "catechism_of_fire",
    "name": "Catechism of Fire",
    "cost": 20,
    "prerequisites": {
      "skills": {
        "leadership": 4
      },
      "keywords": [
        "ADEPTUS ASTARTES"
      ]
    },
    "effect": "Exhorting your comrades to expend every bolt and ounce of fuel they have in the utter destruction of oncoming foes, you direct their armaments towards nearby enemies so that you might destroy a threat before it can close to melee. When you begin reciting this Litany, you designate the threat closest to you. Affected targets within 20m gain an additional +2 ED for damage for each hit applied to the designated threat when making ranged attacks. By spending an additional point of Faith, the affected targets instead gain +3ED to damage for each hit applied to the threat.",
    "flavor": "[AI-Generated] Your words mark the enemy for destruction, focusing your brothers' fire with righteous precision.",
    "isLitany": true,
    "source": "voa",
    "page": 58
  },
  {
    "id": "catechism_of_fire_aoa",
    "name": "Catechism of Fire (Abundance of Apocrypha)",
    "cost": 20,
    "prerequisites": {
      "keywords": [
        "ADEPTUS ASTARTES",
        "IMPERIUM",
        "PRIEST"
      ],
      "other": "Litanies of Devotion"
    },
    "effect": "If this Prayer is successful, you and all allies with the IMPERIUM keyword within 12m of you may add +Rank ED to all ranged attacks against the closest enemy, while the Prayer remains in effect.",
    "flavor": "You call upon your comrades to unleash a relentless storm of close-range firepower.",
    "source": "apocrypha",
    "page": 254
  },
  {
    "id": "catechism_of_repugnance_aoa",
    "name": "Catechism of Repugnance (Abundance of Apocrypha)",
    "cost": 20,
    "prerequisites": {
      "keywords": [
        "ADEPTUS MINISTORUM",
        "IMPERIUM",
        "PRIEST",
        "ADEPTA SORORITAS"
      ],
      "other": "Hymns of Battle"
    },
    "effect": "If this Prayer is successful, then while the prayer remains in effect, then whenever you or any IMPERIUM characters within 12m of makes a ranged attack with a BOLT weapon, the attack’s damage is increased by +Rank ED, and the attack’s AP is improved by 1 (that is, AP -1 to AP -2) if the attack is at Short Range.",
    "flavor": "With the holy bolter we shall cleanse the mutant, the alien, and the heretic. With the Emperor’s gift do we deliver our hatred of the defiler.",
    "source": "apocrypha",
    "page": 256
  },
  {
    "id": "catfall_aoa",
    "name": "Catfall (Abundance of Apocrypha)",
    "cost": 10,
    "prerequisites": {
      "attributes": {
        "agility": 3
      }
    },
    "effect": "When you fall, count the distance fallen as half the actual distance for determining damage.",
    "flavor": "You’re nimble and suffer less from the effects of falling.",
    "source": "apocrypha",
    "page": 233
  },
  {
    "id": "chainsaw_warrior",
    "name": "Chainsaw Warrior",
    "cost": 10,
    "prerequisites": {},
    "effect": "When you use a weapon with the CHAIN Keyword, you may re-roll any ED dice you choose, but must accept the second result.",
    "flavor": "Whatever the spinning teeth of your Chainblade doesn't catch on the first rotation is shredded on the next pass.",
    "source": "redacted1",
    "page": 62
  },
  {
    "id": "channelled_strikes_aoa",
    "name": "Channelled Strikes (Abundance of Apocrypha)",
    "cost": 10,
    "prerequisites": {
      "keywords": [
        "PSYKER"
      ]
    },
    "effect": "When you attack with a melee weapon with the FORCE keyword, the weapon gains the Mortal (1) trait.",
    "flavor": "You have honed your connection to the Immaterium, allowing you to deliver punishing warp-fuelled strikes.",
    "source": "apocrypha",
    "page": 233
  },
  {
    "id": "chaos_familiar",
    "name": "Chaos Familiar",
    "cost": 20,
    "prerequisites": {
      "keywords": [
        "CHAOS"
      ]
    },
    "effect": "You gain +2 Corruption. You gain a minion, a lesser daemon spawned from the Warp. It uses the Brimstone Horror profile (see p.349), but has a 1 in all Attributes. Its only Skills are Scholar (5) and Stealth (8). The daemon is fickle. To get it to take action, you must first succeed at an Opposed Persuasion or Intimidation Test. Once persuaded, the daemon goes to extreme measures to accomplish whatever task you set, to the best of its limited abilities. At the GM's discretion, if the minion sees you act against the interests of the Warp, the familiar immediately turns on you until it's destroyed or convinced of its mistake. If the familiar is slain, you must spend a Wrath Point to summon it again — which is time-consuming and requires the GM's permission.",
    "flavor": "The Dark Gods have rewarded you with a minion drawn from the Warp. This malign creature revels in violence and deception, and serves as a constant reminder of your choices. Chaos familiars are unreliable, fickle, and treacherous, but they can be a powerful tool in any cultist's arsenal.",
    "source": "core",
    "page": 130
  },
  {
    "id": "chorus_of_spiritual_fortitude_aoa",
    "name": "Chorus of Spiritual Fortitude (Abundance of Apocrypha)",
    "cost": 20,
    "prerequisites": {
      "keywords": [
        "ADEPTUS MINISTORUM",
        "IMPERIUM",
        "PRIEST"
      ],
      "other": "Hymns of Battle"
    },
    "effect": "If this Prayer is successful, end the effect of any psychic power or warp phenomenon on yourself and allies with the IMPERIUM keyword. In addition, while the Prayer remains in effect, you and the affected allies cannot be targeted by psychic powers.",
    "flavor": "The Emperor protects the faithful from the corruption that lurks in the darkness.",
    "source": "apocrypha",
    "page": 255
  },
  {
    "id": "codex_discipline_aoa",
    "name": "Codex Discipline (Abundance of Apocrypha)",
    "cost": 10,
    "prerequisites": {
      "keywords": [
        "ULTRAMARINES"
      ]
    },
    "effect": "You increase your Conviction and Resolve by +Rank.",
    "flavor": "The tenets of the Codex Astartes are sacrosanct to you, and you lean upon their guidance to see you through the worst of times.",
    "source": "apocrypha",
    "page": 233
  },
  {
    "id": "codex_duellist",
    "name": "Codex Duellist",
    "cost": 20,
    "prerequisites": {
      "skills": {
        "weaponSkill": 4
      },
      "keywords": [
        "ADEPTUS ASTARTES"
      ]
    },
    "effect": "You are a practitioner of one of the many duelling schools derived from the Codex Astartes teachings and the martial traditions of your Chapter. Precise movements ensure your blade arrives with maximum force and no time to dodge or brace against its killing edge. When a Threat attempts to roll Determination against damage you inflict with a melee weapon, the first (Rank) Wounds inflicted require 2 Icons each on the Determination Test to eliminate, although the Threat still only suffers 1 Shock for each Wound reduced.",
    "flavor": "[AI-Generated] You have mastered the dueling forms prescribed by the Codex Astartes, striking with precision that defies defense.",
    "source": "voa",
    "page": 45
  },
  {
    "id": "codex_innovator",
    "name": "Codex Innovator",
    "cost": 20,
    "prerequisites": {
      "attributes": {
        "intellect": 5
      },
      "keywords": [
        "ADEPTUS ASTARTES",
        "ULTRAMARINES"
      ]
    },
    "effect": "Since the return of Roboute Guilliman, the Codex Astartes has slowly been recognised as a living document which the greatest tacticians may contribute and iterate upon. Your own studious knowledge of the Codex Astartes and years of service allow you to quickly adapt and evolve strategies on the battlefield in line with its tenets. [...] When executing a strategic plan or tactic that you helped create, you add + (Rank) dice to all Leadership (Wil) and Persuasion (Fel) Tests to guide others through the details. In addition, if you have at least one hour to plan for an upcoming encounter or mission, you receive one bonus Wrath point that can only be spent on a Narrative Declaration (Wrath & Glory Core Rulebook, page 164) relevant to your plan. This Wrath point can carry over between sessions, but you may never possess more than one bonus Wrath point from this Talent.",
    "flavor": "[AI-Generated] Like Guilliman himself, you understand that the Codex is a guide, not a cage. Adaptation is the key to victory.",
    "source": "voa",
    "page": 45
  },
  {
    "id": "combat_driving_aoa",
    "name": "Combat Driving (Abundance of Apocrypha)",
    "cost": 10,
    "prerequisites": {
      "skills": {
        "pilot": 3
      }
    },
    "effect": "When you PILOT a vehicle that you share at least one keyword with, you may roll Determination for that vehicle when it suffers an attack. The dice pool for this is equal to your total Pilot (Agility) test or the vehicle’s Manoeuvrability score, whichever is lower, and you suffer 1 Shock for each Wound cancelled by this roll.",
    "flavor": "You’ve learned how to turn and manoeuvre a vehicle you’re driving to minimise the damage it receives.",
    "source": "apocrypha",
    "page": 114
  },
  {
    "id": "concealed_cavity",
    "name": "Concealed Cavity",
    "cost": 10,
    "prerequisites": {},
    "effect": "You can declare that you are concealing an item inside your compartment — this item can be no larger than a small knife, recording device, or miniaturised auspex. Normal searches of your person will never reveal this cavity, but if the search involves the use of technology, you gain +Double Rank bonus dice on Stealth (A) Tests to conceal it. If you retrieve a weapon from the compartment and attack with it on the same Turn, you gain +Double Rank bonus dice on the attack Test.",
    "flavor": "You have a tiny compartment hidden on your person, either inside an augmetic or carved into your flesh.",
    "source": "redacted1",
    "page": 62
  },
  {
    "id": "conqueror_imperative_aoa",
    "name": "Conqueror Imperative (Abundance of Apocrypha)",
    "cost": 20,
    "prerequisites": {
      "keywords": [
        "SKITARII"
      ]
    },
    "effect": "At the start of any of your turns, you may activate the Conqueror Imperative. This adds +Double Rank bonus dice to any melee attacks you attempt during that turn but increases the DN of any ranged attacks you attempt that turn by +3. At the end of a turn in which you activate the Conqueror Imperative, you suffer 1d3+2 Shock.",
    "flavor": "Though doctrina imperatives are normally initiated by a Tech-Priest overseeing the Skitarii in action, you have been equipped with protocols for independent action. You can engage an imperative which enhances your ferocity and aggression for short bursts.",
    "source": "apocrypha",
    "page": 234
  },
  {
    "id": "consecrated_light",
    "name": "Consecrated Light",
    "cost": 20,
    "prerequisites": {
      "keywords": [
        "ADEPTUS MINISTORUM"
      ]
    },
    "effect": "You gain +1 Faith. As a Reflexive Action, you may spend 1 Faith and present a holy symbol of the Imperial Cult. You and any allies with the IMPERIUM Keyword within 15 + Double Rank metres gain +Double Rank bonus dice on Fear and Corruption Tests until the end of the Round.",
    "flavor": "The Emperor's power can manifest physically for the faithful in times of need, a beacon to bolster the citizens of the Imperium.",
    "isFaithTalent": true,
    "source": "core",
    "page": 143
  },
  {
    "id": "contagion_aoa",
    "name": "Contagion (Abundance of Apocrypha)",
    "cost": 20,
    "prerequisites": {
      "keywords": [
        "CHAOS",
        "NURGLE"
      ]
    },
    "effect": "Enemies within 1+ Double Rank metres of you reduce their Resilience by 1 and roll 1 fewer dice when they roll Determination.",
    "flavor": "You carry scores of virulent diseases, and when you march to war, these diseases spread. Flesh rots and metal rusts in your presence.",
    "source": "apocrypha",
    "page": 234
  },
  {
    "id": "conversational_cogitator",
    "name": "Conversational Cogitator",
    "cost": 10,
    "prerequisites": {
      "keywords": [
        "ADEPTUS MECHANICUS"
      ]
    },
    "effect": "Before making a Cunning (Fel), Deception (Fel), Insight (Fel), or Persuasion (Fel) Skill Test you can choose to use this Talent to use your Tech (Int) Skill instead. You must complete a Regroup or Respite before you can use this Talent again.",
    "flavor": "The cogitation devices that form your brain are finely tuned. Through the cold purity of logic you can calculate the likely outcomes of a conversation and predict the responses of weaker biological minds.",
    "source": "core",
    "page": 131
  },
  {
    "id": "coordinated_engagement_aoa",
    "name": "Coordinated Engagement (Abundance of Apocrypha)",
    "cost": 10,
    "prerequisites": {
      "keywords": [
        "FIRE CASTE"
      ]
    },
    "effect": "When you make a ranged attack against an enemy who has been attacked by another character with this talent since your last turn, improve the AP of your weapon by 1 (i.e., AP -1 becomes AP -2).",
    "flavor": "T’au strategy relies on combined arms groups working in close coordination.",
    "source": "apocrypha",
    "page": 234
  },
  {
    "id": "corpus_conversion_aoa",
    "name": "Corpus Conversion (Abundance of Apocrypha)",
    "cost": 20,
    "prerequisites": {
      "keywords": [
        "PSYKER"
      ],
      "species": [
        "human"
      ]
    },
    "effect": "When you attempt to activate a psychic power, you may suffer 1, 2, or 3 Mortal Wounds. You may not reduce this damage in any way. For each Mortal Wound suffered, you add one Icon to your Psychic Mastery test.",
    "flavor": "You can sacrifice your life-force to fuel your powers.",
    "source": "apocrypha",
    "page": 235
  },
  {
    "id": "counter_attack",
    "name": "Counter Attack",
    "cost": 30,
    "prerequisites": {
      "skills": {
        "weaponSkill": 5
      }
    },
    "effect": "You can use this Talent whenever an enemy targets you with a melee attack. After the enemy has completed their attack, you may make a single melee attack against that enemy. This is treated as your Reflexive Action, but you may Counter Attack up to Rank times per Round. You may not apply any other Talents, Abilities, or combat options to a Counter Attack. If you Counter Attack, you cannot take any Move Actions on your next turn.",
    "flavor": "You are a master of melee combat, able to find an opening in your opponent's guard when they attack.",
    "source": "core",
    "page": 131
  },
  {
    "id": "counter_curse",
    "name": "Counter-Curse",
    "cost": 10,
    "prerequisites": {
      "skills": {
        "psychicMastery": 2
      }
    },
    "effect": "You gain +Rank on Tests to Deny The Witch (Wrath & Glory, pages 267-268). Once per session, you can Deny The Witch as a Reflexive Action.",
    "flavor": "Your allies tolerate your presence as a necessary evil, to prevent the enemy witches from thwarting their work.",
    "source": "redacted1",
    "page": 62
  },
  {
    "id": "crack_shot_aoa",
    "name": "Crack Shot (Abundance of Apocrypha)",
    "cost": 30,
    "prerequisites": {
      "keywords": [
        "ASPECT WARRIOR"
      ],
      "other": "Ballistic Skill rating 7+"
    },
    "effect": "The precision and lethality of your shots is legendary. You may re-roll all rolls of 1 whenever you make a ranged attack or roll for damage with a ranged attack.",
    "flavor": "",
    "source": "apocrypha",
    "page": 247
  },
  {
    "id": "crushing_blow_aoa",
    "name": "Crushing Blow (Abundance of Apocrypha)",
    "cost": 25,
    "prerequisites": {
      "keywords": [
        "ASPECT WARRIOR"
      ],
      "other": "Strength 5+"
    },
    "effect": "Your physical might is bolstered by your will to overcome the foes arrayed before you, and little can withstand the impact of their blows. The base damage of your melee attacks is increased by +Double Rank.",
    "flavor": "",
    "source": "apocrypha",
    "page": 247
  },
  {
    "id": "crux_terminatus",
    "name": "Crux Terminatus",
    "cost": 60,
    "prerequisites": {
      "keywords": [
        "1ST COMPANY VETERAN",
        "CHAPLAIN",
        "LIBRARIAN"
      ],
      "keywordsAny": true
    },
    "effect": "A 1st Company Veteran, Librarian, or Chaplain may begin with Terminator armour. Terminator armour comes with the following weapon combinations: Storm Bolter and Power Fist or Chainfist as standard. The Storm Bolter may be exchanged for a Heavy Flamer or Assault Cannon. Alternatively, the Powerfist/Chainfist may be exchanged for a Power Sword or Storm Shield. The Storm Bolter and Powerfist/Chainfist can both be exchanged for a pair of Lightning Claws. If worn by a Chaplain, the Powerfist/Chainfist is replaced with a Crozius Arcanum. If worn by a Librarian, the Powerfist/Chainfist is replaced with a Force Weapon.",
    "flavor": "[AI-Generated] You have earned the right to wear the ancient Tactical Dreadnought Armour, becoming a walking fortress of ceramite and adamantium.",
    "isAscension": true,
    "source": "voa",
    "page": 43
  },
  {
    "id": "dark_zealotry_aoa",
    "name": "Dark Zealotry (Abundance of Apocrypha)",
    "cost": 20,
    "prerequisites": {
      "keywords": [
        "CHAOS",
        "PRIEST"
      ],
      "other": "Prayers to the Dark Gods"
    },
    "effect": "If this Prayer is successful, you and all allies with the CHAOS keyword within 12m of you may re- roll up to Double Rank dice on melee attacks, while the Prayer remains in effect.",
    "flavor": "All your hatred, all of your spite, issues forth in a vitriolic exhortation to destroy.",
    "source": "apocrypha",
    "page": 256
  },
  {
    "id": "de_escalator",
    "name": "De-Escalator",
    "cost": 10,
    "prerequisites": {
      "skills": {
        "weaponSkill": 2
      }
    },
    "effect": "When making a Shot To Disarm with an Unarmed Strike, you do not suffer DN penalties for a Called Shot (Wrath & Glory, pages 186-187). The DN for your opponent's Strength Test is equal to the Damage you'd have inflicted, instead of half of it.",
    "flavor": "You can disarm people with your bare hands, preventing someone you just want to talk to from making a mistake they'll regret.",
    "source": "redacted1",
    "page": 64
  },
  {
    "id": "deadly_touch_aoa",
    "name": "Deadly Touch (Abundance of Apocrypha)",
    "cost": 35,
    "prerequisites": {
      "keywords": [
        "ASPECT WARRIOR"
      ],
      "other": "Weapon Skill rating 7+"
    },
    "effect": "You know the myriad ways in which living creatures can be slain, and with precision you can deliver death with but a touch. Any melee weapon you wield, as well as your unarmed attacks, gain the Mortal (1) trait.",
    "flavor": "",
    "source": "apocrypha",
    "page": 248
  },
  {
    "id": "deadshot",
    "name": "Deadshot",
    "cost": 20,
    "prerequisites": {
      "skills": {
        "ballisticSkill": 2
      }
    },
    "effect": "When you take the Aim action (p.189) and make a Called Shot (p.187) you double the bonus ED you receive.",
    "flavor": "You are a skilled shot, trained to carefully target your enemies' weak points.",
    "source": "core",
    "page": 131
  },
  {
    "id": "death_from_above",
    "name": "Death From Above",
    "cost": 20,
    "prerequisites": {
      "skills": {
        "athletics": 3
      }
    },
    "effect": "You gain +Rank bonus dice to attack Tests made from higher ground. You can climb vertically at the same Speed as horizontal Movement without an Athletics (S) Test. You can roll Determination against Mortal Wounds from falling (Wrath & Glory, page 201).",
    "flavor": "You take a three-dimensional approach to every battle, searching for higher ground you can quickly scale and drop down from.",
    "source": "redacted1",
    "page": 64
  },
  {
    "id": "death_or_glory",
    "name": "Death Or Glory!",
    "cost": 20,
    "prerequisites": {
      "species": [
        "human"
      ]
    },
    "effect": "Whenever you are required to make a Fear Test, you may choose to instantly Charge the source of Fear, if you are able to, and make a single melee attack. Make the Fear Test after this attack resolves if the target is still alive. If you are in combat after the Fear Test resolves, you sacrifice your first Turn.",
    "flavor": "Even when terrified, you can summon the courage to mount a ferocious attack.",
    "source": "core",
    "page": 131
  },
  {
    "id": "death_to_the_false_emperor_aoa",
    "name": "Death to the False Emperor (Abundance of Apocrypha)",
    "cost": 30,
    "prerequisites": {
      "keywords": [
        "CHAOS",
        "HERETIC ASTARTES"
      ]
    },
    "effect": "When you make a successful melee attack against a character with the IMPERIUM keyword and roll a 6 on the Wrath die, you may choose to make an additional melee attack instead of inflicting a critical hit. This additional attack cannot be used to gain more attacks.",
    "flavor": "Endless is your spite. Eternal is your hate.",
    "source": "apocrypha",
    "page": 156
  },
  {
    "id": "death_visions_aoa",
    "name": "Death Visions (Abundance of Apocrypha)",
    "cost": 10,
    "prerequisites": {
      "keywords": [
        "BLOOD ANGELS",
        "FLESH TEARERS"
      ]
    },
    "effect": "When you charge into melee, you may add +Rank ED to the damage of that attack. However, you increase the Difficulty of any Willpower test to resist The Red Thirst by an amount equal to your Rank, and a Complication suffered in combat may cause you to hallucinate that you are Sanguinius himself, battling traitors in the Horus Heresy. Primaris Space Marines who take this talent become subject to The Red Thirst despite being Primaris.",
    "flavor": "Your mind and soul are upon the precipice, tormented by visions of Sanguinius’ demise and barely able to slake the rage and bloodlust in your heart.",
    "source": "apocrypha",
    "page": 235
  },
  {
    "id": "deathworld_veteran",
    "name": "Deathworld Veteran",
    "cost": 10,
    "prerequisites": {
      "attributes": {
        "toughness": 3
      }
    },
    "effect": "Choose one environmental hazard: suffocation, extreme heat, extreme cold, radiation, poisons, or another option at the GM's discretion (Wrath & Glory, pages 201-202). You gain +Rank on Toughness Tests to resist the hazard's effects, and +Double Rank to Medicae (Int) and Survival (Wil) Tests to adapt protections against that hazard. You can purchase this Talent multiple times, choosing a different environmental hazard each time.",
    "flavor": "You were raised or campaigned on one of the deadliest worlds in the Imperium, and survived only by adapting your body to resist its environmental hazards.",
    "requiresChoice": true,
    "choiceType": "freeform",
    "choiceLabel": "Environmental Hazard",
    "choiceDescription": "Choose an environmental hazard (suffocation, extreme heat, extreme cold, radiation, poisons, etc.)",
    "source": "redacted1",
    "page": 63
  },
  {
    "id": "decapitating_strikes_aoa",
    "name": "Decapitating Strikes (Abundance of Apocrypha)",
    "cost": 30,
    "prerequisites": {
      "keywords": [
        "ASPECT WARRIOR"
      ],
      "other": "Weapon Skill rating 7+"
    },
    "effect": "Your sweeping strikes seldom miss their mark, leaving maimed and butchered foes in their wake mere moments after the charge. When you inflict a critical hit with a melee attack, the severity of that critical hit automatically increases as if two Glory had been spent. You may still spend Glory to increase the severity further, if desired.",
    "flavor": "",
    "source": "apocrypha",
    "page": 248
  },
  {
    "id": "deceptive_retreat_aoa",
    "name": "Deceptive Retreat (Abundance of Apocrypha)",
    "cost": 20,
    "prerequisites": {
      "species": [
        "aeldari",
        "drukhari"
      ]
    },
    "effect": "After you make a melee attack, whether successful or not, you may spend one Glory to Fall Back as a free action.",
    "flavor": "Aeldari in battle wield deception like a blade, slipping from the fray in feigned retreat only to follow their flight with another attack.",
    "source": "apocrypha",
    "page": 235
  },
  {
    "id": "ded_ard_aoa",
    "name": "Ded ‘Ard! (Abundance of Apocrypha)",
    "cost": 40,
    "prerequisites": {
      "attributes": {
        "toughness": 5
      },
      "species": [
        "ork"
      ]
    },
    "effect": "Your Resilience is increased by +Rank, and you add +Rank to the number of Traumatic Injuries you can suffer before dying.",
    "flavor": "Injuries that would slay even other Orks are mere flesh wounds to you.",
    "source": "apocrypha",
    "page": 235
  },
  {
    "id": "dedicate_the_kill",
    "name": "Dedicate The Kill",
    "cost": 10,
    "prerequisites": {
      "other": "Faith 1+"
    },
    "effect": "In combat, you may sacrifice your Move for the Turn to nominate an Elite or Adversary in line of sight as your target. You may nominate a new target by sacrificing another Move, but this replaces the previous target. If you personally kill your target in melee combat, you regain 1 Faith.",
    "flavor": "You are a devout believer that only offerings of flesh and blood can appease your God.",
    "source": "redacted1",
    "page": 63
  },
  {
    "id": "deductive",
    "name": "Deductive",
    "cost": 20,
    "prerequisites": {
      "attributes": {
        "intellect": 3
      }
    },
    "effect": "As a Simple Action, you may use this Talent to make an Intellect-based Skill Test to recall or notice something about a target. The target can be anything, from a mag-locked door with a cantankerous machine spirit to an inscrutable Planetary Governor. If you pass the Test, the GM may give you information based on the Skill you used to make the Test. You also gain +Rank bonus dice to any Test made against that target that utilises this information. You may give this bonus to an ally if you communicate what you have learned.",
    "flavor": "Your studious mind can pick apart a problem (or person) with ease.",
    "source": "core",
    "page": 90
  },
  {
    "id": "deductive_genius",
    "name": "Deductive Genius",
    "cost": 10,
    "prerequisites": {
      "skills": {
        "investigation": 3
      }
    },
    "effect": "You can spend 1 Glory at any time for a clue on the fastest way to proceed with your current mission. The GM will give you an honest answer, but will not give you brand new information unless it can be plausibly extrapolated from what you already know. More likely, they will direct you to an individual or location where new information can be found, but this may take you into further danger! Your GM may invite you to suggest how you reached this conclusion, or even help determine the most direct way forward.",
    "flavor": "You are renowned for incredible leaps of logic, as though the voice of the God-Emperor whispers truths into your ear.",
    "source": "redacted1",
    "page": 63
  },
  {
    "id": "defend_aoa",
    "name": "Defend (Abundance of Apocrypha)",
    "cost": 40,
    "prerequisites": {
      "keywords": [
        "ASPECT WARRIOR"
      ],
      "other": "Dire Avenger aspect, Weapon Skill rating 6+"
    },
    "effect": "You are well-versed in the principles of unyielding defence, and your squad are well-drilled to ensure that no enemy can overcome them without great sacrifice. You and your squad increase Defence and Resilience by +2.",
    "flavor": "",
    "source": "apocrypha",
    "page": 83
  },
  {
    "id": "deflect_shot",
    "name": "Deflect Shot",
    "cost": 10,
    "prerequisites": {
      "attributes": {
        "initiative": 4
      }
    },
    "effect": "You can only use this Talent when wielding a weapon that has the Parry Trait and either the POWER FIELD or FORCE Keyword. The Defence bonus you gain for wielding a Parry weapon against melee attacks also applies against ranged attacks. If your attacker misses and rolls a Complication, the attack is resolved as if they had been struck by their own weapon. This Talent has no effect against area effect weapons, such as weapons with the Blast or Flamer Traits.",
    "flavor": "Your combat reflexes are so refined that a twitch of your wrist can redirect missiles back on their shooter.",
    "source": "redacted1",
    "page": 63
  },
  {
    "id": "deliverance_from_the_daemonic",
    "name": "Deliverance from the Daemonic",
    "cost": 20,
    "prerequisites": {
      "attributes": {
        "willpower": 3
      },
      "keywords": [
        "ADEPTA SORORITAS",
        "ADEPTUS MINISTORUM"
      ],
      "keywordsAny": true
    },
    "effect": "You gain +1 Faith. As a Combat Action, you may spend 1 Faith to target a CHAOS enemy within hearing range with an Opposed Willpower Test. If you succeed, the enemy suffers 1d3 +Rank Mortal Wounds. DAEMON Threats can't roll Determination to reduce this damage.",
    "flavor": "To the most unrepentantly wicked souls, the Holy Truth of the Emperor is anathema.",
    "isFaithTalent": true,
    "source": "redacted2",
    "page": 68
  },
  {
    "id": "descent_of_angels_aoa",
    "name": "Descent of Angels (Abundance of Apocrypha)",
    "cost": 20,
    "prerequisites": {
      "keywords": [
        "FLESH TEARERS"
      ]
    },
    "effect": "If you Charge into melee while using a Jump Pack, roll a number of dice equal to Double Rank. For each 6 rolled, you inflict a single Mortal Wound upon an enemy within 2 metres of your landing. Resolve this before making the melee attack from your Charge.",
    "flavor": "You emulate your winged Primarch as you descend from the skies into the heart of the enemy.",
    "source": "apocrypha",
    "page": 235
  },
  {
    "id": "devastator_doctrine",
    "name": "Devastator Doctrine",
    "cost": 30,
    "prerequisites": {
      "species": [
        "astartes"
      ],
      "tier": 3,
      "other": "Not Primaris"
    },
    "effect": "You receive a suit of Aquilla Mark VII armour, if you don't already have one, and any one of the following weapons: Heavy Bolter, Heavy Flamer, Lascannon, Missile Launcher, Multi-Melta, Plasma Cannon. You gain additional +Rank AP when using this weapon. An Agent Ascending from Tier 2 to Tier 3 may purchase this Talent instead of an Ascension Package.",
    "flavor": "An Astartes who becomes a full Battle-Brother usually starts off as a Devastator Marine, learning to master warfare from the relative safety of long range.",
    "requiresChoice": true,
    "choiceType": "weapon",
    "choiceOptions": [
      "Heavy Bolter",
      "Heavy Flamer",
      "Lascannon",
      "Missile Launcher",
      "Multi-Melta",
      "Plasma Cannon"
    ],
    "source": "redacted1",
    "page": 63
  },
  {
    "id": "devotees",
    "name": "Devotees",
    "cost": 30,
    "prerequisites": {
      "skills": {
        "leadership": 4
      }
    },
    "effect": "Your devotees are a Mob of any Troop level Threat, as described in Chapter 14: Bestiary. A number of devotees...",
    "flavor": "Through reputation or assignment, you have gathered a number of followers that will do whatever you ask. If you are attacked, they intervene.",
    "source": "core",
    "page": 132
  },
  {
    "id": "die_hard",
    "name": "Die Hard",
    "cost": 20,
    "prerequisites": {},
    "effect": "When you suffer more Wounds than your Maximum Wounds, you are not Dying. Roll once on the Memorable Injuries table and heal 1 Wound. You may not use this Talent again until you complete a Regroup.",
    "flavor": "You're hard to kill.",
    "source": "core",
    "page": 99
  },
  {
    "id": "dig_in_deep",
    "name": "Dig In Deep",
    "cost": 10,
    "prerequisites": {},
    "effect": "When targeted by enemy attacks whilst concealed by cover, you gain +2 Defence (instead of +1) if less than half of you is concealed, and +4 Defence (instead of +2) if more than half of you is concealed. If enemies target you by Shoot Through Cover (Wrath & Glory, page 189) gain +Rank Resilience.",
    "flavor": "You are an expert of defensive warfare, making maximum use of cover to reinforce your position.",
    "source": "redacted1",
    "page": 64
  },
  {
    "id": "dirty_fighter",
    "name": "Dirty Fighter",
    "cost": 20,
    "prerequisites": {},
    "effect": "Whenever you make an Interaction Attack (p.190) and you shift 2 Exalted Icons, you can inflict your target with an additional Condition. Choose the most narratively appropriate Condition from the following options: Blinded (p.199), Prone (p.200), Restrained (p.200), Staggered (p.200).",
    "flavor": "You're proficient in the art of foul play.",
    "source": "core",
    "page": 96
  },
  {
    "id": "disarming_stare",
    "name": "Disarming Stare",
    "cost": 10,
    "prerequisites": {
      "skills": {
        "intimidation": 2
      }
    },
    "effect": "When you succeed on an Interaction Attack using Intimidation (Wrath & Glory, page 190), your enemy is Staggered, in addition to other effects.",
    "flavor": "With a few choice words, or even just a look, you can slow an enemy's charge as they think better of picking a fight with you.",
    "source": "redacted1",
    "page": 64
  },
  {
    "id": "disarming_strike_aoa",
    "name": "Disarming Strike (Abundance of Apocrypha)",
    "cost": 20,
    "prerequisites": {
      "keywords": [
        "ASPECT WARRIOR"
      ],
      "other": "Weapon Skill rating 7+"
    },
    "effect": "You do not leave battle to chance, for you eliminate your foe’s weapon at the first opportunity. You ignore up to Double Rank of the normal DN penalty for a called shot when making a melee attack, so long as you are making the called shot to disarm an opponent.",
    "flavor": "",
    "source": "apocrypha",
    "page": 248
  },
  {
    "id": "disciple_of_holy_trinity",
    "name": "Disciple Of The Holy Trinity",
    "cost": 30,
    "prerequisites": {
      "keywords": [
        "ADEPTA SORORITAS"
      ]
    },
    "effect": "You add +Rank to the Damage of any weapons you use with the BOLT, FIRE or MELTA Keywords.",
    "flavor": "The Sisters of Battle venerate the Holy Trinity of bolter, flamer and melta above all other weapons, and veterans of their Order are rewarded with the most exceptional versions of such sacred tools.",
    "source": "redacted1",
    "page": 64
  },
  {
    "id": "discipline_savant",
    "name": "Discipline Savant",
    "cost": 30,
    "prerequisites": {
      "skills": {
        "psychicMastery": 4
      },
      "other": "At least 2 psychic powers from a single Discipline"
    },
    "effect": "When you take this Talent, select a psychic discipline in which you have at least 2 psychic powers. Whenever you make a Psychic Mastery (Wil) Test to activate a psychic power from that discipline, reduce the DN by 1.",
    "flavor": "Your devotion to a psychic discipline has given you mastery over your style of Warpcraft.",
    "requiresChoice": true,
    "choiceType": "discipline",
    "choiceLabel": "Psychic Discipline",
    "choiceDescription": "Choose a psychic discipline in which you have at least 2 powers",
    "source": "core",
    "page": 132
  },
  {
    "id": "disruptive_launch",
    "name": "Disruptive Launch",
    "cost": 10,
    "prerequisites": {
      "keywords": [
        "ADEPTA SORORITAS",
        "ADEPTUS ASTARTES",
        "AELDARI",
        "HERETIC ASTARTES",
        "ORK"
      ],
      "keywordsAny": true
    },
    "effect": "When equipped with a Jump Pack, you can spend a Shift on successful melee attack Tests to inflict the Hindered (1) Condition on an enemy you're engaged with. Additional Shifts can be spent to target 1 additional enemy per Shift, or increase the DN penalty of a victim's Hindered Condition by 1 per Shift.",
    "flavor": "You employ short bursts of your Jump Pack as suppressive fire, protecting you from retaliatory assaults.",
    "source": "redacted1",
    "page": 64
  },
  {
    "id": "distract_aoa",
    "name": "Distract (Abundance of Apocrypha)",
    "cost": 20,
    "prerequisites": {
      "keywords": [
        "ASPECT WARRIOR"
      ],
      "other": "Athletics rating 5+"
    },
    "effect": "The Exarch’s motions in battle are misleading, even entrancing, leaving enemies off-balance and unable to perceive when the true attack will come. You may make an Athletics Interaction attack as a Simple Action, rather than a Combat Action.",
    "flavor": "",
    "source": "apocrypha",
    "page": 245
  },
  {
    "id": "disturbing_voice",
    "name": "Disturbing Voice",
    "cost": 20,
    "prerequisites": {},
    "effect": "You gain +Rank bonus dice to Intimidation (Wil) and Leadership (Wil) Tests when you use your voice. Any Fellowship Test made with someone likely to be put off by your voice (nervous individuals, Psykers, pious members of the Ecclesiarchy) suffers +2 DN penalty.",
    "flavor": "You have a sinister and upsetting voice. This may be due to infrasonic cadences produced by a vox synthesiser, interrogation training, or just an inborn air of malice.",
    "source": "core",
    "page": 133
  },
  {
    "id": "divine_guidance",
    "name": "Divine Guidance",
    "cost": 20,
    "prerequisites": {
      "keywords": [
        "ADEPTUS MINISTORUM",
        "ADEPTA SORORITAS"
      ],
      "keywordsAny": true
    },
    "effect": "You gain +1 Faith. As a Combat Action, you can spend 1 Faith to give the Emperor's guidance. Select one character with the IMPERIUM Keyword within hearing range — this can be yourself. The character gains +Double Rank bonus dice to Ballistic Skill (A) Tests for 1 Round.",
    "flavor": "Through His direction, no shot will miss its mark.",
    "isFaithTalent": true,
    "source": "core",
    "page": 143
  },
  {
    "id": "dragons_bite_aoa",
    "name": "Dragon’s Bite (Abundance of Apocrypha)",
    "cost": 20,
    "prerequisites": {
      "keywords": [
        "ASPECT WARRIOR"
      ],
      "other": "Fire Dragon aspect, Weapon Skill rating 5+"
    },
    "effect": "You and your squad are adept at bringing your weapons to bear even in the closest confines. You and your squad may treat your Fusion Guns or any other weapon with the MELTA keyword, as if they had the Pistol trait.",
    "flavor": "",
    "source": "apocrypha",
    "page": 248
  },
  {
    "id": "dreadful_vigour_aoa",
    "name": "Dreadful Vigour (Abundance of Apocrypha)",
    "cost": 25,
    "prerequisites": {
      "keywords": [
        "CHAOS",
        "NURGLE"
      ]
    },
    "effect": "You gain +1d3 Corruption. As a simple action, you may spend 1 Wrath to regain 1d3+2 Wounds.",
    "flavor": "Grandfather Nurgle bestows life and vitality upon his children. Your wounds knit with tumorous growths, and vile ichor bubbles forth to replace spilt blood.",
    "source": "apocrypha",
    "page": 235
  },
  {
    "id": "dual_wield",
    "name": "Dual Wield",
    "cost": 20,
    "prerequisites": {},
    "effect": "When you wield one weapon in each hand the DN penalty for using the Multi-Attack option is reduced by 2. Each weapon must have the Pistol Trait or be a one-handed melee weapon. You may also use a different weapon you are wielding for each of your Multi-Attacks, rolling damage separately for each weapon.",
    "flavor": "You can wield two weapons with uncanny accuracy.",
    "source": "core",
    "page": 133
  },
  {
    "id": "duty_until_death",
    "name": "Duty Until Death",
    "cost": 20,
    "prerequisites": {
      "attributes": {
        "willpower": 3
      },
      "keywords": [
        "IMPERIUM"
      ]
    },
    "effect": "Whenever you suffer more Wounds than your Max Wounds, you can use this Talent. You may take your next Turn normally; you begin Dying at the end of that Turn. You may choose to take your next Turn immediately after activating this Talent, potentially interrupting an enemy's Turn. If you roll a Complication on any Test, you take a Traumatic Wound.",
    "flavor": "Your ardent faith in the Emperor allows you to push beyond the limits of injury to act in His will, at a cost to your physical form.",
    "source": "core",
    "page": 133
  },
  {
    "id": "dynamic_offensive_aoa",
    "name": "Dynamic Offensive (Abundance of Apocrypha)",
    "cost": 20,
    "prerequisites": {
      "keywords": [
        "FIRE CASTE"
      ]
    },
    "effect": "When you are operating a BATTLESUIT with the JUMP JETS keyword, and you perform the Run or Sprint action, increase your suit’s flying speed by +Rank. In addition, you ignore the DN increase for firing an Assault weapon while sprinting.",
    "flavor": "Skilled battlesuit pilots can surge into battle with a blaze of fire.",
    "source": "apocrypha",
    "page": 236
  },
  {
    "id": "echo_of_sanguinius",
    "name": "Echo of Sanguinius",
    "cost": 10,
    "prerequisites": {
      "keywords": [
        "ADEPTUS ASTARTES",
        "BLOOD ANGELS"
      ]
    },
    "effect": "The violent and horrific death of the Blood Angels' Primarch at the hands of Warmaster Horus haunts all of Sanguinius' sons to this day. [...] You may declare you have had a vision after a Respite (Wrath & Glory Core Rulebook, page 196). If you do, ask the GM one question about events related to your mission. The GM must answer truthfully, although they do not need to tell the whole truth and may be cryptic in their response. However, after your vision, the closeness to Sanguinius' spirit haunts you. If you have the PRIMARIS Keyword, you are affected by the Blood Angels gene-seed flaw (Wrath & Glory Core Rulebook, pages 71-73) despite your refined origin. Otherwise, increase the DN of the Willpower Test to avoid becoming Frenzied to 5. This effect lasts until your next Respite.",
    "flavor": "[AI-Generated] The blood of the Great Angel flows through your veins, granting prophetic visions—at a terrible price.",
    "source": "voa",
    "page": 46
  },
  {
    "id": "eliminator",
    "name": "Eliminator",
    "cost": 20,
    "prerequisites": {
      "skills": {
        "stealth": 2
      }
    },
    "effect": "When you have a Stealth Score (p.181) and you attack an enemy that is unaware of you, you may add your Stealth Score as ED, in addition to the bonuses received from a Surprise Attack (p.182). Any decrease to your Stealth Score is resolved after the attack.",
    "flavor": "You strike from the shadows, using the element of surprise to take down your foes in one fell swoop.",
    "source": "core",
    "page": 133
  },
  {
    "id": "enviable_grace",
    "name": "Enviable Grace",
    "cost": 10,
    "prerequisites": {
      "attributes": {
        "agility": 3
      }
    },
    "effect": "Difficult terrain does not reduce your Speed. You may Fall Back as a Move instead of a Combat Action. You are immune to the Staggered Condition. You suffer no restrictions on replacement Movement options when you remove the Prone Condition as a Free Action. You gain +Double Rank bonus dice on Tests to remove the Restrained Condition. At the GM's discretion, you may be able to insert yourself into otherwise impassable spaces.",
    "flavor": "You are a dextrous contortionist, twirling around restrictions to navigate your environment with enviable grace.",
    "source": "redacted1",
    "page": 64
  },
  {
    "id": "ere_we_go_aoa",
    "name": "‘Ere We Go! (Abundance of Apocrypha)",
    "cost": 20,
    "prerequisites": {
      "species": [
        "ork"
      ]
    },
    "effect": "When you Charge, you increase your Speed by +Rank. In addition, you gain +1 ED on your attacks when you charge.",
    "flavor": "Little can compare to the momentum of a charging Ork.",
    "source": "apocrypha",
    "page": 230
  },
  {
    "id": "escape_artist",
    "name": "Escape Artist",
    "cost": 20,
    "prerequisites": {},
    "effect": "You gain +Double Rank bonus dice to all attempts to escape any form of bondage, be it mechanical bonds or an individual Grappling you (p.188).",
    "flavor": "Through bodily contortions, practice, or subdermally concealed equipment, you are adept at escaping any form of bondage.",
    "source": "core",
    "page": 133
  },
  {
    "id": "evade_aoa",
    "name": "Evade (Abundance of Apocrypha)",
    "cost": 30,
    "prerequisites": {
      "keywords": [
        "ASPECT WARRIOR"
      ],
      "other": "Swooping Hawk or Shining Spear or Crimson Hunter aspect, Agility 7+"
    },
    "effect": "Your airborne movement is difficult for the eye to follow or predict, making you and exceptionally difficult target. When you fly—yourself, or while operating a vehicle with the Flyer or Hover trait—add +2 to your Defence or that of your vehicle until the start of your next turn.",
    "flavor": "",
    "source": "apocrypha",
    "page": 248
  },
  {
    "id": "ever_vigilant",
    "name": "Ever Vigilant",
    "cost": 20,
    "prerequisites": {},
    "effect": "You gain +Double Rank to your Passive Awareness.",
    "flavor": "You never let down your guard.",
    "source": "core",
    "page": 133
  },
  {
    "id": "excruciating_sensation_aoa",
    "name": "Excruciating Sensation (Abundance of Apocrypha)",
    "cost": 20,
    "prerequisites": {
      "keywords": [
        "CHAOS",
        "SLAANESH"
      ]
    },
    "effect": "You gain +1d3 Corruption. When you attempt an Awareness or Insight Test, you may choose to suffer 1, 2, or 3 Shock in order to gain that many additional dice on the Test.",
    "flavor": "The Prince of Pleasure has granted you the greatest depths of awareness, to better appreciate the sensations of existence. Your mind burns with glorious agony as you open your senses to perceive more deeply than any mortal should.",
    "source": "apocrypha",
    "page": 236
  },
  {
    "id": "exhortation_of_rage",
    "name": "Exhortation of Rage",
    "cost": 15,
    "prerequisites": {
      "keywords": [
        "ADEPTUS ASTARTES"
      ],
      "talents": [
        "frenzy"
      ]
    },
    "effect": "Denouncing the unrighteous, you call upon your allies to face down the foes of Mankind with steel in their hearts and their hands. Affected targets within 20m add +1 ED to damage on successful melee attacks. By spending a further point of Faith, affected targets gain +1 die to melee attack Tests, and the effects of the Litany lasts for an additional round, even if the Chaplain moves out of range, or can no longer be heard.",
    "flavor": "[AI-Generated] Your battle-cry fills your brothers with righteous fury, driving them to strike harder and faster.",
    "isLitany": true,
    "source": "voa",
    "page": 58
  },
  {
    "id": "exhortation_of_rage_aoa",
    "name": "Exhortation of Rage (Abundance of Apocrypha)",
    "cost": 20,
    "prerequisites": {
      "keywords": [
        "ADEPTUS ASTARTES",
        "IMPERIUM",
        "PRIEST"
      ],
      "other": "Litanies of Devotion"
    },
    "effect": "If this Prayer is successful, then while it remains in effect, whenever you or any ally with the IMPERIUM keyword within 12m of you makes a successful melee attack and roll a 6 on the Wrath die, they may choose to make an additional melee attack instead of inflicting a critical hit. These additional attacks cannot themselves grant additional attacks.",
    "flavor": "You bellow your fury at the enemy, and your allies surge forwards to strike them down.",
    "source": "apocrypha",
    "page": 254
  },
  {
    "id": "expert_hunter_aoa",
    "name": "Expert Hunter (Abundance of Apocrypha)",
    "cost": 30,
    "prerequisites": {
      "keywords": [
        "ASPECT WARRIOR"
      ],
      "other": "Weapon Skill or Ballistic Skill rating 5+"
    },
    "effect": "Like the heroes of old, you are foe to the mightiest enemies on the battlefield. When you make a melee attack, or a ranged attack at close range, against a vehicle or a Monstrous Creature, add +3ED to the attack’s damage and re-roll any ED which result in failures.",
    "flavor": "",
    "source": "apocrypha",
    "page": 248
  },
  {
    "id": "exquisite_swiftness_aoa",
    "name": "Exquisite Swiftness (Abundance of Apocrypha)",
    "cost": 10,
    "prerequisites": {
      "keywords": [
        "CHAOS",
        "SLAANESH"
      ]
    },
    "effect": "You gain +1d3 Corruption. Before the first round of combat, you may move up to your speed. Further, you may always choose to act first in each round.",
    "flavor": "Your wits and reflexes are heightened to an exceptional degree, to allow you to better experience life’s joys and torments.",
    "source": "apocrypha",
    "page": 236
  },
  {
    "id": "fallen_angel_aoa",
    "name": "Fallen Angel (Abundance of Apocrypha)",
    "cost": 10,
    "prerequisites": {
      "keywords": [
        "HERETIC ASTARTES",
        "DARK ANGELS"
      ]
    },
    "effect": "Due to your ancient origins, you gain +Rank to Scholar tests regarding historical events. You gain +2 bonus dice on any melee attack made against characters with the DARK ANGELS keyword, and they gain +2 dice on melee attacks against you. You gain the FALLEN keyword.",
    "flavor": "You broke faith with The Lion of Caliban during the Imperium’s darkest hour. Or perhaps he broke faith with you.",
    "source": "apocrypha",
    "page": 236
  },
  {
    "id": "familiar_aoa",
    "name": "Familiar (Abundance of Apocrypha)",
    "cost": 5,
    "prerequisites": {},
    "effect": "Your companion is a single Troop level Threat of Tiny or Small size, as described in Chapter 14 of the Wrath & Glory Core Rulebook. You may use the stats presented in the core rulebook or another bestiary, or use the following rules: Companion Attributes are equal to 1 + Double Rank. Companion Skills are equal to 1 + Double Rank. A companion’s Attributes and Skills cannot be higher than your own. Your familiar will stick close to you—within 3m—under most circumstances and will try to avoid combat unless ordered otherwise. If your familiar is within 3m of you, its Defence is increased by +2. A collection of custom-made familiars can be found in Chapter IV: Equipment.",
    "flavor": "You are accompanied by a small companion creature which aids and assists you.",
    "source": "apocrypha",
    "page": 86
  },
  {
    "id": "fashionista",
    "name": "Fashionista",
    "cost": 10,
    "prerequisites": {
      "other": "Wealth 2+"
    },
    "effect": "When you requisition Clothing (Wrath & Glory, pages 236-237), you gain bonus dice on social Skill Tests equal to the Rarity of the Clothing, in situations where your appearance would make a positive impression. You only gain this benefit for the duration of a single mission — after that reappearing in the same outfit again provides no advantage, and you must requisition new Clothing to regain the bonus.",
    "flavor": "You remain on the cutting edge of Gothic fashion, delighting in any opportunity to make a memorable entrance.",
    "source": "redacted1",
    "page": 65
  },
  {
    "id": "fast_draw",
    "name": "Fast Draw",
    "cost": 10,
    "prerequisites": {},
    "effect": "You may draw a weapon as a Free Action or Reaction. In combat, any attacks you make against enemies who have not yet taken a Turn gain +Double Rank bonus dice on the attack Test.",
    "flavor": "You blindside your enemies by drawing and firing whilst they are still preparing for combat.",
    "source": "redacted1",
    "page": 65
  },
  {
    "id": "fast_shot_aoa",
    "name": "Fast Shot (Abundance of Apocrypha)",
    "cost": 50,
    "prerequisites": {
      "keywords": [
        "ASPECT WARRIOR"
      ],
      "other": "Ballistic Skill rating 7+"
    },
    "effect": "You are a master at making the most of your firepower, laying down lethally-accurate volleys of fire. When you make a ranged attack, you may count their weapon’s Salvo value as twice its normal value, as long as the weapon had a Salvo of at least 1. In addition, when making a ranged attack, you may spend 1 ammo to make a second attack with that weapon.",
    "flavor": "",
    "source": "apocrypha",
    "page": 248
  },
  {
    "id": "favoured_by_warp",
    "name": "Favoured By The Warp",
    "cost": 40,
    "prerequisites": {
      "keywords": [
        "PSYKER"
      ]
    },
    "effect": "You may use this Talent to reroll any Perils of the Warp (p.263) result. You must accept the new result.",
    "flavor": "The Warp is both dangerous and fickle, its horrors afflicting some more than others. Even those with great mental conditioning and a seeming control over psychic powers can find it turns against them.",
    "source": "core",
    "page": 133
  },
  {
    "id": "fear",
    "name": "Fear",
    "cost": 30,
    "prerequisites": {},
    "effect": "When you succeed on an Intimidation (Wil) Test, you can force the target to make a Fear Test with a DN equal to 1 + Double Rank.",
    "flavor": "Either by the ravages of war on your body, an aura of malice, or the weight of your words, you frighten those you meet.",
    "source": "core",
    "page": 129
  },
  {
    "id": "fear_made_manifest",
    "name": "Fear Made Manifest",
    "cost": 20,
    "prerequisites": {
      "keywords": [
        "ADEPTUS ASTARTES"
      ],
      "talents": [
        "fear"
      ]
    },
    "effect": "When unleashing your wrath in battle, the fury of an Astartes warrior is written across your features. You may make an Intimidation (Wil) Test as a Reflexive Action in combat upon encountering any new foes, including at the start of a battle. Apply the results of the Test to each enemy individually (so a Test that rolls four Icons could intimidate a Cultist requiring DN 3, but not their Traitor Astartes master with a DN of 7). You can only attempt to intimidate a given character in this manner once per encounter.",
    "flavor": "[AI-Generated] The sight of you in battle armor is enough to send lesser foes fleeing in terror.",
    "source": "voa",
    "page": 46
  },
  {
    "id": "fearless",
    "name": "Fearless",
    "cost": 30,
    "prerequisites": {
      "attributes": {
        "willpower": 4
      }
    },
    "effect": "You automatically pass any Fear Test. You are immune to Intimidation (Wil) Interaction Attacks.",
    "flavor": "Extensive mental conditioning or intensive training allows you to completely control your fear.",
    "source": "core",
    "page": 133
  },
  {
    "id": "feast_in_famine",
    "name": "A Feast in Famine",
    "cost": 10,
    "prerequisites": {},
    "effect": "When you prepare food for your allies during a Regroup, anyone who partakes in the meal besides yourself removes all Shock.",
    "flavor": "You are a talented and resourceful cook, able to make a satisfying repast from meagre ration packs, hunted local fauna, or scavenged scraps, raising the spirits of your comrades.",
    "source": "redacted1",
    "page": 61
  },
  {
    "id": "feculent_beseechment_aoa",
    "name": "Feculent Beseechment (Abundance of Apocrypha)",
    "cost": 20,
    "prerequisites": {
      "keywords": [
        "CHAOS",
        "PRIEST",
        "NURGLE"
      ],
      "other": "Prayers to the Dark Gods"
    },
    "effect": "If this Prayer is successful, then while the Prayer remains in effect, you add +Rank to your Toughness.",
    "flavor": "You beg the Grandfather of Pestilence to bless your form with wondrous disease, every syllable expelling a cloud of flies.",
    "source": "apocrypha",
    "page": 257
  },
  {
    "id": "feel_no_pain",
    "name": "Feel No Pain",
    "cost": 40,
    "prerequisites": {
      "attributes": {
        "toughness": 4
      }
    },
    "effect": "You do not suffer a penalty to DN for being Wounded. Your Wounds Trait is increased by +Rank.",
    "flavor": "Your pain tolerance is above and beyond that of most of your Species.",
    "source": "core",
    "page": 133
  },
  {
    "id": "feint_attack",
    "name": "Feint Attack",
    "cost": 10,
    "prerequisites": {
      "skills": {
        "weaponSkill": 2
      }
    },
    "effect": "You can use Weapon Skill to make Interaction Attacks against enemies you are Engaged with (Wrath & Glory, page 190).",
    "flavor": "You disorient enemies with distraction attacks, setting them up for follow-up hits.",
    "source": "redacted1",
    "page": 65
  },
  {
    "id": "fighting_fury_aoa",
    "name": "Fighting Fury (Abundance of Apocrypha)",
    "cost": 40,
    "prerequisites": {
      "keywords": [
        "ASPECT WARRIOR"
      ],
      "other": "Weapon Skill 7 rating+"
    },
    "effect": "You remain in perpetual motion in melee, never missing an opportunity to strike. When you make a melee attack, you may spend 2 Glory to make a second melee attack. In addition, when the Exarch makes a multi-attack with a melee attack, the penalty is reduced by Double Rank.",
    "flavor": "",
    "source": "apocrypha",
    "page": 249
  },
  {
    "id": "first_response",
    "name": "First Response",
    "cost": 10,
    "prerequisites": {
      "skills": {
        "medicae": 2
      }
    },
    "effect": "Once per combat, you can make a Medicae (Int) Test to remove Wounds, Shock or a Condition as a Simple Action instead of a Combat Action.",
    "flavor": "You have an unerring knack for being in the right place at the right time when someone needs patching up.",
    "source": "redacted1",
    "page": 65
  },
  {
    "id": "fix_bayonets_aoa",
    "name": "Fix Bayonets! (Abundance of Apocrypha)",
    "cost": 20,
    "prerequisites": {
      "keywords": [
        "ASTRA MILITARUM"
      ]
    },
    "effect": "You increase the base damage of a bayonet you wield by +Double Rank when you charge, or when you attack an enemy who charged you since your last turn.",
    "flavor": "Sharp steel, with some guts behind it, is a vital part of defending the Imperium.",
    "source": "apocrypha",
    "page": 86
  },
  {
    "id": "flagellant",
    "name": "Flagellant",
    "cost": 20,
    "prerequisites": {
      "keywords": [
        "IMPERIUM"
      ]
    },
    "effect": "At the start of each day, you must spend 20 minutes (Terran standard) in prayer, and inflict Wounds to yourself equal to your Tier through self-flagellation. You may not roll Determination against these Wounds or allow them to be healed by any method other than through a Respite. As long as you are wounded in this way, you gain +Rank bonus dice to your Determination and Conviction rolls and may choose to become Frenzied (p.199) as a Combat Action. If you also have the Frenzy Talent, you may become Frenzied as a Simple Action. If you fail to flagellate yourself, you are overcome with shame and take a +2 DN penalty to all Tests until you flagellate again.",
    "flavor": "You have dedicated your pain to the service of the Emperor.",
    "source": "core",
    "page": 134
  },
  {
    "id": "flickering_assault_aoa",
    "name": "Flickering Assault (Abundance of Apocrypha)",
    "cost": 30,
    "prerequisites": {
      "keywords": [
        "ASPECT WARRIOR"
      ],
      "other": "Warp Spider aspect"
    },
    "effect": "You slip between reality and the Warp seamlessly, stepping out to strike and then withdrawing to find a new target. When you, or any member of your squad, makes a multi-attack as part of a melee attack, you may count your Speed as double its normal value when determining if they can reach their targets, and do not provoke Reflexive Attacks for leaving engagements. Characters benefiting from this ability must be wearing Warp Spider Jump Generators.",
    "flavor": "",
    "source": "apocrypha",
    "page": 249
  },
  {
    "id": "focussed_fire_aoa",
    "name": "Focussed Fire (Abundance of Apocrypha)",
    "cost": 30,
    "prerequisites": {
      "keywords": [
        "ASPECT WARRIOR"
      ],
      "other": "Dark Reaper aspect"
    },
    "effect": "You direct your attention—and your firepower—at a single foe, seeking to eliminate them utterly, regardless of other factors or distractions. You may nominate a single enemy—not a mob, but any individual threat— within 36m as a priority target as a free action at the start of your turn. Until the start of your next turn, any ranged attacks from you or members of your squad at that priority target may re-roll any dice which roll 1 on their skill test and on their damage roll. Further, the enemy may not use any Ruin abilities or other special abilities which would redirect the attack to another target.",
    "flavor": "",
    "source": "apocrypha",
    "page": 249
  },
  {
    "id": "forbidden_knowledge",
    "name": "Forbidden Knowledge",
    "cost": 10,
    "prerequisites": {
      "keywords": [
        "IMPERIUM"
      ]
    },
    "effect": "Choose a proscribed subject you have unsanctioned knowledge of: for example, daemons, heretical beliefs, a specific alien species, even a secretive Faction you don't have the Keyword for (such as INQUISITION, ADEPTUS ASTRA TELEPATHICA or OFFICIO ASSASSINORUM). Alternatively, with your GM's consent, you can detail a little known and dangerous secret — the true allegiances of a powerful Patron, the fate of the Absolver Chapter Command, etc. You gain +Double Rank bonus dice on Tests that benefit from your forbidden knowledge. However, GMs may spend Complications rolled on these Tests to award themselves 2 Ruin instead of 1. Your forbidden knowledge may increase the DN on resistance Tests to learn more tantalising truths about the subject, such as social Skills used by individuals with the relevant Keyword, or Corruption Tests. Whilst your knowledge makes you a useful asset to some, it makes you a dangerous liability to others. Caveat emptor!",
    "flavor": "Through curiosity or ill-fortune, you have learned secrets your Imperium does not want you to know.",
    "requiresChoice": true,
    "choiceType": "freeform",
    "choiceLabel": "Forbidden Subject",
    "choiceDescription": "Choose a proscribed subject (daemons, heretical beliefs, a specific alien species, a secretive Faction, etc.)",
    "source": "redacted1",
    "page": 65
  },
  {
    "id": "force_of_will",
    "name": "Force Of Will",
    "cost": 10,
    "prerequisites": {
      "skills": {
        "psychicMastery": 2
      }
    },
    "effect": "You gain +Double Rank bonus dice on Willpower Tests to continue sustaining psychic powers when you suffer damage (Wrath & Glory, page 265).",
    "flavor": "To those who risk their souls tangling with daemons, traumas of the flesh are a distant concern.",
    "source": "redacted1",
    "page": 65
  },
  {
    "id": "frenzy",
    "name": "Frenzy",
    "cost": 20,
    "prerequisites": {},
    "effect": "You can use a Combat Action to become Frenzied (p.199).",
    "flavor": "",
    "source": "core",
    "page": 134
  },
  {
    "id": "furious_charge",
    "name": "Furious Charge",
    "cost": 20,
    "prerequisites": {
      "skills": {
        "athletics": 2,
        "weaponSkill": 2
      }
    },
    "effect": "You gain +Rank to any melee attack you make as part of a Charge (p.188).",
    "flavor": "You have practised closing distance to a foe with speed; swinging your weapon whilst running has become second nature.",
    "source": "core",
    "page": 134
  },
  {
    "id": "gallows_humour",
    "name": "Gallows Humour",
    "cost": 20,
    "prerequisites": {},
    "effect": "You can take a Simple Action to make a grim joke whenever you are Wounded or are suffering from a Condition, as long as you are still able to speak. Make a DN 2 Fellowship Attribute Test. If you succeed, you and any allies that can hear you recover Shock equal to your Rank plus the number of Icons rolled.",
    "flavor": "You find humour in the darkest of places, and can use it to bolster the resolve of your allies.",
    "source": "core",
    "page": 134
  },
  {
    "id": "gammalevel_psyker_aoa",
    "name": "Gamma-level Psyker (Abundance of Apocrypha)",
    "cost": 40,
    "prerequisites": {
      "tier": 3,
      "keywords": [
        "PSYKER"
      ],
      "species": [
        "human",
        "adeptus astartes",
        "primaris astartes"
      ]
    },
    "effect": "When you attempt to use a psychic power at the Unbound or Transcendent power level, for each Exalted Icon you roll, you may roll one additional die for the Psychic Mastery test. These additional dice may not themselves grant more dice. You gain 1d3 Corruption Points when you take this talent. You may not select the Alpha-level Psyker or Beta-level Psyker talents.",
    "flavor": "Your psychic powers are particularly potent, with an intensity that few can match.",
    "source": "apocrypha",
    "page": 232
  },
  {
    "id": "gene_wrought_might",
    "name": "Gene-Wrought Might",
    "cost": 20,
    "prerequisites": {
      "attributes": {
        "strength": 6
      },
      "keywords": [
        "ADEPTUS ASTARTES"
      ]
    },
    "effect": "Add an automatic Icon to Tests involving physical might (like Athletics to lift debris). Such Tests take half as long as usual.",
    "flavor": "[AI-Generated] Your gene-enhanced musculature grants you strength beyond even other Astartes.",
    "source": "voa",
    "page": 46
  },
  {
    "id": "gilead_combat_veteran",
    "name": "Gilead Combat Veteran",
    "cost": 20,
    "prerequisites": {
      "keywords": [
        "ADEPTUS ASTARTES"
      ],
      "other": "Must be of the Absolvers Chapter or have extensive Gilead experience"
    },
    "effect": "Once per encounter, when making a Narrative Declaration (Wrath & Glory Core Rulebook, p164), you do not need the GM's permission to possess routine clearance codes, briefing information, or facts about enemy disposition and numbers. This does not allow you to influence what is physically present in a scene, only to have the ability to access otherwise hidden information by virtue of your extensive experience.",
    "flavor": "You have fought across the length and breadth of the Gilead System, striking the fear of the Emperor into foes in every corner of the system.",
    "source": "voa",
    "page": 47
  },
  {
    "id": "graceful_avoidance_aoa",
    "name": "Graceful Avoidance (Abundance of Apocrypha)",
    "cost": 30,
    "prerequisites": {
      "keywords": [
        "ASPECT WARRIOR"
      ],
      "other": "Howling Banshee aspect"
    },
    "effect": "Your motions make it almost impossible to land a telling blow upon you. When you roll Determination against damage inflicted by a melee attack, you or a member of your squad may use Agility +Rank instead of Toughness to Soak, and may roll Determination against Mortal Wounds.",
    "flavor": "",
    "source": "apocrypha",
    "page": 249
  },
  {
    "id": "grim_visage_aoa",
    "name": "Grim Visage (Abundance of Apocrypha)",
    "cost": 25,
    "prerequisites": {
      "keywords": [
        "ASPECT WARRIOR"
      ],
      "other": "Willpower 6+"
    },
    "effect": "Your presence inspires feelings of foreboding and dread in their foes. Characters within 12 yards of you add +Rank to the DN of Resolve tests they are required to take. Your squad is immune to this effect.",
    "flavor": "",
    "source": "apocrypha",
    "page": 249
  },
  {
    "id": "guardian_aoa",
    "name": "Guardian (Abundance of Apocrypha)",
    "cost": 20,
    "prerequisites": {},
    "effect": "Whenever an ally within Rank metres of you is the target of an attack, you may spend 1 Glory as a Reflexive Action to interpose yourself and become the target of that attack instead. You cannot use this talent if you are Restrained or otherwise have impaired movement.",
    "flavor": "You are a shield for your allies.",
    "source": "apocrypha",
    "page": 83
  },
  {
    "id": "gunnery_crew_aoa",
    "name": "Gunnery Crew (Abundance of Apocrypha)",
    "cost": 10,
    "prerequisites": {
      "skills": {
        "ballisticSkill": 2
      }
    },
    "effect": "When you are CREW or PILOT in a vehicle, you may use the Open Fire action up to 1+Rank times as part of a Multi-Action, so long each Open Fire action fires a different one of the vehicle’s weapons.",
    "flavor": "You’re used to operating linked vehicle weapons in concert.",
    "source": "apocrypha",
    "page": 237
  },
  {
    "id": "hail_of_fire_aoa",
    "name": "Hail of Fire (Abundance of Apocrypha)",
    "cost": 20,
    "prerequisites": {
      "skills": {
        "ballisticSkill": 2
      }
    },
    "effect": "When you use a Salvo option when making a ranged attack, you add +Rank ED to the attack's damage.",
    "flavor": "On command, you can produce a veritable wall of firepower that few foes can withstand.",
    "source": "apocrypha",
    "page": 232
  },
  {
    "id": "hammer_of_wrath",
    "name": "Hammer of Wrath",
    "cost": 20,
    "prerequisites": {
      "skills": {
        "pilot": 4
      },
      "keywords": [
        "ADEPTUS ASTARTES"
      ]
    },
    "effect": "When equipped with a Jump Pack (Wrath & Glory Core Rulebook, page 237), you may spend one Wrath to make any attack you make as part of a flying Charge deal Mortal Wounds for damage.",
    "flavor": "The wargear of the Assault Companies is as familiar to you as your battle-brothers themselves, and you have mastered their use on the battlefield.",
    "source": "voa",
    "page": 47
  },
  {
    "id": "hand_of_the_emperor",
    "name": "Hand Of The Emperor",
    "cost": 20,
    "prerequisites": {
      "keywords": [
        "ADEPTA SORORITAS",
        "ADEPTUS MINISTORUM"
      ],
      "keywordsAny": true
    },
    "effect": "You gain +1 Faith. You may spend 1 Faith as a Reflexive Action to double the Speed of an IMPERIUM character for 1 round. This character must be in hearing range.",
    "flavor": "Those chosen as vessels for the Emperor are burdened with glorious purpose, invigorated to enact his will wherever it is needed.",
    "isFaithTalent": true,
    "source": "redacted2",
    "page": 69
  },
  {
    "id": "hardy",
    "name": "Hardy",
    "cost": 30,
    "prerequisites": {
      "attributes": {
        "toughness": 3
      }
    },
    "effect": "As a Combat Action, you can make a DN 3 Toughness Test. On a failure you recover 1 Shock. On a success you recover 1 + Double Rank Shock. Each Shifted Exalted Icon recovers an additional point of Shock. Once you use this Talent, you cannot use it again until you have completed a Regroup (p.196).",
    "flavor": "You are innately durable or have undergone harrowing endurance training.",
    "source": "core",
    "page": 134
  },
  {
    "id": "hatred",
    "name": "Hatred [Any]",
    "cost": 30,
    "prerequisites": {},
    "effect": "Select a Keyword to be the focus of your hatred. You gain +Double Rank bonus dice on melee attacks against targets that have the chosen Keyword. You suffer a +2 DN penalty whenever you interact socially with individuals of the chosen Keyword.",
    "flavor": "You have honed your hatred toward a specific foe into a weapon.",
    "requiresChoice": true,
    "choiceType": "keyword",
    "choiceLabel": "Hatred Target",
    "choiceDescription": "Choose a Keyword to be the focus of your hatred",
    "source": "core",
    "page": 134
  },
  {
    "id": "heroic_intervention_aoa",
    "name": "Heroic Intervention (Abundance of Apocrypha)",
    "cost": 20,
    "prerequisites": {},
    "effect": "When an enemy takes the Charge action and concludes their move within 6 metres of you, you may spend 1 Glory as a Reflexive Action to move up to your Speed towards that enemy to engage them and make a melee attack before the enemy makes their attack. You are considered to be charging for the purposes of your attack.",
    "flavor": "",
    "source": "apocrypha",
    "page": 237
  },
  {
    "id": "hive_explorer",
    "name": "Hive Explorer",
    "cost": 20,
    "prerequisites": {
      "keywords": [
        "IMPERIUM"
      ]
    },
    "effect": "You gain +Rank bonus dice to any Stealth (A) or Survival (Wil) Tests when moving through urban environments.",
    "flavor": "You are experienced at navigating the urban environments of the Imperium.",
    "source": "core",
    "page": 96
  },
  {
    "id": "honed_to_lethality",
    "name": "Honed to Lethality",
    "cost": 20,
    "prerequisites": {},
    "effect": "When using a weapon with the POWER FIELD Keyword, increase the AP by +Rank.",
    "flavor": "You have refined the edge of your weapon's power field into the perfect armour-shredding tool.",
    "source": "redacted1",
    "page": 65
  },
  {
    "id": "hunt_from_the_shadows_aoa",
    "name": "Hunt from the Shadows (Abundance of Apocrypha)",
    "cost": 10,
    "prerequisites": {
      "species": [
        "drukhari"
      ]
    },
    "effect": "When you are targeted by a ranged attack while you are benefiting from cover, you may spend 1 Glory as a Reflexive Action to add +Rank to your Resilience until the start of your next turn.",
    "flavor": "The denizens of Commorragh use the shadows to their advantage.",
    "source": "apocrypha",
    "page": 237
  },
  {
    "id": "identify_weakness",
    "name": "Identify Weakness",
    "cost": 20,
    "prerequisites": {
      "other": "Awareness, Insight, Investigation, or Scholar 3+"
    },
    "effect": "When you encounter an Elite or Adversary, you can make a Skill Test to size it up for weaknesses. You might Test any of the following Skills: Awareness (Int), when you spend a Combat Action watching the target in combat. Insight (Fel), when you have a conversation with the target. Investigation (Int), when you dedicate a full day or longer to learning more about the target. Scholar (Int), when you spend a Combat Action recalling relevant knowledge whilst watching the target in combat. Whichever Skill you use must be chosen when you first purchase this Talent, and must be rated 3 or higher. The DN of the Skill Test is usually 3, but may vary; for example, a target may make an Opposed Test against Insight (Fel) using their Deception (Fel) Skill. You can only track one enemy's weakness at a time. When you or an informed ally makes an attack against a target whose weakness you know, you inflict +Double Rank additional ED.",
    "flavor": "Knowledge is power, and you wield it as a weapon to most efficiently destroy your enemies.",
    "requiresChoice": true,
    "choiceType": "skill",
    "choiceOptions": [
      "Awareness",
      "Insight",
      "Investigation",
      "Scholar"
    ],
    "choiceLabel": "Skill",
    "choiceDescription": "Choose which skill you use for this talent (must be 3+)",
    "source": "redacted1",
    "page": 66
  },
  {
    "id": "illusory_supplication_aoa",
    "name": "Illusory Supplication (Abundance of Apocrypha)",
    "cost": 20,
    "prerequisites": {
      "keywords": [
        "CHAOS",
        "PRIEST"
      ],
      "other": "Prayers to the Dark Gods"
    },
    "effect": "If this Prayer is successful, then while the Prayer remains in effect, you and all allies with the CHAOS within 12m add +Rank to their Defence.",
    "flavor": "Chanting un-words that would drive most mortals mad, you bend and distort the fabric of reality, creating shadowy doppelgängers of nearby allies.",
    "source": "apocrypha",
    "page": 257
  },
  {
    "id": "immortal_endurance_aoa",
    "name": "Immortal Endurance (Abundance of Apocrypha)",
    "cost": 30,
    "prerequisites": {
      "keywords": [
        "ASPECT WARRIOR"
      ],
      "other": "Toughness 5+"
    },
    "effect": "You are supernaturally resilient and wear your armour like a second skin. Your Resilience and Determination are both increased by +2.",
    "flavor": "",
    "source": "apocrypha",
    "page": 249
  },
  {
    "id": "imposing_presence",
    "name": "Imposing Presence",
    "cost": 20,
    "prerequisites": {},
    "effect": "You can substitute your Willpower Attribute rating for your Strength Attribute rating on Intimidation (Wil) Tests. You also gain +Rank bonus dice to Intimidation (Wil) Tests if wearing armour with the HEAVY Keyword. These effects only apply when the target of your Intimidation can see you.",
    "flavor": "You leverage your sheer physical size and weight as an implicit threat if you don't get your way.",
    "source": "redacted1",
    "page": 66
  },
  {
    "id": "improvised_weaponry",
    "name": "Improvised Weaponry",
    "cost": 10,
    "prerequisites": {
      "other": "Survival 2+ or Tech 2+"
    },
    "effect": "You may make a Survival (Wil) or Tech (Int) Test to fashion a crude weapon, with a profile from the table on page 65. By default this takes 8 minutes. The DN is usually 3 for a melee weapon, or 5 for a simple firearm, but may increase depending on the availability of tools and materials. Shifts on this Test can be spent to: Half the crafting time (this option may be chosen more than once). Increase the weapon Damage by +Rank. Remove the Unwieldy Trait. Add one of the following Traits: Inflict (On Fire), Inflict (Poisoned 3), Inflict (Restrained), Parry, Pistol, Silent. This option may be chosen more than once, selecting a different Trait each time. Double all weapon Ranges (Simple Firearm only). Players should provide details about the weapon they craft, which may affect its Keywords and possibly the range of available Traits you can spend Shifts on.",
    "flavor": "You are never truly disarmed, as long as you have access to raw materials and crafting time.",
    "source": "redacted1",
    "page": 66
  },
  {
    "id": "in_his_name",
    "name": "In His Name",
    "cost": 20,
    "prerequisites": {
      "skills": {
        "scholar": 1
      },
      "keywords": [
        "ADEPTUS MINISTORUM",
        "ADEPTA SORORITAS"
      ],
      "keywordsAny": true
    },
    "effect": "You gain +1 Faith. Whenever you target a character with the IMPERIUM Keyword with a Persuasion or Leadership Test, you can spend 1 Faith to add +Double Rank bonus dice to your pool.",
    "flavor": "You have spent time studying the holy writings of the Cult Imperialis and can invoke hallowed passages to sway others.",
    "isFaithTalent": true,
    "source": "core",
    "page": 143
  },
  {
    "id": "indomitable_belief_aoa",
    "name": "Indomitable Belief (Abundance of Apocrypha)",
    "cost": 20,
    "prerequisites": {
      "other": "ADEPTA SORORITAS keyword, must not possess the CHAOS keyword"
    },
    "effect": "You, and all ADEPTA SORORITAS characters within 15m of you, add +Rank to Resilience. In addition, when you suffer damage in excess of your Maximum Wounds, you gain 1 Faith. If you die, all characters with the ADEPTUS MINISTORUM or ADEPTA SORORITAS keywords gain 2 Faith and recover +Double Rank Shock, as they are spurred on by your martyrdom.",
    "flavor": "Your faith is such that you will not yield before the Emperor’s enemies.",
    "source": "apocrypha",
    "page": 237
  },
  {
    "id": "inner_circle_aoa",
    "name": "Inner Circle (Abundance of Apocrypha)",
    "cost": 40,
    "prerequisites": {
      "keywords": [
        "DARK ANGELS"
      ]
    },
    "effect": "You automatically pass all Fear and Terror tests. You are also immune to Interaction attacks made using Intimidation. Further, you may re-roll up to Double Rank dice when you roll Determination. Finally, you gain the DEATHWING keyword.",
    "flavor": "You have been granted true knowledge of the Unforgiven’s quest for absolution, and you bear that burden with solemnity and furious purpose.",
    "source": "apocrypha",
    "page": 237
  },
  {
    "id": "inner_circle_secrets",
    "name": "Inner Circle Secrets",
    "cost": 20,
    "prerequisites": {
      "attributes": {
        "willpower": 5
      },
      "keywords": [
        "ADEPTUS ASTARTES",
        "DARK ANGELS"
      ],
      "other": "Must know the secret of the Fallen"
    },
    "effect": "As one entrusted with these secrets — perhaps by Interrogator-Chaplain Caphziel aboard the Varonius Flotilla — or who discovered the terrible truth in the field, you are prepared to face the worst forms of betrayal. Ever vigilant, you do not need to pay a point of Glory to be considered aware of an ambush (Wrath & Glory Core Rulebook, page 177), and reduce by 2 the DN of Cunning (Fel) and Scholar (Int) Tests to unearth or learn of betrayal and those who would engage in it.",
    "flavor": "The Dark Angels and their Successors sometimes cryptically refer to themselves as the 'Unforgiven,' and even the lay brethren of these Chapters do not fully understand why. It is a secret wreathed in myth and metaphor, obscured by Chapter mysteries to which only a few are privy. Those who learn the truth, or are sufficiently trusted by their superiors, are inducted into the Inner Circle and told the reality of the Legion's ancient split and fall from grace, giving them a unique perspective on fallibility and failure.",
    "source": "voa",
    "page": 47
  },
  {
    "id": "insensible_to_pain",
    "name": "Insensible to Pain",
    "cost": 10,
    "prerequisites": {
      "keywords": [
        "DRUKHARI"
      ]
    },
    "effect": "You may roll Determination against attacks that deal Mortal Wounds. You do not suffer DN penalties for being Wounded, unless you have suffered more than Double Rank Wounds. When you are Dying, you do not fall Prone, and suffer no limits on the Actions you can take, unless you suffer Traumatic Injuries equal to or greater than your Rank.",
    "flavor": "Due to the extensive biological modifications of the Haemonculi, you have transcended the limits of the flesh, and can ignore the debilitating effects of pain at will.",
    "source": "aeldari",
    "page": 61
  },
  {
    "id": "inspirational_aoa",
    "name": "Inspirational (Abundance of Apocrypha)",
    "cost": 10,
    "prerequisites": {
      "skills": {
        "leadership": 2
      }
    },
    "effect": "When an ally within 15+Rank metres who can see you fails a Resolve test, you may make a Leadership test as a Reflexive Action against the same DN as their Resolve test. If you succeed, then the ally is considered to have passed their Resolve test rather than failed it.",
    "flavor": "Your presence bolsters and reassures your allies.",
    "source": "apocrypha",
    "page": 238
  },
  {
    "id": "inspired_blessing",
    "name": "Inspired Blessing",
    "cost": 25,
    "prerequisites": {
      "keywords": [
        "ADEPTUS MINISTORUM"
      ]
    },
    "effect": "You gain +1 Faith. You may make an inspirational statement or prayer as a Combat Action. When you do so, spend 1 Faith to restore 1d3 + Double Rank Shock to you and all allies with the IMPERIUM keyword within 15 + Double Rank metres.",
    "flavor": "Your blessings invoke the majesty of the God-Emperor, uplifting your allies and reinforcing their determination.",
    "isFaithTalent": true,
    "source": "core",
    "page": 143
  },
  {
    "id": "intercept_aoa",
    "name": "Intercept (Abundance of Apocrypha)",
    "cost": 20,
    "prerequisites": {
      "keywords": [
        "ASPECT WARRIOR"
      ],
      "other": "Agility 7+, Swooping Hawk aspect"
    },
    "effect": "You are a peerless aerial combatant, effortlessly proficient at fighting opponents in the sky. When you, or a member of your squad, makes an attack against a flying enemy, they may re-roll any failures on their skill test.",
    "flavor": "",
    "source": "apocrypha",
    "page": 249
  },
  {
    "id": "investigative_omophagy",
    "name": "Investigative Omophagy",
    "cost": 10,
    "prerequisites": {
      "keywords": [
        "ADEPTUS ASTARTES"
      ]
    },
    "effect": "When you eat the flesh of a sentient creature, you may ask the GM one question. The GM will provide as honest an answer as the consumed creature's memories can provide, but be aware that this answer may be skewed by the target's personal perspective. In addition, you may choose a Skill. Until the next Regroup, when Testing that Skill, you use the Attribute+Skill dice pool of the creature you consumed instead of your own. Consuming the flesh of a Heretic requires a Corruption Test with a DN of at least 4 (higher at the GM's discretion). Extracting a creature's flesh requires the target to be incapacitated first, and using this Talent requires a Combat Action. Due to extreme psychological disorientation of blending another creature's memories with your own, you cannot re-use this Talent until after the next Regroup.",
    "flavor": "Through flesh-tasting rituals and psycho-conditioning, you have learned to reliably extract useful intelligence by absorbing the memories of what you consume.",
    "source": "redacted1",
    "page": 66
  },
  {
    "id": "jargon",
    "name": "Jargon [Skill]",
    "cost": 20,
    "prerequisites": {
      "other": "Rating 1+ in: Ballistic Skill, Medicae, Pilot, Scholar, Survival, Tech, or Weapon Skill"
    },
    "effect": "When you take this Talent, you must pick which of your Skills it applies to from the list in the Requirements section above. During any social encounter you can make a Skill Test using your Jargon Skill. The DN is determined by the GM based on how friendly the target is to you. If you fail, everyone around you ignores your incoherent babbling. If you succeed and the target is interested or trained in the Skill, they are likely to become more friendly to you (see p.168). If the target doesn't share your knowledge and slang, they stand stupefied whilst you babble — they are distracted, unable to get away from your conversation for up to 20 minutes (Terran standard).",
    "flavor": "You're knowledgeable enough on a particular subject to open your mouth and let the information flow out. The mystifying slang, precise vernacular, and strange idioms are enough to stupefy the unlearned and make fast friends of strangers who share your passion.",
    "requiresChoice": true,
    "choiceType": "skill",
    "choiceOptions": [
      "Ballistic Skill",
      "Medicae",
      "Pilot",
      "Scholar",
      "Survival",
      "Tech",
      "Weapon Skill"
    ],
    "choiceLabel": "Jargon Skill",
    "choiceDescription": "Choose which skill's jargon you are fluent in",
    "source": "core",
    "page": 135
  },
  {
    "id": "jink_aoa",
    "name": "Jink (Abundance of Apocrypha)",
    "cost": 30,
    "prerequisites": {
      "attributes": {
        "agility": 5
      },
      "keywords": [
        "DARK ANGELS"
      ]
    },
    "effect": "When you pilot an ASTARTES vehicle with the RAIDER or FLYER keywords, the vehicle’s Defence increases by +Rank, or by +Double Rank if you take the Evasive Manoeuvres action. In addition, you gain the RAVENWING keyword.",
    "flavor": "You are a paragon of high-speed mounted combat, and few foes can draw a bead upon you when you’re at full speed.",
    "source": "apocrypha",
    "page": 238
  },
  {
    "id": "journeyman_craftsworker",
    "name": "Journeyman Craftsworker",
    "cost": 10,
    "prerequisites": {},
    "effect": "Choose a type of trade appropriate for the 41st Millennium that does not involve the creation of Wargear — carpentry, cartography, jewellery, masonry, painting, sculpture etc. You excel at this craft. If an enthusiast of the craft witnesses your creations, you gain +Rank bonus dice to social Skills targeting them for the rest of the scene. If you ever undertake a Skill Test to determine the success of the crafting itself — rolling Stealth (A) to conceal a recording device in a necklace, for example — you gain +Double Rank bonus dice on the Test. If you have a chance to practise your trade during a Regroup, you reduce your Shock by your Rank.",
    "flavor": "You previously held a position as a practitioner of a particular primitive craft, or have picked up such a pursuit in your meagre downtime.",
    "requiresChoice": true,
    "choiceType": "freeform",
    "choiceLabel": "Craft Type",
    "choiceDescription": "Choose a type of trade (carpentry, cartography, jewellery, masonry, painting, sculpture, etc.)",
    "source": "redacted2",
    "page": 64
  },
  {
    "id": "lancer_aoa",
    "name": "Lancer (Abundance of Apocrypha)",
    "cost": 20,
    "prerequisites": {
      "keywords": [
        "ASPECT WARRIOR"
      ],
      "other": "Shining Spear aspect"
    },
    "effect": "You wield a lance as if it were an extension of your arm. When you score a critical hit with an attack with a Laser Lance, Star Lance, or similar weapon while charging, you may choose to make an additional attack with the weapon instead of inflicting a critical hit. This additional attack cannot produce further attacks.",
    "flavor": "",
    "source": "apocrypha",
    "page": 249
  },
  {
    "id": "latent_psyker_aoa",
    "name": "Latent Psyker (Abundance of Apocrypha)",
    "cost": 10,
    "prerequisites": {
      "other": "Human species, may not have PSYKER keyword"
    },
    "effect": "You gain the PSYKER keyword, and a single minor psychic power. You cannot purchase additional psychic powers. You may only attempt to use your power at the Unbound power level. Further, whenever you suffer a complication, the GM may spend 1 Ruin to have you roll on the Perils of the Warp table, as your powers run out of control.",
    "flavor": "You possess a minor psychic talent, that you’re barely aware of and have little hope of controlling.",
    "source": "apocrypha",
    "page": 238
  },
  {
    "id": "legacy_of_sorrow",
    "name": "Legacy of Sorrow",
    "cost": 20,
    "prerequisites": {
      "species": [
        "aeldari"
      ]
    },
    "effect": "You no longer suffer the penalty from the Intense Emotion Species ability (p.29). The group gains +1 Glory every time you recover from Dying.",
    "flavor": "The long and mournful history of your people weighs upon you, sharpening your focus and emboldening your will to live.",
    "source": "core",
    "page": 135
  },
  {
    "id": "legacy_of_the_primarch",
    "name": "Legacy of the Primarch",
    "cost": 20,
    "prerequisites": {
      "keywords": [
        "ADEPTUS ASTARTES"
      ]
    },
    "effect": "[Full text spans two columns on page 48 with chapter-by-chapter details. Key differences: Iron Hands reduce DN of Willpower Test by number of augmetics possessed (not 'Rank'). Salamanders can reduce DN of attack Tests with FIRE/MELTA weapons OR Determination Tests against FIRE/MELTA damage. Imperial Fists can reduce DN of Tests to attack buildings/fortifications/enemies in cover OR Tests related to architectural engineering.]",
    "flavor": "[AI-Generated] The genetic legacy of your Primarch manifests in moments of need, granting you his particular gifts.",
    "source": "voa",
    "page": 48
  },
  {
    "id": "let_the_galaxy_burn",
    "name": "Let The Galaxy Burn",
    "cost": 20,
    "prerequisites": {
      "keywords": [
        "CHAOS"
      ]
    },
    "effect": "You gain +1 Corruption. Whenever you incapacitate an Adversary or Elite opponent, the group gains +1 Glory, up to a maximum Glory of Double Rank per encounter.",
    "flavor": "You take pleasure in the destruction of any ordered institution. When you see your prey begin to falter, you revel in its collapse and become inspired to commit ever greater atrocities in the names of the Chaos Gods.",
    "source": "core",
    "page": 135
  },
  {
    "id": "lhamaean",
    "name": "Lhamaean",
    "cost": 20,
    "prerequisites": {
      "keywords": [
        "DRUKHARI"
      ]
    },
    "effect": "As a Simple Action, you may enhance the toxins of a weapon you handle that has the Inflict (Poisoned) Trait. The weapon gains +Double Rank ED until it is next reloaded.",
    "flavor": "You have trained with the sisterhood of Lhilitu, crafters of exceedingly virulent toxins that dramatically improve the lethality of any weapons they are applied to.",
    "source": "aeldari",
    "page": 61
  },
  {
    "id": "lie_low_aoa",
    "name": "Lie Low (Abundance of Apocrypha)",
    "cost": 10,
    "prerequisites": {
      "attributes": {
        "initiative": 3
      }
    },
    "effect": "When you are Prone, you add +Rank to your Defence against attacks from 6 or more metres away, and +Rank bonus dice on Stealth tests when you attempt to Hide.",
    "flavor": "You know how to avoid attention when trouble is near.",
    "source": "apocrypha",
    "page": 238
  },
  {
    "id": "lightning_assault_aoa",
    "name": "Lightning Assault (Abundance of Apocrypha)",
    "cost": 20,
    "prerequisites": {
      "keywords": [
        "WHITE SCARS"
      ]
    },
    "effect": "When you take the Run or Sprint action, you increase your Speed by +Rank. Any vehicle with the RAIDER or FLYER keywords you pilot gain the Turbo-Boost (X) trait, with a rating of 2+Rank. If the vehicle already has the Turbo-Boost trait, increase the trait’s rating by +Rank.",
    "flavor": "You are a master of the hunt, and your fury is inescapable.",
    "source": "apocrypha",
    "page": 238
  },
  {
    "id": "lightning_reflexes",
    "name": "Lightning Reflexes",
    "cost": 10,
    "prerequisites": {
      "attributes": {
        "agility": 4
      }
    },
    "effect": "Once per combat, your character can Seize The Initiative (Wrath & Glory Rulebook, page 177) without spending Glory. Additionally, once per combat, when the GM spends 1 Ruin to Seize The Initiative, you can spend 1 Glory to cancel the effect. The Ruin is still spent. You can only use this option if you have not yet taken your Turn, and must now take your Turn immediately.",
    "flavor": "You blindside enemies by leaping on opportunities the second they become available.",
    "source": "redacted2",
    "page": 64
  },
  {
    "id": "lightningfast_reactions_aoa",
    "name": "Lightning-Fast Reactions (Abundance of Apocrypha)",
    "cost": 20,
    "prerequisites": {
      "species": [
        "aeldari",
        "drukhari"
      ]
    },
    "effect": "When you are targeted by a ranged or melee attack, you may spend 1 Glory as a Reflexive Action to increase your Defence by +Double Rank until the start of your next turn.",
    "flavor": "The Aeldari process thought and emotion far faster than a human, and their physical reactions are so quick that they can slip past flickering blades and fusillades of gunfire with astonishing ease.",
    "source": "apocrypha",
    "page": 238
  },
  {
    "id": "lip_reader",
    "name": "Lip Reader",
    "cost": 20,
    "prerequisites": {},
    "effect": "The GM may call for an Awareness (Int) Test to read lips successfully depending on the environment, the speaker's Species, and the language spoken. The default DN is 3 and may be modified as the GM sees fit.",
    "flavor": "You have learnt how to read lips.",
    "source": "core",
    "page": 135
  },
  {
    "id": "litany_of_despair_aoa",
    "name": "Litany of Despair (Abundance of Apocrypha)",
    "cost": 20,
    "prerequisites": {
      "keywords": [
        "CHAOS",
        "PRIEST"
      ],
      "other": "Prayers to the Dark Gods"
    },
    "effect": "If this Prayer is successful, all creatures without the CHAOS keyword within 12m, add +Rank the DN of all Resolve tests while the Prayer remains in effect.",
    "flavor": "You call upon the Dark Gods to offer your foes all manner of whispered temptations, sapping their will to fight.",
    "source": "apocrypha",
    "page": 256
  },
  {
    "id": "litany_of_enduring_faith_aoa",
    "name": "Litany of Enduring Faith (Abundance of Apocrypha)",
    "cost": 20,
    "prerequisites": {
      "keywords": [
        "ADEPTUS MINISTORUM",
        "IMPERIUM",
        "PRIEST",
        "ADEPTA SORORITAS"
      ],
      "other": "Hymns of Battle"
    },
    "effect": "If this Prayer is successful, you and all IMPERIUM characters within 12m of you add +2 to Resilience.",
    "flavor": "Faith is the shield of the righteous, and the passionate chants of the devout can reinforce the benediction of the God-Emperor.",
    "source": "apocrypha",
    "page": 256
  },
  {
    "id": "litany_of_faith",
    "name": "Litany of Faith",
    "cost": 10,
    "prerequisites": {
      "keywords": [
        "ADEPTUS ASTARTES"
      ]
    },
    "effect": "Targets within 20m may roll Determination for Mortal Wounds as if typical damage. Spend extra Faith: may reroll a single Determination die against Mortal Wounds.",
    "flavor": "[AI-Generated] Your prayers bolster the faith of your brothers, allowing them to endure wounds that should be fatal.",
    "isLitany": true,
    "source": "voa",
    "page": 58
  },
  {
    "id": "litany_of_faith_aoa",
    "name": "Litany of Faith (Abundance of Apocrypha)",
    "cost": 20,
    "prerequisites": {
      "keywords": [
        "ADEPTUS ASTARTES",
        "IMPERIUM",
        "PRIEST"
      ],
      "other": "Litanies of Devotion"
    },
    "effect": "If this Prayer is successful, you and all allies with the IMPERIUM keyword within 12m of you may roll Determination against Mortal Wounds, and may add +Rank dice to Determination, while the Prayer remains in effect.",
    "flavor": "You exhort your charges to steel themselves against the most dangerous weapons the enemy can bring to bear.",
    "source": "apocrypha",
    "page": 254
  },
  {
    "id": "litany_of_hate",
    "name": "Litany of Hate",
    "cost": 0,
    "prerequisites": {
      "keywords": [
        "ADEPTUS ASTARTES"
      ],
      "other": "Gained when learning any Litany of Battle"
    },
    "effect": "Invoking the psycho-conditioning of your brethren, you prime the Space Marines around you to fight with zeal and fervour until their foes are nought but ruin and corpses. Spend 1 Faith to affect targets with the ADEPTUS ASTARTES Keyword within 20m range of the Chaplain. Those affected may re-roll (Chaplain's Rank) dice with a result of 1, 2, or 3 whenever making a melee attack. By spending a further point of Faith, to further enhance the effect, affected targets gain may re-roll an additional die on melee attacks, and the effect lasts for an additional round so long as the Chaplain remains in sight and can be heard.",
    "flavor": "[AI-Generated] Your voice rings with righteous fury, driving your brothers to strike again and again.",
    "isLitany": true,
    "source": "voa",
    "page": 57
  },
  {
    "id": "litany_of_hate_aoa",
    "name": "Litany of Hate (Abundance of Apocrypha)",
    "cost": 20,
    "prerequisites": {
      "keywords": [
        "ADEPTUS ASTARTES",
        "IMPERIUM",
        "PRIEST"
      ],
      "other": "Litanies of Devotion"
    },
    "effect": "If this Prayer is successful, you and all allies with the IMPERIUM keyword within 12m of you may re-roll up to Double Rank dice on melee attacks while the Prayer remains in effect.",
    "flavor": "You call upon your allies to summon their hatred of the foes before them.",
    "source": "apocrypha",
    "page": 254
  },
  {
    "id": "litany_of_hatred_faith",
    "name": "Litany Of Hatred",
    "cost": 20,
    "prerequisites": {
      "keywords": [
        "ADEPTUS MINISTORUM",
        "ADEPTA SORORITAS"
      ],
      "keywordsAny": true,
      "talents": [
        "hatred"
      ]
    },
    "effect": "You gain +1 Faith. You may spend 1 Faith and a Simple Action to recite a Litany of Hate. The effects of your Hatred Talent now apply to any of your allies with the IMPERIUM keyword within Rank x 10 metres.",
    "flavor": "Hatred is the Emperor's greatest gift to humanity.",
    "isFaithTalent": true,
    "source": "core",
    "page": 143
  },
  {
    "id": "lobotomised_efficiency",
    "name": "Lobotomised Efficiency",
    "cost": 20,
    "prerequisites": {
      "species": [
        "human"
      ]
    },
    "effect": "You gain +Double Rank to your Conviction and Resolve. You no longer add your Tier to your Max Shock.",
    "flavor": "Through otherworldly discipline or surgical treatments you have been rendered immune to temptations of the flesh.",
    "source": "core",
    "page": 136
  },
  {
    "id": "longranged_fire_aoa",
    "name": "Long-Ranged Fire (Abundance of Apocrypha)",
    "cost": 30,
    "prerequisites": {
      "keywords": [
        "ASPECT WARRIOR"
      ],
      "other": "Dark Reaper aspect, Ballistic Skill 7+"
    },
    "effect": "Your eyes can pick out a target at a considerable distance, and you are an excellent judge of just how to fire to catch such far-flung foes. You, and any members of your squad, may ignore the DN penalty for firing at long range. In addition, you and your squad may fire ranged weapons at extreme range, which is any distance up to twice the Medium range of the weapon (so a weapon with a Medium range of 48 has an Extreme range of 96). Ranged attacks made at targets at extreme range suffer a +2 DN penalty.",
    "flavor": "",
    "source": "apocrypha",
    "page": 250
  },
  {
    "id": "longshot",
    "name": "Longshot",
    "cost": 10,
    "prerequisites": {
      "skills": {
        "ballisticSkill": 2
      }
    },
    "effect": "If you spend a Full Round Action setting up a static firing position, the Long Range of your ranged weapons are tripled for as long as you remain in that spot. Weapons with the Sniper (X) Trait instead increase their Long Range to one kilometre.",
    "flavor": "Whilst most battles of the 41st Millennium are fought up close, you prefer to wage war from the other end of a rifle scope, as far from the enemy as possible.",
    "source": "redacted2",
    "page": 65
  },
  {
    "id": "loremaster",
    "name": "Loremaster [Keyword]",
    "cost": 30,
    "prerequisites": {
      "skills": {
        "scholar": 3
      }
    },
    "effect": "When you take this Talent, choose a Keyword. This could be a bureau of the Imperium, a xenos species, or something esoteric (and forbidden) like daemonology. All Keyword selections are subject to GM approval. If you select another Species as the keyword, you can speak their native language as well as your own. Educational insight can have broad applications. Studying a culture's history invariably reveals information about their traditions, military prowess, and technological innovations. Whenever you make a Skill Test related to the chosen Keyword, you gain +Double Rank bonus dice. This includes Scholar Tests, but can also be relevant to any Test that involves interacting with that Keyword, including Interaction Attacks (p.190). The GM is the arbiter of what is sufficiently relevant to your selected Keyword to receive this bonus.",
    "flavor": "You are highly educated in a specific field.",
    "requiresChoice": true,
    "choiceType": "keyword",
    "choiceLabel": "Lore Subject",
    "choiceDescription": "Choose a Keyword to be highly educated in (a faction, species, or esoteric subject)",
    "source": "core",
    "page": 136
  },
  {
    "id": "luck_has_need_keeps_toil_earns_aoa",
    "name": "Luck Has. Need Keeps. Toil Earns. (Abundance of Apocrypha)",
    "cost": 20,
    "prerequisites": {
      "attributes": {
        "willpower": 4
      },
      "keywords": [
        "LEAGUES OF VOTANN"
      ]
    },
    "effect": "At the start of any of your turns, you may spend 1 Wrath point to enter a defiant stance. You may not move during this turn, but you increase your Resolve, Conviction, and Determination by +Rank. Until the start of your next turn.",
    "flavor": "You believe that rightful ownership lies with whomever strives hard enough to possess the prize.",
    "source": "apocrypha",
    "page": 239
  },
  {
    "id": "luck_of_the_laughing_god",
    "name": "Luck of the Laughing God",
    "cost": 10,
    "prerequisites": {},
    "effect": "Once per Test, you may reroll a single Wrath Die. You may not reroll the die more than once (even if another effect, such as spending a Wrath Point, would make you eligible to do so), and cannot reroll a Complication.",
    "flavor": "As a favoured child of Cegorach, you often enjoy his characteristic good fortune… when not chosen to be the butt of His joke.",
    "source": "aeldari",
    "page": 61
  },
  {
    "id": "luminen_blast_aoa",
    "name": "Luminen Blast (Abundance of Apocrypha)",
    "cost": 20,
    "prerequisites": {
      "keywords": [
        "ADEPTUS MECHANICUS",
        "CULT MECHANICUS"
      ],
      "other": "ADEPTUS MECHANICUS keyword, CULT MECHANICUS keyword, Luminen Capacitor augmetic"
    },
    "effect": "You may make a ranged attack using this talent. The attack has a range of 10m, and inflicts damage equal to twice your Willpower, plus Rank ED, with the Agonizing and Spread traits, and a Salvo rating of –. Instead of reloads, this attack uses charges from your Luminen Capacitor.",
    "flavor": "By reciting the proper litanies, you can channel the energy of your Luminen Capacitor through your electoos and other implants and direct it at your enemies.",
    "source": "apocrypha",
    "page": 238
  },
  {
    "id": "luminen_defiler_aoa",
    "name": "Luminen Defiler (Abundance of Apocrypha)",
    "cost": 20,
    "prerequisites": {
      "keywords": [
        "DARK MECHANICUM"
      ],
      "other": " DARK MECHANICUM keyword, Luminen Capacitor augmetic"
    },
    "effect": "You gain +1 Corruption. When you use a charge from your Luminen Capacitor, you may suffer a Mortal Wound to corrupt the energy you unleash. If you are using this to power a machine, then the machine is also tainted and corrupted, and the GM will work with you to determine the effect. If you are using that corrupted power to make an attack (using the Luminen Blast or Luminen Shock talents, or any weapons which use your Luminen Capacitor), then the attack gains the Rad (2) trait.",
    "flavor": "You have found ways to alter and twist the energies of your Luminen Capacitor, imbuing it with the hellish light of Chaos and your own twisted spirit.",
    "source": "apocrypha",
    "page": 239
  },
  {
    "id": "luminen_shock_aoa",
    "name": "Luminen Shock (Abundance of Apocrypha)",
    "cost": 20,
    "prerequisites": {
      "keywords": [
        "ADEPTUS MECHANICUS",
        "CULT MECHANICUS"
      ],
      "other": "ADEPTUS MECHANICUS keyword, CULT MECHANICUS keyword, Luminen Capacitor augmetic"
    },
    "effect": "When you make an unarmed attack, you may spend 1 charge from your Luminen Capacitor to increase the damage by your Willpower, and to gain +Rank ED. This attack gains the Agonizing trait.",
    "flavor": "You may channel the energy of your Luminen Capacitor into your fists.",
    "source": "apocrypha",
    "page": 239
  },
  {
    "id": "machine_empathy_aoa",
    "name": "Machine Empathy (Abundance of Apocrypha)",
    "cost": 20,
    "prerequisites": {
      "keywords": [
        "IRON HANDS"
      ]
    },
    "effect": "You gain a bonus to Tech tests, and to Piloting tests for vehicles with the ADEPTUS ASTARTES keyword, equal the number of augmetics you have.",
    "flavor": "You spurn the weakness of flesh and embrace the purity of steel, forging a unique bond with the spirits of the machines you work with.",
    "source": "apocrypha",
    "page": 239
  },
  {
    "id": "maglev_transcendence_aoa",
    "name": "Maglev Transcendence (Abundance of Apocrypha)",
    "cost": 20,
    "prerequisites": {
      "keywords": [
        "ADEPTUS MECHANICUS",
        "CULT MECHANICUS"
      ],
      "other": "ADEPTUS MECHANICUS keyword, CULT MECHANICUS keyword, Maglev Coils augmetic"
    },
    "effect": "You may now run and sprint while using your Maglev Coils to fly, and your flying speed is increased to twice your Willpower.",
    "flavor": "You have proven your devotion to the Machine God by expanding the network of gravitic and magnetic coils throughout your flesh, allowing you to defy gravity more easily.",
    "source": "apocrypha",
    "page": 239
  },
  {
    "id": "mantra_of_strength_aoa",
    "name": "Mantra of Strength (Abundance of Apocrypha)",
    "cost": 20,
    "prerequisites": {
      "keywords": [
        "ADEPTUS ASTARTES",
        "IMPERIUM",
        "PRIEST"
      ],
      "other": "Litanies of Devotion"
    },
    "effect": "If this Prayer is successful, then while the Prayer remains in effect, you add +Rank to your Strength, and +Rank ED to any melee attacks you make.",
    "flavor": "You focus your mind on the purity of your faith, and your humanity, and your connection to saints, heroes, and the Emperor Himself.",
    "source": "apocrypha",
    "page": 255
  },
  {
    "id": "manual_labourer",
    "name": "Manual Labourer",
    "cost": 10,
    "prerequisites": {},
    "effect": "Choose a type of occupational labour appropriate for the 41st Millennium — construction, forge labour, mining, agri-farming, etc. You are an expert in this work. You gain +Rank bonus dice to all social Skill Tests targeting individuals from the same background. If you ever undertake a skill Test to determine the success of these labours — rolling Athletics (S) to dig a trench that provides full cover in combat, for example — you gain +Double Rank bonus dice on the Test.",
    "flavor": "Your background is replete with long hours of exhausting toil, and the lessons learned from those work-gangs are not easily forgotten.",
    "requiresChoice": true,
    "choiceType": "freeform",
    "choiceLabel": "Labour Type",
    "choiceDescription": "Choose a type of occupational labour (construction, forge labour, mining, agri-farming, etc.)",
    "source": "redacted2",
    "page": 65
  },
  {
    "id": "mark_of_chaos",
    "name": "Mark Of Chaos",
    "cost": 30,
    "prerequisites": {
      "keywords": [
        "[MARK OF CHAOS]"
      ]
    },
    "effect": "You gain +1 Corruption. Select one of the five options below and apply the bonus to your character sheet. Taking this Talent replaces the [MARK OF CHAOS] Keyword with the name of your chosen God. If you choose Undedicated, you do not replace the [MARK OF CHAOS] Keyword. Nurgle: Your Toughness increases by +1. Khorne: You gain +2 bonus dice when making attacks using the All-Out Attack option. You can't take this option if you have the PSYKER keyword. Slaanesh: You gain +2 bonus dice on Awareness and Persuasion Tests. Tzeentch: You gain the PSYKER keyword. If you already possess the PSYKER keyword, you gain one minor psychic power of your choice. Work with the GM to determine which powers are appropriate for your character. Undedicated: Choose one of the following Skills: Awareness, Cunning, Deception, Insight, Persuasion, Psychic Mastery, Stealth, or Weapon Skill. You gain +Rank bonus dice when using that Skill.",
    "flavor": "You have been granted the favour of the Chaos Gods. This may be from dedicating yourself to one of the named gods or to an act that venerates the entire pantheon. Occasionally, one of the Chaos Gods may grant favour out of amusement or some more inscrutable reason, rather than as a reward.",
    "requiresChoice": true,
    "choiceType": "chaos_god",
    "choiceOptions": [
      "Nurgle",
      "Khorne",
      "Slaanesh",
      "Tzeentch",
      "Undedicated"
    ],
    "choiceLabel": "Chaos God",
    "choiceDescription": "Choose which Chaos God to dedicate yourself to",
    "source": "core",
    "page": 136
  },
  {
    "id": "martial_adept_aoa",
    "name": "Martial Adept (Abundance of Apocrypha)",
    "cost": 30,
    "prerequisites": {
      "keywords": [
        "ASPECT WARRIOR"
      ],
      "other": "Dire Avenger aspect, Weapon Skill 6+, Ballistic Skill 6+"
    },
    "effect": "You are a well-rounded combatant, a master of warfare in hand-to-hand and at range. Whenever you make an attack, add one exalted icon to the attack, in addition to any that you roll.",
    "flavor": "",
    "source": "apocrypha",
    "page": 250
  },
  {
    "id": "martyrs_rites",
    "name": "Martyr's Rites",
    "cost": 20,
    "prerequisites": {
      "attributes": {
        "willpower": 3
      },
      "keywords": [
        "ADEPTA SORORITAS",
        "ADEPTUS MINISTORUM"
      ],
      "keywordsAny": true
    },
    "effect": "You gain +1 Faith. As a Simple Action, you may spend 1 Faith to recite last rites. Select one IMPERIUM character within hearing range. The target removes the Prone Condition if they have it. For the next 24 hours, the target doesn't suffer the Prone Condition when they are Dying, aren't restricted on Actions they can perform while Dying, or subject to the Exhausted Condition. The effect of those Conditions on Shock, Wounds, and Traumatic Injuries still apply as normal.",
    "flavor": "To one who has already resigned themselves to death, the battlefield holds no fear.",
    "isFaithTalent": true,
    "source": "redacted2",
    "page": 69
  },
  {
    "id": "martyrs_tears",
    "name": "Martyr's Tears",
    "cost": 20,
    "prerequisites": {
      "attributes": {
        "willpower": 3
      },
      "keywords": [
        "ADEPTUS MINISTORUM",
        "ADEPTA SORORITAS"
      ],
      "keywordsAny": true
    },
    "effect": "You gain +1 Faith. As a Simple Action you can select a human target to heal. You must spend 1 Faith and take a number of Wounds up to a maximum equal to your Tier. The target recovers double the number of Wounds you sacrificed.",
    "flavor": "You are destined for martyrdom, prepared and willing to sacrifice yourself entirely to serve the Emperor's grand vision.",
    "isFaithTalent": true,
    "source": "core",
    "page": 143
  },
  {
    "id": "master_artisan_aoa",
    "name": "Master Artisan (Abundance of Apocrypha)",
    "cost": 15,
    "prerequisites": {
      "keywords": [
        "SALAMANDERS"
      ]
    },
    "effect": "Whenever you make an attack with one of your own weapons (i.e., any weapon with which you began the current adventure), you may re-roll up to Rank dice on the attack.",
    "flavor": "The Salamanders are craftsmen of renown, and their weapons are crafted and maintained to an exceptional standard.",
    "source": "apocrypha",
    "page": 239
  },
  {
    "id": "mastered_paths",
    "name": "Mastered Paths",
    "cost": 20,
    "prerequisites": {
      "species": [
        "aeldari"
      ],
      "keywords": [
        "ASURYANI"
      ]
    },
    "effect": "Select one of your Aeldari Paths. You gain an additional +Rank bonus to the bonus you receive from that Aeldari Path.",
    "flavor": "As a Craftworlder, you have travelled and mastered many paths over your elongated lifespan. You have likely forgotten more than most humans will ever learn but still retain mastery of your former focus.",
    "requiresChoice": true,
    "choiceType": "freeform",
    "choiceLabel": "Aeldari Path",
    "choiceDescription": "Choose one of your Aeldari Paths to master",
    "source": "core",
    "page": 136
  },
  {
    "id": "matchless_agility",
    "name": "Matchless Agility",
    "cost": 20,
    "prerequisites": {
      "attributes": {
        "agility": 4
      },
      "keywords": [
        "AELDARI"
      ]
    },
    "effect": "As a Reflexive Action, when you are targeted by a ranged attack from an attacker you're aware of, you may spend 1 Glory before the Ballistic Skill Test is attempted. You gain +Rank Defence until the attack is resolved. You may use this Talent once per Round against a single attack.",
    "flavor": "The Aeldari are renowned for their impossible grace, evading enemy fire at speeds unattainable by mere Mon-Keigh.",
    "source": "aeldari",
    "page": 61
  },
  {
    "id": "mendacious",
    "name": "Mendacious",
    "cost": 10,
    "prerequisites": {
      "skills": {
        "deception": 2
      }
    },
    "effect": "When you make a successful Deception Interaction Attack to inflict the Vulnerable Condition (Wrath & Glory Rulebook, page 190), your target reduces their Defence by 2 instead of 1. Shifts can be spent to further reduce the Defence of your target by 2, instead of 1.",
    "flavor": "By confusing your enemy you can set them up for a devastating attack when they least expect it.",
    "source": "redacted2",
    "page": 65
  },
  {
    "id": "mighty_leap_aoa",
    "name": "Mighty Leap (Abundance of Apocrypha)",
    "cost": 10,
    "prerequisites": {
      "attributes": {
        "strength": 2,
        "agility": 2
      }
    },
    "effect": "When you make a Long Jump or High Jump, add +Rank to your Strength to determine how far or how high you can jump.",
    "flavor": "You’re capable of leaping considerable distances.",
    "source": "apocrypha",
    "page": 239
  },
  {
    "id": "mighty_strike_aoa",
    "name": "Mighty Strike (Abundance of Apocrypha)",
    "cost": 25,
    "prerequisites": {
      "keywords": [
        "ASPECT WARRIOR"
      ],
      "other": "Strength 5+"
    },
    "effect": "You can channel all your fury and all your concentration into well-placed blows which splinter armour and shatter bone. When making a melee attack, you may make a Mighty Strike, choosing to suffer Shock to increase the damage; each Shock you suffer adds +1ED to the attack’s damage; you may not suffer more Shock from one attack than your Tier. A Mighty Strike may not be combined with a multi-attack.",
    "flavor": "",
    "source": "apocrypha",
    "page": 250
  },
  {
    "id": "mimic_voice",
    "name": "Mimic Voice",
    "cost": 20,
    "prerequisites": {
      "skills": {
        "deception": 3
      }
    },
    "effect": "Make an Awareness Test when you listen to an individual speak for at least 1 hour to study their voice. The DN is set by the GM based on the difference between your target's voice and your own, and your current auditory conditions. If you succeed, you gain +Double Rank bonus dice whenever you make a Deception Test to mimic this voice. You can memorise a number of voices equal to your Intellect.",
    "flavor": "You can mimic individuals' voice patterns with uncanny accuracy. You may have learned this Talent through your environment or difficult training, or gained this ability from implanted vox synthesisers.",
    "source": "core",
    "page": 137
  },
  {
    "id": "mob_rule",
    "name": "Mob Rule",
    "cost": 20,
    "prerequisites": {
      "species": [
        "ork"
      ]
    },
    "effect": "When you command two or more Orks, you and all allied Orks within 15 + Double Rank metres may add +Double Rank bonus dice to Resolve Tests.",
    "flavor": "You know how to manipulate the brutish confidence of a mob of Orks.",
    "source": "core",
    "page": 137
  },
  {
    "id": "more_dakka",
    "name": "More Dakka!",
    "cost": 35,
    "prerequisites": {
      "species": [
        "ork"
      ]
    },
    "effect": "The Salvo value of any weapon you wield is increased by +Rank. You may want to employ an Ammo Runt (p.241) to carry extra ammunition.",
    "flavor": "You love the smell and sound of Dakka, and have a knack for expending exorbitant quantities of ammunition; this is somehow an effective tactic for you.",
    "source": "core",
    "page": 137
  },
  {
    "id": "mortal_understanding",
    "name": "Mortal Understanding",
    "cost": 10,
    "prerequisites": {
      "attributes": {
        "fellowship": 2
      },
      "keywords": [
        "ADEPTUS ASTARTES",
        "SALAMANDERS"
      ]
    },
    "effect": "You reduce the DN of Fellowship-based Tests by 2 when interacting with Humans. In addition, once you have made a successful Fellowship-based Test to influence or calm someone frightened by your Infernal Inheritance Chapter Trait (Wrath & Glory Core Rulebook, page 74), you may waive future penalties when interacting with that individual.",
    "flavor": "You have lived among the unaugmented Humans of Nocturne, perhaps alongside your distant kin. As such, you find it easier to relate to the ordinary citizens of the Imperium than most Astartes.",
    "source": "voa",
    "page": 49
  },
  {
    "id": "munitionsmith_aoa",
    "name": "Munitionsmith (Abundance of Apocrypha)",
    "cost": 30,
    "prerequisites": {
      "keywords": [
        "ADEPTUS MECHANICUS"
      ]
    },
    "effect": "When you use a weapon with the MELTA, PLASMA, ARC, POWER, or ADEPTUS MECHANICUS keywords, you may add +Rank ED to the weapon’s damage.",
    "flavor": "You are an expert in the science of weaponry, and the most advanced munitions are all the deadlier in your worthy hands.",
    "source": "apocrypha",
    "page": 240
  },
  {
    "id": "mutating_invocation_aoa",
    "name": "Mutating Invocation (Abundance of Apocrypha)",
    "cost": 20,
    "prerequisites": {
      "keywords": [
        "CHAOS",
        "PRIEST",
        "TZEENTCH"
      ],
      "other": "Prayers to the Dark Gods"
    },
    "effect": "If this Prayer is successful, then you instantly recover Rank Wounds. This Prayer has no ongoing duration—once the effect has occurred, the Prayer is done.",
    "flavor": "Speaking riddles, you bargain with the Master of Fate to make your flesh flow like liquid, unmaking the harm dealt to you.",
    "source": "apocrypha",
    "page": 257
  },
  {
    "id": "nerveshredding_shriek_aoa",
    "name": "Nerve-Shredding Shriek (Abundance of Apocrypha)",
    "cost": 30,
    "prerequisites": {
      "keywords": [
        "ASPECT WARRIOR"
      ],
      "other": "Howling Banshee aspect"
    },
    "effect": "You lead your students in a war-cry that not only overwhelms foes’ minds, but also inflicts lasting neurological and psychological harm. When you, or a member of your squad, charges while using a Banshee Mask, roll 1d6 for each enemy affected by the mask; on an Icon, that foe suffers 1d3 Mortal Wounds in addition to the mask’s other effects.",
    "flavor": "",
    "source": "apocrypha",
    "page": 250
  },
  {
    "id": "no_escape",
    "name": "No Escape",
    "cost": 10,
    "prerequisites": {
      "attributes": {
        "initiative": 5
      }
    },
    "effect": "Enemies Engaged with you cannot use the Fall Back Combat Action. Additionally, you gain +Rank bonus dice on Reflexive Attack Tests (Wrath & Glory Rulebook, page 184).",
    "flavor": "You are extremely skilled at blocking enemies from getting past or away from you.",
    "source": "redacted2",
    "page": 65
  },
  {
    "id": "noble_peer",
    "name": "Noble Peer",
    "cost": 30,
    "prerequisites": {
      "skills": {
        "persuasion": 3
      }
    },
    "effect": "You may have additional authority over other members of your society, as well as responsibility for your social lessers. Whenever you are in a social situation where status plays a factor, gain +Double Rank bonus dice to Influence Tests and any Skill Tests involving social interaction.",
    "flavor": "You are a member of a renowned noble class.",
    "source": "core",
    "page": 137
  },
  {
    "id": "not_another_step_back_aoa",
    "name": "Not Another Step Back (Abundance of Apocrypha)",
    "cost": 15,
    "prerequisites": {
      "keywords": [
        "LEAGUES OF VOTANN"
      ]
    },
    "effect": "When you fail a Resolve test, you may suffer 1d3 Shock to count as having succeeded.",
    "flavor": "You will not yield while there is still profit to be had, or grudges to settle.",
    "source": "apocrypha",
    "page": 240
  },
  {
    "id": "old_reliable",
    "name": "Old Reliable",
    "cost": 10,
    "prerequisites": {},
    "effect": "When you use a weapon with the LAS Keyword and the Reliable Trait, rolling a 1 on the Wrath Die does not trigger a Complication. This effect does not apply when you are Dying. Additionally, whenever you use an effect that would expend Las Ammo, roll a Wrath Die. If you roll an Exalted Icon, you do not expend that Las Ammo.",
    "flavor": "From the standard-issue rifle of the Imperial infantryman, to the Godhammer lascannons of Astartes Land Raiders, the enduring ubiquity of laser weaponry is a testament to their rugged dependability. You know just how to kindle the Machine Spirits of las-weaponry to the pinnacle of reliable, efficient destruction.",
    "source": "redacted2",
    "page": 65
  },
  {
    "id": "omen_of_potency_aoa",
    "name": "Omen of Potency (Abundance of Apocrypha)",
    "cost": 20,
    "prerequisites": {
      "keywords": [
        "CHAOS",
        "PRIEST"
      ],
      "other": "Prayers to the Dark Gods"
    },
    "effect": "If this Prayer is successful, then while the Prayer remains in effect, you gain +Double Rank bonus dice to melee attacks you make, and you count all melee weapons you wield as having AP -4.",
    "flavor": "You begin to radiate the unbridled power of the Warp.",
    "source": "apocrypha",
    "page": 257
  },
  {
    "id": "one_or_more_allied_aeldari_or_drukhari_saga_of_majesty_aoa",
    "name": "one or more allied Aeldari or Drukhari Saga of Majesty (Abundance of Apocrypha)",
    "cost": 20,
    "prerequisites": {
      "attributes": {
        "fellowship": 4
      },
      "keywords": [
        "SPACE WOLVES"
      ]
    },
    "effect": "You may spend a point of Wrath to immediately pass a Resolve test. In addition, when you pass a Resolve test, you may spend one or more Glory to rally and inspire others: all characters with the IMPERIUM keyword within 15m heal Shock equal to twice the amount of Glory spent. Saga of the Bear",
    "flavor": "You are like the warrior-kings of Fenris, wise and mighty, inspiring others to acts of valour and greatness.",
    "source": "apocrypha",
    "page": null
  },
  {
    "id": "only_in_death_does_duty_end_aoa",
    "name": "Only in Death Does Duty End (Abundance of Apocrypha)",
    "cost": 30,
    "prerequisites": {},
    "effect": "When you are Dying, you may continue to act normally, though you continue to suffer Traumatic Wounds and additional Wrath Dice as normal for a Dying character. If ever you roll a 6 on all your Wrath dice while Dying, you immediately regain 1 Wound.",
    "flavor": "You will not allow so trivial a thing as a mortal wound interfere with delivering death to the enemies of the Imperium.",
    "source": "apocrypha",
    "page": 240
  },
  {
    "id": "orthopraxy",
    "name": "Orthopraxy",
    "cost": 20,
    "prerequisites": {
      "keywords": [
        "IMPERIUM"
      ]
    },
    "effect": "As a Simple Action you can begin mentally reciting Ecclesiastical liturgies. As long as you sacrifice your Simple Action in this way, you gain +1 bonus Willpower, for a maximum of Double Rank Rounds. You can't use this Talent again until you complete a Respite.",
    "flavor": "The litanies of His holy word have burned themselves deep in your memory. You can recite hymns and prayers to the Emperor by rote, and can use them to bolster your mind.",
    "source": "core",
    "page": 99
  },
  {
    "id": "overseer_aoa",
    "name": "Overseer (Abundance of Apocrypha)",
    "cost": 25,
    "prerequisites": {
      "skills": {
        "leadership": 3
      }
    },
    "effect": "As a Full Action, you may command a single ally within 15+Rank metres. That ally may immediately take Movement, a Combat Action, and a Simple Action as if it was their turn. This does not prevent the ally from taking a turn of their own later in the round. Once you have used this option, you may not do so again until after your next Regroup.",
    "flavor": "Allies follow your direction without hesitation, trusting your judgement in the heat of battle.",
    "source": "apocrypha",
    "page": 240
  },
  {
    "id": "overwatch_aoa",
    "name": "Overwatch (Abundance of Apocrypha)",
    "cost": 20,
    "prerequisites": {
      "attributes": {
        "initiative": 3
      }
    },
    "effect": "When you are Charged, you may use your Reflexive Action and spend 1 ammo to make a ranged attack against the enemy Charging you. This attack is resolved before the Charge begins, and the enemy's receives +3 Defence against this attack. This is considered a Salvo option, so you must reload your weapon after this attack before you can fire it again.",
    "flavor": "You’ve trained to be able to snap off a burst of fire at a charging foe.",
    "source": "apocrypha",
    "page": 116
  },
  {
    "id": "pain_glove_endurant",
    "name": "Pain Glove Endurant",
    "cost": 30,
    "prerequisites": {
      "attributes": {
        "willpower": 5
      },
      "keywords": [
        "ADEPTUS ASTARTES",
        "IMPERIAL FISTS"
      ]
    },
    "effect": "You ignore penalties to Tests caused by pain. In addition, you are immune to Fear.",
    "flavor": "Having regularly engaged in the tradition of the Pain Glove familiar to the scions of Dorn, you have pitted your will against relentless pain. You typically prove the victor in such battles and have learned to disregard fear and suffering as unworthy distractions.",
    "source": "voa",
    "page": 49
  },
  {
    "id": "paranoid",
    "name": "Paranoid",
    "cost": 20,
    "prerequisites": {
      "skills": {
        "cunning": 3
      }
    },
    "effect": "Once per session when you have access to a communications device, you may ask your ring of contacts one question they may know. The GM rolls a secret Cunning (Fel) Test and provides you with whatever information the contact can provide. The number of Icons rolled on the Test determines the quality and amount of information.",
    "flavor": "You constantly fear for your life. You have established a web of connections to gather information on dangerous conspiracies.",
    "source": "core",
    "page": 137
  },
  {
    "id": "pass_unseen_aoa",
    "name": "Pass Unseen (Abundance of Apocrypha)",
    "cost": 20,
    "prerequisites": {
      "keywords": [
        "ASPECT WARRIOR"
      ],
      "other": "Striking Scorpion Aspect, Stealth 6+"
    },
    "effect": "Your body, mind, and soul are wreathed in deceptive mists and illusory shadows, such that you cannot easily be detected, even by the most vigilant of sentries. You add an Exalted Icon to all Stealth tests you attempt.",
    "flavor": "",
    "source": "apocrypha",
    "page": 250
  },
  {
    "id": "perplexingly_persuasive",
    "name": "Perplexingly Persuasive",
    "cost": 10,
    "prerequisites": {
      "skills": {
        "persuasion": 4
      }
    },
    "effect": "When you succeed on an Interaction Attack using Persuasion to inflict the Hindered Condition (Wrath & Glory Rulebook, page 190), your target suffers a DN penalty of 2 instead of 1. Any Shifts can be spent to increase the DN penalty of your target by 2, instead of 1. At the Gamemaster's discretion, this Talent only works on targets that understand the language you speak, and particularly hardened foes may require an Opposed Test against their Insight (Fel).",
    "flavor": "Your words are so convincing that even enemies are inclined to listen, pulling their punches as they wonder if they are on the right side.",
    "source": "redacted2",
    "page": 66
  },
  {
    "id": "piercing_strike_aoa",
    "name": "Piercing Strike (Abundance of Apocrypha)",
    "cost": 30,
    "prerequisites": {
      "keywords": [
        "ASPECT WARRIOR"
      ],
      "other": "Howling Banshee aspect, Weapon Skill rating 5+"
    },
    "effect": "Your blade is always perfectly placed to cut down the mightiest foes. When you use an Executioner or other two-handed melee weapon to make a melee attack, you may attempt a Piercing Strike. This adds the Careful and Unwieldy (2) traits to the weapon, but increases the weapon’s damage by +Double Rank ED.",
    "flavor": "",
    "source": "apocrypha",
    "page": 250
  },
  {
    "id": "pointblank_fusillade_aoa",
    "name": "Point-Blank Fusillade (Abundance of Apocrypha)",
    "cost": 20,
    "prerequisites": {
      "skills": {
        "ballisticSkill": 2
      },
      "keywords": [
        "LEAGUES OF VOTANN"
      ]
    },
    "effect": "Any LEAGUES OF VOTANN ranged weapon you wield may be fired when you are engaged in melee, as if it had the Pistol trait. If the weapon also has the Heavy trait, then the DN of attacks made when engaged are increased by +2.",
    "flavor": "You are resolute and steadfast, able to maintain a punishing rate of fire even when the enemy is at your throat.",
    "source": "apocrypha",
    "page": 240
  },
  {
    "id": "power_from_pain",
    "name": "Power From Pain",
    "cost": 20,
    "prerequisites": {
      "keywords": [
        "DRUKHARI"
      ]
    },
    "effect": "The first time you make a successful attack Test that kills a living creature in combat, you gain +Rank Determination. The second time you make a successful attack Test that kills a living creature in combat, you gain +Rank Speed. The third time you make a successful attack Test that kills a living creature in combat, you gain +Rank Resolve. Benefits gained from this Talent expire at the end of combat, or at the end of any combat Turn in which you do not kill a living creature.",
    "flavor": "You find tasting the souls of the freshly slain to be intoxicating, goading you to greater acts of slaughter for the next invigorating high.",
    "source": "aeldari",
    "page": 61
  },
  {
    "id": "power_of_tides_aoa",
    "name": "Power of Tides (Abundance of Apocrypha)",
    "cost": 20,
    "prerequisites": {
      "keywords": [
        "T'AU EMPIRE",
        "ETHEREAL CASTE",
        "PRIEST"
      ],
      "other": "Invocations of the Ethereals"
    },
    "effect": "If this Prayer is successful, then while the Prayer remains in effect, a single group of non-T’au allies with the T’AU EMPIRE keyword, numbering no more than your Willpower score, may add +Rank ED to the damage their attacks inflict.",
    "flavor": "It is not only the T’au who are inspired by the presence of the Ethereals. As surely as a world’s moons govern the tides of its oceans, so are even the strangest alien auxiliaries given fresh heart by such a serene presence.",
    "source": "apocrypha",
    "page": 258
  },
  {
    "id": "power_through_pain_aoa",
    "name": "Power Through Pain (Abundance of Apocrypha)",
    "cost": 20,
    "prerequisites": {
      "species": [
        "drukhari"
      ]
    },
    "effect": "You gain one Pain point whenever an enemy does one of the following within Willpower+Rank metres of you: a character suffers three or more Wounds from a single attack, you affect an enemy with an Intimidation interaction attack, a character fails a Resolve test, a character becomes Exhausted. You immediately recover +Rank Shock whenever you gain a Pain point. Further, you gain an increasing bonus for the number of Pain points you’ve obtained, as described on the table below. You lose all accumulated Pain points upon taking a Regroup or Respite. Pain Points Effect 1 Inured to Suffering: +1 Resilience 2 Eager to Flay: +Rank to Speed. 3 Flensing Fury: +Rank bonus dice to Weapon Skill tests. 4 Emboldened by Bloodshed: +Rank Resilience 5+ Mantle of Agony: Your Resolve increases by +Double Rank.",
    "flavor": "Your soul slips away, little by little, and you replenish it by drinking deep of the anguish and despair of others.",
    "source": "apocrypha",
    "page": 241
  },
  {
    "id": "precision_shooter",
    "name": "Precision Shooter",
    "cost": 30,
    "prerequisites": {
      "skills": {
        "ballisticSkill": 4
      }
    },
    "effect": "[AI-Generated] When you make a Called Shot, you do not suffer the usual +2 DN penalty.",
    "flavor": "[AI-Generated] Your marksmanship is so refined that targeting specific body parts is no more difficult than a center-mass shot.",
    "source": "core",
    "page": null
  },
  {
    "id": "precision_shot_aoa",
    "name": "Precision Shot (Abundance of Apocrypha)",
    "cost": 20,
    "prerequisites": {
      "skills": {
        "ballisticSkill": 5
      }
    },
    "effect": "When you aim and make a successful ranged attack with the Called Shot option, the weapon gains the Mortal (1) trait.",
    "flavor": "Your shots are lethally precise, able to hit a target’s weak points with terrifying ease.",
    "source": "apocrypha",
    "page": 241
  },
  {
    "id": "prey_upon_the_weak_aoa",
    "name": "Prey Upon the Weak (Abundance of Apocrypha)",
    "cost": 15,
    "prerequisites": {
      "skills": {
        "ballisticSkill": 2
      },
      "species": [
        "drukhari"
      ]
    },
    "effect": "When you make a ranged attack against an enemy who is currently under the effects of any of the Fear, Terror, or Pinned conditions, re-roll Double Rank dice on the attack.",
    "flavor": "Your senses heighten in the presence of terrified prey.",
    "source": "apocrypha",
    "page": 241
  },
  {
    "id": "primaris_perspective",
    "name": "Primaris Perspective",
    "cost": 40,
    "prerequisites": {
      "species": [
        "primaris"
      ]
    },
    "effect": "You gain +Rank bonus dice Resolve and Corruption Tests. You gain +Double Rank bonus dice to Scholar Tests regarding historical events from the 31st Millennium or earlier.",
    "flavor": "You have been held in suspended animation since the 31st Millennium, just after the Horus Heresy ended. You remember a very different galaxy, and have a unique perspective on the Dark Imperium, a perspective that encompasses memories of both great hope and great sorrow.",
    "source": "core",
    "page": 137
  },
  {
    "id": "prismatic_blur_aoa",
    "name": "Prismatic Blur (Abundance of Apocrypha)",
    "cost": 20,
    "prerequisites": {
      "keywords": [
        "HARLEQUIN"
      ],
      "species": [
        "aeldari"
      ]
    },
    "effect": "When you Run or Sprint while wearing a holo-suit, increase your Resilience by +Double Rank.",
    "flavor": "You accelerate into a lightning-fast sprint, weaving and tumbling to magnify the effects of your holo-field.",
    "source": "apocrypha",
    "page": 241
  },
  {
    "id": "promethium_proficiency",
    "name": "Promethium Proficiency",
    "cost": 20,
    "prerequisites": {
      "keywords": [
        "IMPERIUM"
      ]
    },
    "effect": "When using weapons with the Inflict (On Fire) Trait, you gain +Rank ED to any damage rolls. Once per Round, you may gain 1 Wrath when you kill an enemy of the Imperium using a weapon with the Inflict (On Fire) Trait.",
    "flavor": "You have been trained in the use of the Emperor's holy fire.",
    "source": "core",
    "page": 138
  },
  {
    "id": "properly_prepared_aoa",
    "name": "Properly Prepared (Abundance of Apocrypha)",
    "cost": 20,
    "prerequisites": {
      "keywords": [
        "LEAGUES OF VOTANN"
      ]
    },
    "effect": "You may carry up to 5 reloads as standard, rather than 3; this may be increased by equipment as normal. In addition, you may spend a Wrath point to declare that you've still got a back-up gun, which you immediately produce from its hiding spot. This is an Autoch-pattern Bolt Pistol with a single reload, and it's better not to ask where you were keeping it.",
    "flavor": "You can never be too prepared for the worst outcomes. You're never without a few extra magazines and a back-up sidearm.",
    "source": "apocrypha",
    "page": 241
  },
  {
    "id": "prosanguine_aoa",
    "name": "Prosanguine (Abundance of Apocrypha)",
    "cost": 20,
    "prerequisites": {
      "keywords": [
        "ADEPTUS MECHANICUS"
      ],
      "other": "ADEPTUS MECHANICUS keyword, Autosanguine augmetic"
    },
    "effect": "You may attempt a Tech test (DN 3) to do this, and if successful, you regain 1d3+1 Wounds immediately, +1 per Exalted Icon you shift. Once you have attempted this, you cannot attempt it again until you have received a Respite.",
    "flavor": "Between your iron will and your devotion to the Omnissiah, you are able to accelerate the effects of your Autosanguinator systems.",
    "source": "apocrypha",
    "page": 241
  },
  {
    "id": "protector_imperative_aoa",
    "name": "Protector Imperative (Abundance of Apocrypha)",
    "cost": 20,
    "prerequisites": {
      "keywords": [
        "SKITARII"
      ]
    },
    "effect": "At the start of any of your turns, you may activate the Protector Imperative. This adds +Double Rank bonus dice to any ranged attacks you attempt during that turn but increases the DN of any melee attacks you attempt that turn by +3. At the end of a turn in which you activate the Protector Imperative, you suffer 1d3+2 Shock.",
    "flavor": "Though doctrina imperatives are normally initiated by a Tech-Priest overseeing the Skitarii in action, you have been equipped with protocols for independent action. You can engage an imperative which heightens visual acuity, fine motor control, and reflexes.",
    "source": "apocrypha",
    "page": 242
  },
  {
    "id": "psalm_of_righteous_smiting_aoa",
    "name": "Psalm of Righteous Smiting (Abundance of Apocrypha)",
    "cost": 20,
    "prerequisites": {
      "keywords": [
        "ADEPTUS MINISTORUM",
        "IMPERIUM",
        "PRIEST"
      ],
      "other": "Hymns of Battle"
    },
    "effect": "If this Prayer is successful, you add Double Rank bonus dice to all melee attacks you make and improve the AP of your melee attacks by 1 while the Prayer remains in effect.",
    "flavor": "Invoking the strength of the God-Emperor, divine power flows through you as you carve apart the Emperor’s foes like the warrior-saints of legend.",
    "source": "apocrypha",
    "page": 255
  },
  {
    "id": "psyinert_aoa",
    "name": "Psy-Inert (Abundance of Apocrypha)",
    "cost": 20,
    "prerequisites": {
      "other": "Human species, may not have PSYKER keyword"
    },
    "effect": "The DN of any psychic power that targets you is increased by +Rank.",
    "flavor": "Your soul is dull and doesn’t react to the influence of the Warp.",
    "source": "apocrypha",
    "page": 242
  },
  {
    "id": "pulse_onslaught_aoa",
    "name": "Pulse Onslaught (Abundance of Apocrypha)",
    "cost": 20,
    "prerequisites": {
      "keywords": [
        "FIRE CASTE"
      ]
    },
    "effect": "When you make a ranged attack with a PULSE weapon, you may spend one Glory. If you do so, each Exalted Icon you shift for Extra Damage on that attack adds +2ED rather than 1. You cannot use this talent while wearing a BATTLESUIT.",
    "flavor": "Rather than charge into hand-to-hand combat, T’au soldiers intensify their fire and lay waste to their foes methodically.",
    "source": "apocrypha",
    "page": 82
  },
  {
    "id": "quell_the_warp_aoa",
    "name": "Quell the Warp (Abundance of Apocrypha)",
    "cost": 10,
    "prerequisites": {
      "attributes": {
        "willpower": 5
      },
      "species": [
        "pariah"
      ]
    },
    "effect": "You gain the ability to Deny the Witch, described on page 267 of the Wrath & Glory Core Rulebook, even though you are not a psyker. Instead of a Psychic Mastery test, you make a Willpower test with a bonus of +Double Rank.",
    "flavor": "You can focus your mind to still disturbances in the Warp nearby.",
    "source": "apocrypha",
    "page": 179
  },
  {
    "id": "rad_saturated",
    "name": "Rad-Saturated",
    "cost": 10,
    "prerequisites": {
      "keywords": [
        "ADEPTUS MECHANICUS"
      ]
    },
    "effect": "Whenever a creature enters Engagement with you or starts a Turn Engaged with you they make a Toughness Test with a DN equal to your Rank x2. If they fail, they are Hindered until the start of their next Turn.",
    "flavor": "You have exposed yourself to semi-lethal quantities of radiation, sacrificing the length of your life to better serve as the Omnissiah's deadly assailant.",
    "source": "redacted2",
    "page": 71
  },
  {
    "id": "raiding_master",
    "name": "Raiding Master",
    "cost": 10,
    "prerequisites": {
      "attributes": {
        "initiative": 5
      },
      "keywords": [
        "ADEPTUS ASTARTES",
        "WHITE SCARS"
      ]
    },
    "effect": "You gain +(Rank) dice to all Tests to plan and execute a raid or ambush. You also gain the same bonus to Tests to detect or prevent enemies from raiding or ambushing you and your allies.",
    "flavor": "Not only are the White Scars masters of raiding warfare, but they also have an ancient hatred of raiders who dare strike against the Imperium. Conflicts against Drukhari and Traitor Astartes alike have long nourished this hatred. As few others have done, you have mastered raiding warfare by careful study and hard-won experience.",
    "source": "voa",
    "page": 49
  },
  {
    "id": "rain_of_death_aoa",
    "name": "Rain of Death (Abundance of Apocrypha)",
    "cost": 30,
    "prerequisites": {
      "keywords": [
        "ASPECT WARRIOR"
      ],
      "other": "Dark Reaper aspect, Ballistic Skill rating 7+"
    },
    "effect": "You are a master at delivering precision barrages that few enemies can escape. When the you use a Tempest Launcher or other Indirect ranged weapon to make a ranged attack, they may increase the rating of the Blast trait of the weapon by Double Rank (this also increases the number of enemies in a Mob hit by +Rank). In addition, enemies hit by the blast must pass a Resolve test (DN = your Ballistic Skill rating) or become pinned.",
    "flavor": "",
    "source": "apocrypha",
    "page": 250
  },
  {
    "id": "rapid_assault",
    "name": "Rapid Assault",
    "cost": 20,
    "prerequisites": {
      "skills": {
        "athletics": 2,
        "ballisticSkill": 3
      },
      "keywords": [
        "ADEPTUS ASTARTES"
      ]
    },
    "effect": "You can fire ranged weapons with the Assault Trait (Wrath & Glory Core Rulebook, page 208) as part of a Sprint (Wrath & Glory Core Rulebook, page 180) without an increased DN.",
    "flavor": "You can maintain a steady volley of fire while swiftly advancing.",
    "source": "voa",
    "page": 49
  },
  {
    "id": "rapid_assault_aoa",
    "name": "Rapid Assault (Abundance of Apocrypha)",
    "cost": 30,
    "prerequisites": {
      "keywords": [
        "ASPECT WARRIOR"
      ],
      "other": "Swooping Hawk aspect, Weapon Skill rating 6+"
    },
    "effect": "You hurtle into the fray, flitting between opponents and delivering a storm of attacks. When you charge while flying, they may ignore up to Double Rank points of DN penalty when making a multi-attack. Further, against a Mob, each Icon scored above the target’s Defence strikes two additional members of the mob instead of one.",
    "flavor": "",
    "source": "apocrypha",
    "page": 250
  },
  {
    "id": "reborn_together_aoa",
    "name": "Reborn Together (Abundance of Apocrypha)",
    "cost": 10,
    "prerequisites": {
      "keywords": [
        "YNNARI"
      ],
      "species": [
        "aeldari",
        "drukhari"
      ]
    },
    "effect": "Add +Double Rank to your Resolve when within 10m of one or more allied Aeldari or Drukhari",
    "flavor": "The goal of the Ynnari is to save every member of the Aeldari race, whatever their previous allegiance.",
    "source": "apocrypha",
    "page": 242
  },
  {
    "id": "recitation_of_focus",
    "name": "Recitation of Focus",
    "cost": 15,
    "prerequisites": {
      "skills": {
        "ballisticSkill": 6
      },
      "keywords": [
        "ADEPTUS ASTARTES"
      ]
    },
    "effect": "You chant a stern and steady prayer that guides your brethren to focus and clarity, enabling their shots to hit even the most distant and mysterious foes through the chaos of the battlefield. Affected targets within 20m range extend all the ranges of their ranged weapons by their short range. Affected targets reduce the bonus due to cover conferred to a threat by 1, and reduce Vision Penalties by 1. By spending an extra point of Faith, affected targets may reroll a number of attack dice equal to your Rank, including the Wrath die.",
    "flavor": "[AI-Generated] Your chanted prayers sharpen the aim of your brothers, guiding their shots to strike true.",
    "isLitany": true,
    "source": "voa",
    "page": 58
  },
  {
    "id": "recitation_of_focus_aoa",
    "name": "Recitation of Focus (Abundance of Apocrypha)",
    "cost": 20,
    "prerequisites": {
      "keywords": [
        "ADEPTUS ASTARTES",
        "IMPERIUM",
        "PRIEST"
      ],
      "other": "Litanies of Devotion"
    },
    "effect": "If this Prayer is successful, you and all allies with the IMPERIUM keyword within 12m add +Rank bonus dice to ranged attacks while the Prayer remains in effect.",
    "flavor": "You recite creeds that focus the minds of the faithful to ensure their shots strike true.",
    "source": "apocrypha",
    "page": 255
  },
  {
    "id": "reclamator",
    "name": "Reclamator",
    "cost": 20,
    "prerequisites": {
      "skills": {
        "tech": 2
      }
    },
    "effect": "When you requisition Wargear you can choose to reduce the Value by Double Rank to a minimum of 1 (Rarity is unaffected). However, if you do so, the item cannot be used until you repair it. By default, this requires 8 hours of work and a successful Tech (Int) Test, with a DN equal to the Wargear's original Value + Rarity. Shifts can be used to halve the repair time. If you do not have the ADEPTUS MECHANICUS Keyword, this activity is considered illegal, a violation of both Lex Imperialis and the Treaty of Mars.",
    "flavor": "You have access to a reliable supply of broken or damaged technology, and can re-assemble it yourself at half the cost.",
    "source": "redacted2",
    "page": 71
  },
  {
    "id": "refrain_of_blazing_piety_aoa",
    "name": "Refrain of Blazing Piety (Abundance of Apocrypha)",
    "cost": 20,
    "prerequisites": {
      "keywords": [
        "ADEPTUS MINISTORUM",
        "IMPERIUM",
        "PRIEST"
      ],
      "other": "Hymns of Battle"
    },
    "effect": "If this Prayer is successful, a single enemy lacking the IMPERIUM keyword within 12m of you suffers 1d3 Mortal Wounds. If the enemy has the CHAOS keyword, they instead suffer 2d3 Mortal Wounds. Increase the number of Mortal Wounds by +1 per Exalted Icon shifted.",
    "flavor": "The fervent intonations that the God-Emperor will smite down His foes are believed so powerfully that these sacred words can cause heretics to combust.",
    "source": "apocrypha",
    "page": 255
  },
  {
    "id": "repent",
    "name": "Repent!",
    "cost": 20,
    "prerequisites": {
      "attributes": {
        "willpower": 3
      },
      "keywords": [
        "ADEPTUS MINISTORUM",
        "ADEPTA SORORITAS"
      ],
      "keywordsAny": true
    },
    "effect": "You gain +1 Faith. You can attempt to force another adherent of the Imperial Cult to repent using the force of your will. Spend 1 Faith and make an opposed Intimidation (Wil) Test against your target with +Rank bonus dice. If you are in combat, this takes a Combat Action. If you succeed on the Test and the target has the IMPERIUM Keyword, they kneel and repent for Double Rank x 10 seconds.",
    "flavor": "The righteousness of your indignation rings in the ears of those true to the Imperial Cult.",
    "isFaithTalent": true,
    "source": "core",
    "page": 99
  },
  {
    "id": "righteous_suffering",
    "name": "Righteous Suffering",
    "cost": 20,
    "prerequisites": {
      "keywords": [
        "ADEPTA SORORITAS",
        "ADEPTUS MINISTORUM"
      ],
      "keywordsAny": true
    },
    "effect": "You gain +1 Faith. Once per Turn, whenever you suffer one or more Wounds, roll a Wrath Die. If you roll an Exalted Icon, you gain +1 Wrath Point.",
    "flavor": "You embrace suffering, performing constant penance, sharing in the Emperor's past agonies to better embody His righteous vengeance.",
    "isFaithTalent": true,
    "source": "redacted2",
    "page": 69
  },
  {
    "id": "righteous_wrath",
    "name": "Righteous Wrath",
    "cost": 20,
    "prerequisites": {
      "attributes": {
        "willpower": 3
      },
      "keywords": [
        "ADEPTUS MINISTORUM",
        "ADEPTA SORORITAS"
      ],
      "keywordsAny": true
    },
    "effect": "You gain +1 Faith. As a Combat Action, you can spend 1 Faith to gain +2 Wrath. When you do this, you can sacrifice 1 point of Wrath to give an ally with the IMPERIUM Keyword that can hear you and is faithful to the Imperial Cult +1 Wrath.",
    "flavor": "Your burning fervour inspires you to great deeds and can similarly inspire your allies.",
    "isFaithTalent": true,
    "source": "core",
    "page": 144
  },
  {
    "id": "rising_crescendo",
    "name": "Rising Crescendo",
    "cost": 10,
    "prerequisites": {
      "keywords": [
        "HARLEQUIN"
      ]
    },
    "effect": "You may move up to triple your Speed when using the Charge Full-Round Action. You do not provoke Reflexive Attacks when you move out of Engagement from an enemy.",
    "flavor": "Cegorach taught His followers to strike and disappear like lightning, with dazzling speed and force, before dancing away from enemy reprisals with contemptuous ease.",
    "source": "aeldari",
    "page": 62
  },
  {
    "id": "rite_magnometrics",
    "name": "Rite of Magnometrics",
    "cost": 20,
    "prerequisites": {
      "keywords": [
        "ADEPTUS MECHANICUS"
      ]
    },
    "effect": "You can pick up and carry metal objects up to 3 + Double Rank metres away without touching them. You can also draw your body to any large or stable metal object and hover above it. No Test is required for either of these abilities. Using this Talent in combat requires a Simple Action. The effective range of this Talent is equal to your Rank x 20 metres. The effective Strength of this Talent (for use when throwing an object or resisting another force) is 1 + Double Rank.",
    "flavor": "You have implemented powerful electromagnets into your augmetic replacements that you can control mentally. You can vary the intensity and frequency of your electromagnetic emissions, allowing you to summon metal objects to you and hover over large metallic surfaces.",
    "source": "core",
    "page": 138
  },
  {
    "id": "rite_of_fear",
    "name": "Rite of Fear",
    "cost": 30,
    "prerequisites": {
      "keywords": [
        "ADEPTUS MECHANICUS"
      ]
    },
    "effect": "You can trigger the Rite of Fear as a Combat Action. The rite affects all characters within a cone, 10 metres long by 3 metres wide at its terminus. Characters within the area of effect who lack ear protection (including augmetic ears) must immediately make a Fear Test with a DN of 2 + Double Rank. You are the vertex of the cone but are immune to its effects. You can purchase the Disturbing Voice Talent for 10 XP.",
    "flavor": "Your voice box has been replaced with a synthetic vocoder, critical for audible communication in Lingua-technis, and able to emit infrasonic sounds. These deep frequencies are below auditory detection and can trigger fear responses.",
    "source": "core",
    "page": 138
  },
  {
    "id": "rite_of_shroudpsalm",
    "name": "Rite of Shroudpsalm",
    "cost": 20,
    "prerequisites": {
      "keywords": [
        "ADEPTUS MECHANICUS"
      ]
    },
    "effect": "You may activate or deactivate this Talent as a Free Action. While the Talent is active, you do not register on auspices, pict-thieves, monoscopes, or other forms of scanning or recording equipment. Anyone attempting to identify your presence uses their own unmodified Awareness (Int), without any bonuses from Wargear.",
    "flavor": "You are implanted with noospheric negators, electromagnetic disruptors, and stealth screen projectors, all designed to interfere with enemy surveillance equipment.",
    "source": "redacted2",
    "page": 71
  },
  {
    "id": "rite_of_the_voltagheist",
    "name": "Rite of the Voltagheist",
    "cost": 10,
    "prerequisites": {
      "keywords": [
        "ADEPTUS MECHANICUS"
      ]
    },
    "effect": "When you are hit by a melee attack, or a Complication is rolled on an attack Test that targets you, your attacker suffers Shock damage equal to your Rank. In addition, your attacker must pass a DN3 Toughness Test or be Restrained for one Round, and be knocked Prone on a Complication.",
    "flavor": "Either the Corpuscarii or the Fulgurite Electro-Priesthoods have implanted electoo circuitry into your body, channelling the motive force that flows through you to protect you from enemies of the Omnissiah.",
    "source": "redacted2",
    "page": 71
  },
  {
    "id": "rite_pure_thought",
    "name": "Rite of Pure Thought",
    "cost": 20,
    "prerequisites": {
      "keywords": [
        "ADEPTUS MECHANICUS"
      ]
    },
    "effect": "You gain +Rank bonus dice on Resolve and Fear Tests, and to resist Persuasion and Intimidation Interaction Attacks. You gain +Rank bonus dice when making Investigation Tests.",
    "flavor": "You have replaced a hemisphere of your brain with a cogitator. You live an emotionless existence, depending upon the peaceful and rewarding purity of logic.",
    "source": "core",
    "page": 139
  },
  {
    "id": "rubicon_primaris",
    "name": "Rubicon Primaris",
    "cost": 80,
    "prerequisites": {
      "keywords": [
        "ADEPTUS ASTARTES"
      ],
      "tier": 3
    },
    "effect": "Few Space Marines could refuse the prospect of being remade, stronger and faster, more capable of waging war against the enemies of the Imperium. You have undergone the extensive and agonising operation required to be implanted with the three additional organs needed to join your Primaris brethren and now count yourself among those who have crossed the Rubicon Primaris. You gain the Bolter Discipline and the Built Tough talents. You gain the PRIMARIS keyword. In future, you may choose from the Primaris Assencion packages. (pg 34) You gain +2 Influence, and 1 item of Uncommon Wargear. Unless using Terminator Armour you replace your current Power Armour with Mk X Tacticus Armour - Or other variants as discussed with your GM.",
    "flavor": "[AI-Generated] You have crossed the Rubicon, undergoing the dangerous surgery to become Primaris. Many do not survive the procedure.",
    "isAscension": true,
    "source": "voa",
    "page": 43
  },
  {
    "id": "rumoursmith",
    "name": "Rumoursmith",
    "cost": 10,
    "prerequisites": {},
    "effect": "You gain +Rank bonus dice to Cunning (Fel) Tests to hear the word on the street. Any Shifts you generate on this Test can be spent to insert a new rumour into circulation. The rumour does not have to be true, but is widely believed as such, and cannot be traced back to you.",
    "flavor": "You're vigilant to local gossip, a bountiful source of both reliable and wildly inaccurate intelligence.",
    "source": "redacted2",
    "page": 66
  },
  {
    "id": "sacred_radiance",
    "name": "Sacred Radiance",
    "cost": 20,
    "prerequisites": {
      "keywords": [
        "ADEPTA SORORITAS",
        "ADEPTUS MINISTORUM"
      ],
      "keywordsAny": true
    },
    "effect": "You gain +1 Faith. As a Simple Action, you may spend 1 Faith to emit divine light. You cast this light as most people cast a shadow — whatever you look upon becomes fully illuminated for you and your allies, negating all vision penalties. This light is physically painful to behold for the enemies of the Emperor. For CHAOS or DAEMON characters, any Tests against you increase their DN by 1. If a Complication is rolled on a Test against you, the attacker gains the Blinded Condition. In combat, the effects of Sacred Radiance apply for 1 Round. Outside of combat, the effects persist for the rest of the scene, or until you choose to extinguish the light.",
    "flavor": "You are a living embodiment of the maxim that faith is a light that shines brightest in the dark.",
    "isFaithTalent": true,
    "source": "redacted2",
    "page": 69
  },
  {
    "id": "saga_of_the_bear_aoa",
    "name": "Saga of the Bear (Abundance of Apocrypha)",
    "cost": 20,
    "prerequisites": {
      "attributes": {
        "toughness": 6
      },
      "keywords": [
        "SPACE WOLVES"
      ]
    },
    "effect": "When you roll Determination, you may spend Glory to reduce the amount of Shock suffered. Each point of Glory spent reduces the amount of Shock suffered by 2.",
    "flavor": "You are as massive and unyielding as the mountains of Asaheim.",
    "source": "apocrypha",
    "page": 242
  },
  {
    "id": "saga_of_the_warrior_born_aoa",
    "name": "Saga of the Warrior Born (Abundance of Apocrypha)",
    "cost": 20,
    "prerequisites": {
      "skills": {
        "weaponSkill": 6
      },
      "keywords": [
        "SPACE WOLVES"
      ]
    },
    "effect": "When you spend one or more Glory to add extra dice to a melee attack, each Glory you spend adds two dice rather than one.",
    "flavor": "You are as deadly as you are savage, and few can stand before your blade.",
    "source": "apocrypha",
    "page": 243
  },
  {
    "id": "scion_of_the_forge",
    "name": "Scion of the Forge",
    "cost": 20,
    "prerequisites": {
      "skills": {
        "tech": 4
      },
      "keywords": [
        "ADEPTUS ASTARTES"
      ]
    },
    "effect": "When making a Tech (Int) Test to analyse or repair a piece of advanced Imperial machinery or wargear, add +Rank dice.",
    "flavor": "Through ritual study, you have mastered the machine spirits, not just of your wargear but of various tech patterns and obscure devices. What you do not know you learn swiftly, applying your vast knowledge with practised pragmatism and efficiency.",
    "source": "voa",
    "page": 49
  },
  {
    "id": "scorpions_grasp_aoa",
    "name": "Scorpion’s Grasp (Abundance of Apocrypha)",
    "cost": 30,
    "prerequisites": {
      "keywords": [
        "ASPECT WARRIOR"
      ],
      "other": "Striking Scorpion aspect"
    },
    "effect": "Your claw is especially deadly, tearing foes apart in a spectacular fashion. When you wield a Scorpion’s Claw or similar weapon, add the Mortal (1d3) trait to the weapon.",
    "flavor": "",
    "source": "apocrypha",
    "page": 251
  },
  {
    "id": "scorpions_sting_aoa",
    "name": "Scorpion’s Sting (Abundance of Apocrypha)",
    "cost": 30,
    "prerequisites": {
      "keywords": [
        "ASPECT WARRIOR"
      ],
      "other": "Striking Scorpion aspect"
    },
    "effect": "Through extensive training and profound combat instinct, your charges are carefully planned to create as many opportunities as possible for you and your squad’s mandiblasters to fire. When you or a member of your squad charges, and their Mandiblasters fire, roll two d6 for the Mandiblaster Helm instead of one, inflicting 1d3 Mortal Wounds for each die which rolls an Icon.",
    "flavor": "",
    "source": "apocrypha",
    "page": 251
  },
  {
    "id": "scum_savvy",
    "name": "Scum Savvy",
    "cost": 20,
    "prerequisites": {
      "species": [
        "human"
      ]
    },
    "effect": "You gain +Double Rank bonus dice to any Test related to resisting the effects of chemicals. You gain +Rank bonus dice when making Cunning (Fel) Tests.",
    "flavor": "Long years of disreputable carousing during business deals with shady individuals have trained you to effectively fleece the lawless and process potentially dangerous chem substances.",
    "source": "core",
    "page": 139
  },
  {
    "id": "secret_identity",
    "name": "Secret Identity",
    "cost": 20,
    "prerequisites": {
      "keywords": [
        "INQUISITION"
      ]
    },
    "effect": "Work with your GM to define your secret identity; you might be a minor noble from a far-flung system, a travelling merchant barely registering on Administratum records, or a surveying member of the Administratum itself. It might help to select one or two Keywords that apply to your secret identity. Your identity has been well established using Inquisitorial resources. It may afford you benefits when dealing with particular individuals. When your secret identity is challenged, you must make a Deception (Fel) Test to maintain the illusion.",
    "flavor": "You maintain a secret identity that lets you move through the Imperium unnoticed.",
    "source": "core",
    "page": 139
  },
  {
    "id": "seer_councillor",
    "name": "Seer Councillor",
    "cost": 20,
    "prerequisites": {
      "skills": {
        "psychicMastery": 4
      }
    },
    "effect": "When another Psyker within 10m of you successfully activates a psychic power, they automatically gain an extra Exalted Icon, which can be Shifted for Potency effects as normal.",
    "flavor": "You share the burden of psychic power with your allies, helping them to manifest even greater abilities.",
    "source": "aeldari",
    "page": 62
  },
  {
    "id": "sense_of_stone_aoa",
    "name": "Sense of Stone (Abundance of Apocrypha)",
    "cost": 20,
    "prerequisites": {
      "keywords": [
        "T'AU EMPIRE",
        "ETHEREAL CASTE",
        "PRIEST"
      ],
      "other": "Invocations of the Ethereals"
    },
    "effect": "If this Prayer is successful, then while the Prayer remains in effect, a single group of allied T’au numbering no more than your Willpower score, may ignore all Shock suffered when rolling Determination.",
    "flavor": "As stone resists the onslaught of the other elements in their endless quest to wear it away, so do the T’au exhibit that same unbending resilience. The result is a nigh-supernatural fortitude that sees them shrug off even the most punishing blows.",
    "source": "apocrypha",
    "page": 258
  },
  {
    "id": "servant_of_change_aoa",
    "name": "Servant of Change (Abundance of Apocrypha)",
    "cost": 20,
    "prerequisites": {
      "keywords": [
        "CHAOS"
      ]
    },
    "effect": "When the GM spends Ruin, you gain 1 Glory. When you would gain Glory from scoring a Wrath Critical or shifting an Exalted Icon, you may gain two Glory instead, but if you do the GM gains one Ruin.",
    "flavor": "You are a willing vassal of the Changer of Ways, and you embrace the vagaries of fate in all things.",
    "source": "apocrypha",
    "page": 243
  },
  {
    "id": "shadow_haunter",
    "name": "Shadow Haunter",
    "cost": 5,
    "prerequisites": {},
    "effect": "All DN penalties due to darkness are reduced by -1.",
    "flavor": "You have excellent night vision, navigating darkness almost as easily as daylight.",
    "source": "redacted2",
    "page": 66
  },
  {
    "id": "shield_bash",
    "name": "Shield Bash",
    "cost": 10,
    "prerequisites": {},
    "effect": "If you are carrying armour with the Shield Trait, you can use it as a melee weapon with the following profile: Damage (S)+AR, ED 1, AP 0 (AP is 0, unless the shield has the Power Field Trait, in which case the AP is equal to the shield's AR), Traits: Inflict (Hindered). On a successful melee attack Test, Shifts can be spent to increase the DN penalty of the Condition by 1 per Shift.",
    "flavor": "You know how to use your shield as more than a mere defensive tool, but as a slab of heavy metal you can slam into enemies to knock them off balance.",
    "source": "redacted2",
    "page": 66
  },
  {
    "id": "shield_of_aversion",
    "name": "Shield Of Aversion",
    "cost": 20,
    "prerequisites": {
      "keywords": [
        "ADEPTA SORORITAS"
      ]
    },
    "effect": "You gain +1 Faith. As a Simple Action, you may spend 1 Faith to activate your Shield of Aversion. For the remainder of the encounter, the AP value of any attack that targets you or an ally within 10m is reduced by Double your Rank.",
    "flavor": "Your faith is a bulwark, so pure that it slows and restrains your enemies' weapons.",
    "isFaithTalent": true,
    "source": "redacted2",
    "page": 70
  },
  {
    "id": "shield_of_faith",
    "name": "Shield Of Faith",
    "cost": 20,
    "prerequisites": {
      "attributes": {
        "willpower": 3
      },
      "keywords": [
        "ADEPTA SORORITAS"
      ]
    },
    "effect": "You gain +1 Faith. As a Reflexive Action, you may spend 1 Faith to ignore a psychic power or effect (including Perils of the Warp) until the end of the Round. You may spend an additional Faith to grant the same bonus to all allies with the IMPERIUM keyword within 15 + Double Rank metres.",
    "flavor": "Your indomitable belief steels your mind against Warp-witchery.",
    "isFaithTalent": true,
    "source": "core",
    "page": 99
  },
  {
    "id": "shredding_fire_aoa",
    "name": "Shredding Fire (Abundance of Apocrypha)",
    "cost": 20,
    "prerequisites": {
      "keywords": [
        "ASPECT WARRIOR"
      ],
      "other": "Dire Avenger aspect You understand your weapons instinctively, understanding the way to make the most from every"
    },
    "effect": "You understand your weapons instinctively, understanding the way to make the most from every shot. When you make a ranged attack with a SHURIKEN weapon, the weapon changes its AP to -3, but loses the Rending (3) trait.",
    "flavor": "",
    "source": "apocrypha",
    "page": 251
  },
  {
    "id": "shrewd_investments",
    "name": "Shrewd Investments",
    "cost": 10,
    "prerequisites": {},
    "effect": "When you spend Wealth as part of a Requisition Test, roll a number of dice equal to the Wealth spent. You regain Wealth equal to the number of Exalted Icons rolled, up to the amount of Wealth spent on the Test.",
    "flavor": "You are careful with how you spend your coin, always getting the best deal on any merchandise.",
    "source": "redacted2",
    "page": 67
  },
  {
    "id": "sidestep",
    "name": "Sidestep",
    "cost": 30,
    "prerequisites": {
      "attributes": {
        "initiative": 3
      }
    },
    "effect": "You can use Sidestep as a Reflexive Action whenever you are attacked in melee and are aware of the attacker. You must declare a Sidestep before the Attacker makes their Weapon Skill Test — doing so sacrifices your Move Action on your next turn. When you Sidestep, you gain +Double Rank Defence and Resilience for the purpose of resolving the attack. You can only Sidestep once per round, and the bonuses only apply for a single attack.",
    "flavor": "You have a practised ability to evade harm in close combat.",
    "source": "core",
    "page": 139
  },
  {
    "id": "signal_booster",
    "name": "Signal Booster",
    "cost": 10,
    "prerequisites": {
      "skills": {
        "tech": 2
      },
      "keywords": [
        "ADEPTUS MECHANICUS"
      ]
    },
    "effect": "The range at which you can make Interaction Attacks using Tech is increased to 5 times your Intellect attribute in metres (Wrath & Glory Rulebook, page 190). Any Shifts can be spent to increase the Defence or DN penalty of your target by 2, instead of 1.",
    "flavor": "You are equipped to interact with machines at a greater distance, manipulating their spirits to startle and demoralise your foes.",
    "source": "redacted2",
    "page": 71
  },
  {
    "id": "signature_saedath",
    "name": "Signature Saedath",
    "cost": 20,
    "prerequisites": {
      "keywords": [
        "HARLEQUIN"
      ]
    },
    "effect": "Each time you purchase this Talent, choose to master one of the three saedath types below. An Agent can only perform one saedath at a time, but can switch to a different saedath as a Simple Action. Master of Light: Whilst performing this saedath, gain +Rank bonus dice on all Interaction Attack Tests. Master of Dark: Whilst performing this saedath, increase the AP of your melee weapons by +Rank. Master of Twilight: Whilst performing this saedath, you gain +Rank bonus dice on all Tests made whilst Glory and Ruin are equal (you cannot spend Glory to gain bonus dice on these Tests).",
    "flavor": "Harlequins strive to master as many dance forms as they can, but some Players find themselves specialising in specific performance styles. These saedaths are something between a genre, a mythological cycle, a fighting stance, and a military strategy. There are thousands of different saedaths, each with their own ceremonial significance, but they can generally be categorised into one of three types: Light, Dark, and Twilight.",
    "source": "aeldari",
    "page": 62
  },
  {
    "id": "silent",
    "name": "Silent",
    "cost": 20,
    "prerequisites": {},
    "effect": "You can move at full Speed when Moving Stealthily (p.182). Whenever your Stealth Score would be reduced, reduce it by 1 fewer.",
    "flavor": "Moving silently comes as second nature to you.",
    "source": "core",
    "page": 139
  },
  {
    "id": "simultaneous_strike",
    "name": "Simultaneous Strike",
    "cost": 30,
    "prerequisites": {
      "other": "Ballistic Skill 4+ or Weapon Skill 4+"
    },
    "effect": "When you take this Talent, you must choose if it applies to your Ballistic Skill (A) or Weapon Skill (I). You must have a Skill Rating of 4+ in the Skill you choose. You may only Simultaneous Strike with two one-handed melee weapons or two ranged weapons with the Pistol Trait. You can make any Attack Action that has a single target a Simultaneous Strike. Pick your primary weapon; your attack uses all your primary weapon's statistics, such as AP and Weapon Traits. Make your attack Test as normal; if you succeed, add half of the secondary weapon's Damage value as ED to the damage roll.",
    "flavor": "You can accurately attack with two weapons at once.",
    "requiresChoice": true,
    "choiceType": "skill",
    "choiceOptions": [
      "Ballistic Skill",
      "Weapon Skill"
    ],
    "choiceLabel": "Combat Skill",
    "choiceDescription": "Choose which skill this talent applies to (must have 4+ rating)",
    "source": "core",
    "page": 139
  },
  {
    "id": "skilled_rider",
    "name": "Skilled Rider",
    "cost": 20,
    "prerequisites": {
      "skills": {
        "pilot": 4
      },
      "keywords": [
        "ADEPTUS ASTARTES"
      ]
    },
    "effect": "When riding a combat bike, Land Speeder, or similarly swift Astartes vehicle, enemies who make ranged attacks against you or your vehicle increase their DN by +2. This penalty only applies if you moved at least 10m in your previous turn.",
    "flavor": "Atop one of your Chapter's iron steeds, you are capable of feats of daring speed that can see you ride through the teeth of an enemy barrage unharmed.",
    "source": "voa",
    "page": 49
  },
  {
    "id": "skilled_rider_aoa",
    "name": "Skilled Rider (Abundance of Apocrypha)",
    "cost": 25,
    "prerequisites": {
      "keywords": [
        "ASPECT WARRIOR"
      ],
      "other": "Shining Spear aspect, Pilot rating 7+"
    },
    "effect": "You control your jetbike with effortless ease, dodging and weaving between incoming attacks like a leaf caught in a summer’s breeze. You gain an automatic Exalted Icon on all Pilot tests to operate an Aeldari Jetbike.",
    "flavor": "",
    "source": "apocrypha",
    "page": 251
  },
  {
    "id": "skyrunner",
    "name": "Skyrunner",
    "cost": 10,
    "prerequisites": {
      "attributes": {
        "initiative": 4
      },
      "keywords": [
        "AELDARI"
      ]
    },
    "effect": "You gain +Rank bonus dice on any Pilot (A) Tests to drive Hover vehicles. If using the rules for vehicles in Church of Steel, any Hover vehicle you pilot uses the lower of your vehicle's Manoeuvrability or your Initiative+Rank.",
    "flavor": "You prefer to wage war aboard high-speed anti-grav vehicles, pushing your craft to the limit as an extension of your own body.",
    "source": "aeldari",
    "page": 62
  },
  {
    "id": "slick_crew_aoa",
    "name": "Slick Crew (Abundance of Apocrypha)",
    "cost": 30,
    "prerequisites": {
      "skills": {
        "tech": 2
      }
    },
    "effect": "You may work as a loader for a character operating a Heavy or Mounted weapon. While you are within Rank metres of the weapon’s wielder, they may fire the weapon twice, as two actions within a Multi-Action. If the weapon needs to be reloaded due to firing, you may reload it as a Reflexive Action.",
    "flavor": "You’ve got quick hands and work well with a gunner.",
    "source": "apocrypha",
    "page": 243
  },
  {
    "id": "smash_attack",
    "name": "Smash Attack",
    "cost": 20,
    "prerequisites": {
      "skills": {
        "weaponSkill": 2
      }
    },
    "effect": "You gain +Rank ED to any All-Out Attack.",
    "flavor": "You can concentrate all of your strength and rage into a single attack; this strike is deadly, but leaves you open.",
    "source": "core",
    "page": 139
  },
  {
    "id": "sorcerous_might_aoa",
    "name": "Sorcerous Might (Abundance of Apocrypha)",
    "cost": 25,
    "prerequisites": {
      "keywords": [
        "CHAOS",
        "TZEENTCH",
        "PSYKER"
      ]
    },
    "effect": "Gain +1 Corruption. When you succeed at a Psychic Mastery test, you may spend a point of Wrath to gain +Rank additional Exalted Icons to shift.",
    "flavor": "You have seen the maddening truth of the Changer of Ways and emerged with your mind intact and surging with knowledge.",
    "source": "apocrypha",
    "page": 243
  },
  {
    "id": "soulless_shrouding_aoa",
    "name": "Soulless Shrouding (Abundance of Apocrypha)",
    "cost": 30,
    "prerequisites": {
      "attributes": {
        "willpower": 7
      },
      "species": [
        "pariah"
      ]
    },
    "effect": "Whenever you have a Stealth Score, it increases by +Rank. Further, if you would not have a Stealth Score at the start of your turn, you gain a Stealth Score equal to your Rank at the start of your turn. Finally, if your Stealth Score is currently higher than a creature’s Willpower, they cannot perceive you at all— their minds refuse to acknowledge your presence. This talent ceases to work if you are Exhausted or Wounded.",
    "flavor": "Your negative aura is such that mortal minds often simply refuse to perceive you.",
    "source": "apocrypha",
    "page": 243
  },
  {
    "id": "soultearer_portent_aoa",
    "name": "Soultearer Portent (Abundance of Apocrypha)",
    "cost": 20,
    "prerequisites": {
      "keywords": [
        "CHAOS",
        "PRIEST"
      ],
      "other": "Prayers to the Dark Gods"
    },
    "effect": "If this Prayer is successful, then while the Prayer remains in effect, you and all allies with the CHAOS keyword within 12m ad +Rank ED to all melee attacks.",
    "flavor": "Your flock strike at their victim’s very souls, the better to release them from their mortal bonds as an offering to the glory of Chaos.",
    "source": "apocrypha",
    "page": 257
  },
  {
    "id": "spark_of_divinity_aoa",
    "name": "Spark of Divinity (Abundance of Apocrypha)",
    "cost": 20,
    "prerequisites": {
      "species": [
        "custodian"
      ]
    },
    "effect": "When an enemy psyker attempts to use a Psychic Power within 25m of you, you may spend 1 Glory as a Reflexive Action to immediately attempt to Deny the Witch, as if you were a Psyker. You use your Willpower for this and add +Double Rank dice to the roll.",
    "flavor": "You bear a little of the Emperor’s grace within you, which can sometimes unravel the sorcerous workings of The Enemy.",
    "source": "apocrypha",
    "page": 243
  },
  {
    "id": "special_weapons_trooper",
    "name": "Special Weapons Trooper",
    "cost": 20,
    "prerequisites": {
      "skills": {
        "ballisticSkill": 3
      },
      "keywords": [
        "ASTRA MILITARUM"
      ]
    },
    "effect": "...Grenade launcher (p.220). You also receive 3 frag and 3 krak grenades\nHot-Shot Volley Gun (TEMPESTUS SCION only, p.217).",
    "flavor": "Many soldiers of the Astra Militarum receive training in the use of specialty weapons on the battlefield. Often, this training includes basic chants to appease the weapon's war-spirit if it becomes obstinate or recalcitrant.",
    "requiresChoice": true,
    "choiceType": "weapon",
    "choiceOptions": [
      "Combat Shotgun",
      "Plasma Gun",
      "Meltagun",
      "Long Las",
      "Flamer",
      "Grenade Launcher",
      "Hot-Shot Volley Gun"
    ],
    "choiceLabel": "Special Weapon",
    "choiceDescription": "Choose your special weapon (Hot-Shot Volley Gun requires TEMPESTUS SCION)",
    "source": "core",
    "page": 140
  },
  {
    "id": "sphere_of_influence",
    "name": "Sphere Of Influence",
    "cost": 10,
    "prerequisites": {
      "attributes": {
        "fellowship": 4
      },
      "other": "Influence 2+"
    },
    "effect": "At any time, you may spend 1 Glory to nominate a Faction Keyword (Wrath & Glory Rulebook, pages 375–377). Subject to the GM's approval, you may detail a junior member of the Faction in your approximate vicinity. The individual does not work for you, but you have a somewhat positive professional relationship, and you know how to contact them. Your contacts may help you, if it is not too great an inconvenience, or they are provided a sufficiently powerful incentive. In addition, roll a Wrath die. On an Exalted Icon, they owe you a favour. On a Complication, you already owe them a favour.",
    "flavor": "Your privileged position affords you access to a myriad of contacts that may be able to aid you.",
    "source": "redacted2",
    "page": 67
  },
  {
    "id": "spiders_bite_aoa",
    "name": "Spider’s Bite (Abundance of Apocrypha)",
    "cost": 20,
    "prerequisites": {
      "keywords": [
        "ASPECT WARRIOR"
      ],
      "other": "Warp Spider aspect, Weapon Skill rating 5+"
    },
    "effect": "Your blades thrust and stab like the mandibles and forelimbs of a spider, scything through foes with ruthless efficiency. When you make a melee attack using a pair of Power Blades or similar weapons, add the Brutal trait and increase the weapons’ damage by +Rank ED.",
    "flavor": "",
    "source": "apocrypha",
    "page": 251
  },
  {
    "id": "spiders_lair_aoa",
    "name": "Spider’s Lair (Abundance of Apocrypha)",
    "cost": 30,
    "prerequisites": {
      "keywords": [
        "ASPECT WARRIOR"
      ],
      "other": "Warp Spider aspect"
    },
    "effect": "You are deadly in dense terrain, weaving tangles of monofilament wire around their location to ensnare and eviscerate the unwary foes who stumble through the nearly-invisible wires. When the Exarch is in terrain which provides cover, or which counts as difficult terrain, you may spend 1 Glory as a Simple Action to trap that location. Characters other than the Exarch or their squad who enter that terrain must pass an Awareness Test with a DN of 5, or immediately suffer 1d3 Mortal Wounds and the Restrained condition. A trap created dissolves at the start of the Exarch’s next turn.",
    "flavor": "",
    "source": "apocrypha",
    "page": 251
  },
  {
    "id": "spirit_of_the_pack",
    "name": "Spirit of the Pack",
    "cost": 10,
    "prerequisites": {
      "skills": {
        "survival": 3
      },
      "keywords": [
        "ADEPTUS ASTARTES",
        "SPACE WOLVES"
      ]
    },
    "effect": "When making a Test to interact with or influence natural wildlife (including xeno-fauna), you may add +(double Rank) dice. In addition, such creatures are reluctant to attack you, treating you as if you caused Fear with a DN equal to (Rank +2).",
    "flavor": "You count not only the warriors of your Chapter as battle-brothers but the beasts of Fenris and many other worlds. Such is your intuitive understanding of feral beasts that you can almost communicate with them.",
    "source": "voa",
    "page": 50
  },
  {
    "id": "spring_up_aoa",
    "name": "Spring Up (Abundance of Apocrypha)",
    "cost": 10,
    "prerequisites": {
      "attributes": {
        "agility": 3
      }
    },
    "effect": "When you stand up from Prone you are not restricted in the actions or combat options you use during your turn.",
    "flavor": "You can quickly regain your feet.",
    "source": "apocrypha",
    "page": 243
  },
  {
    "id": "stalker_aoa",
    "name": "Stalker (Abundance of Apocrypha)",
    "cost": 20,
    "prerequisites": {
      "keywords": [
        "ASPECT WARRIOR"
      ],
      "other": "Striking Scorpion aspect, Stealth rating 6+"
    },
    "effect": "You are evasive and shadowy, never directly observed, only ever glimpsed out of the corner of an enemy’s eyes; aiming at such a target is nigh-impossible. You and all members of your squad add your Rank to their Defence when in cover, in addition to of the normal bonus to defence for cover.",
    "flavor": "",
    "source": "apocrypha",
    "page": 128
  },
  {
    "id": "stand_firm_aoa",
    "name": "Stand Firm (Abundance of Apocrypha)",
    "cost": 30,
    "prerequisites": {
      "keywords": [
        "ASPECT WARRIOR"
      ],
      "other": "Willpower 5+"
    },
    "effect": "You possess absolute certainty and lead with unbreakable conviction: nothing short of death will see your duty unfulfilled. When you, or any of your Squad, attempt a Resolve or Conviction test, you automatically succeed without needing to roll. In addition, any attack or effect which uses your, or a member of your Squad’s, Resolve as a DN automatically fails.",
    "flavor": "",
    "source": "apocrypha",
    "page": 252
  },
  {
    "id": "statue_still",
    "name": "Statue Still",
    "cost": 10,
    "prerequisites": {
      "skills": {
        "stealth": 2
      }
    },
    "effect": "You gain +Rank to your Stealth Score whenever you are perfectly still. You lose this benefit when moving silently. While using this ability, you can only whisper or use vox, potentially allowing you to Help allies. As soon as you undertake any other action, the bonus is subtracted from your Stealth Score and can't be restored until you generate a new Stealth Score.",
    "flavor": "You have trained to control your biology, slowing your metabolism and remain perfectly motionless, to better blend in with your background.",
    "source": "redacted2",
    "page": 67
  },
  {
    "id": "stoic",
    "name": "Stoic",
    "cost": 20,
    "prerequisites": {},
    "effect": "You impose a +Double Rank DN penalty on any Insight Tests made against you.",
    "flavor": "Either through a quirk of biology, surgical intervention, or traumatic injury, your face no longer betrays emotion like a normal member of your Species.",
    "source": "core",
    "page": 140
  },
  {
    "id": "storm_of_death",
    "name": "Storm of Death",
    "cost": 30,
    "prerequisites": {
      "skills": {
        "weaponSkill": 4
      }
    },
    "effect": "When the only combat option you take in your turn is a Multi-Attack, the DN penalty is decreased by –Double Rank. Your turn ends after you complete your Multi-Attack.",
    "flavor": "You make a flurry of attacks in combat.",
    "source": "core",
    "page": 140
  },
  {
    "id": "storm_of_fire_aoa",
    "name": "Storm of Fire (Abundance of Apocrypha)",
    "cost": 20,
    "prerequisites": {
      "keywords": [
        "T'AU EMPIRE",
        "ETHEREAL CASTE",
        "PRIEST"
      ],
      "other": "Invocations of the Ethereals"
    },
    "effect": "If this Prayer is successful, then while the Prayer remains in effect, a single group of allied T’au numbering no more than your Willpower score, within 12m of you may ignore up to Rank DN penalties when taking a Multi-Action.",
    "flavor": "The steady gaze of the Ethereal reminds those of the Fire Caste that there lies within the heart of every storm a zone of silence that remains serene even as fury rages all about it. So inspired, they apply themselves to their assigned tasks with hard-eyed calm even as they continue to hammer the foe with unrelenting firepower.",
    "source": "apocrypha",
    "page": 181
  },
  {
    "id": "strength_from_steel",
    "name": "Strength from Steel",
    "cost": 20,
    "prerequisites": {
      "attributes": {
        "toughness": 5
      },
      "keywords": [
        "ADEPTUS ASTARTES",
        "IRON HANDS"
      ],
      "other": "Three or more augmetics"
    },
    "effect": "Once per session, you may ignore a source of damage that would inflict Wounds equal to or less than the number of augmetics you have installed.",
    "flavor": "You are aware of the frailties and weaknesses of flesh and have learned to bolster yourself by relying instead on your blessed augmetics.",
    "source": "voa",
    "page": 50
  },
  {
    "id": "strike_and_fade_aoa",
    "name": "Strike and Fade (Abundance of Apocrypha)",
    "cost": 20,
    "prerequisites": {
      "species": [
        "aeldari",
        "drukhari"
      ]
    },
    "effect": "After making a ranged attack, whether successful or not, you may spend one Glory to move up to your Speed.",
    "flavor": "You fight in an elusive manner, withdrawing from battle mere moments after striking with full force, then rallying to strike once more.",
    "source": "apocrypha",
    "page": 83
  },
  {
    "id": "strike_from_the_shadows_aoa",
    "name": "Strike from The Shadows (Abundance of Apocrypha)",
    "cost": 20,
    "prerequisites": {
      "keywords": [
        "RAVEN GUARD"
      ]
    },
    "effect": "When you attack an enemy unaware of your presence, or make an attack during an ambush, your target becomes Vulnerable with a rating equal to your Rank. Sudden Shot",
    "flavor": "The Sons of Corax emerge from the shadows and fall upon their prey in a swift, deadly strike that leaves the enemy dead before they can respond.",
    "source": "apocrypha",
    "page": 244
  },
  {
    "id": "sudden_shot_aoa",
    "name": "Sudden Shot (Abundance of Apocrypha)",
    "cost": 30,
    "prerequisites": {
      "skills": {
        "ballisticSkill": 2,
        "stealth": 2
      }
    },
    "effect": "When you make a ranged attack against an unaware enemy, the target, and all enemies within 5 metres of the target, must pass a Resolve test with a DN equal to your Stealth score or be Pinned. Suffer Not The Unclean to Live [Vow]",
    "flavor": "You know that there is no shot quite as effective as the unexpected one.",
    "source": "apocrypha",
    "page": 244
  },
  {
    "id": "suffer_not_the_unclean_to_live_vow_aoa",
    "name": "Suffer Not The Unclean to Live [Vow] (Abundance of Apocrypha)",
    "cost": 20,
    "prerequisites": {
      "keywords": [
        "BLACK TEMPLARS"
      ]
    },
    "effect": "When you score a Wrath critical on a melee attack against an enemy (other than a vehicle), increase the severity of that critical as if you had spent a number of points of Glory equal to your Rank. However, if you can Charge an enemy when you begin your turn, you must do so. You may only have one Vow talent. During downtime, you may replace this talent with any other BLACK TEMPLARS talent marked as a Vow. Supporting Fire",
    "flavor": "You will not persist an enemy of Mankind to exist in your sight.",
    "source": "apocrypha",
    "page": 244
  },
  {
    "id": "supplicant",
    "name": "Supplicant",
    "cost": 20,
    "prerequisites": {
      "species": [
        "human"
      ]
    },
    "effect": "You gain +Rank bonus dice whenever you are appealing to one of your social betters, such as a planetary governor or a superior officer. If your behaviour in any way deviates from the accepted social norms of the Imperium, your GM may refuse this bonus.",
    "flavor": "You know your place and how to work Imperial feudalism to your advantage.",
    "source": "core",
    "page": 90
  },
  {
    "id": "supporting_fire_aoa",
    "name": "Supporting Fire (Abundance of Apocrypha)",
    "cost": 20,
    "prerequisites": {
      "keywords": [
        "FIRE CASTE"
      ]
    },
    "effect": "When an enemy uses the Charge action to charge an ally you can see within 12m of you, you may spend 1 ammo to make a ranged attack as a Reflexive action. This ranged attack is resolved before their Charge action is completed, and the enemy’s Defence is increased by +2. This is considered a Salvo attack, and thus the weapon must be reloaded after the attack.",
    "flavor": "You are always ready to deliver punishing fire against those who stray too close to your allies.",
    "source": "apocrypha",
    "page": 80
  },
  {
    "id": "suppressing_fusillade_aoa",
    "name": "Suppressing Fusillade (Abundance of Apocrypha)",
    "cost": 30,
    "prerequisites": {
      "keywords": [
        "ASPECT WARRIOR"
      ]
    },
    "effect": "Your volleys are a staccato torrent of fire, carefully timed and aimed to disorient and demoralise. When you spend ammo to make a Suppressive Fire attack, you score one automatic Exalted Icon. Further, if a target becomes Pinned as a result of this attack, they also become Staggered while they’re pinned.",
    "flavor": "",
    "source": "apocrypha",
    "page": 252
  },
  {
    "id": "supreme_presence",
    "name": "Supreme Presence [Skill]",
    "cost": 30,
    "prerequisites": {
      "other": "Skill Rating 4+ in: Athletics, Deception, Intimidation, Persuasion, or Tech"
    },
    "effect": "When you take this Talent, you must select one of the Skills listed in the Requirements. When you make an Interaction Attack with the chosen Skill, you may select either 1 + Double Rank targets or a Mob of any number of Troops. The DN for the Interaction Attack does not increase.",
    "flavor": "The weight of your presence demands attention, even from large groups of individuals.",
    "requiresChoice": true,
    "choiceType": "skill",
    "choiceOptions": [
      "Athletics",
      "Deception",
      "Intimidation",
      "Persuasion",
      "Tech"
    ],
    "choiceLabel": "Interaction Skill",
    "choiceDescription": "Choose which skill this talent applies to (must have 4+ rating)",
    "source": "core",
    "page": 140
  },
  {
    "id": "surprise_assault_aoa",
    "name": "Surprise Assault (Abundance of Apocrypha)",
    "cost": 40,
    "prerequisites": {
      "keywords": [
        "ASPECT WARRIOR"
      ],
      "other": "Warp Spider aspect, Stealth rating 4+"
    },
    "effect": "You are a master of capitalising on the ignorance of your foes. The first time in a scene that you, or a member of your squad, attacks an unaware enemy, you may re-roll any failures on that attack.",
    "flavor": "",
    "source": "apocrypha",
    "page": 252
  },
  {
    "id": "survivalist",
    "name": "Survivalist",
    "cost": 10,
    "prerequisites": {
      "skills": {
        "survival": 3
      }
    },
    "effect": "You gain +Rank to your Passive Awareness when detecting the presence of creatures with the BEAST Keyword. You can survive by eating practically anything, and never have to worry about suffering starvation while in the wilderness. You never lose your sense of direction, unless afflicted by mind-altering effects such as Psychic Powers. You always know how to find the nearest shelter to protect yourself from environmental hazards. While you can easily fend for yourself this way, you must take Survival (Wil) Tests to find food and shelter for other Agents less proficient in wilderness survival.",
    "flavor": "Whether metaphorically or literally, you are at home in nature.",
    "source": "redacted2",
    "page": 67
  },
  {
    "id": "sustained_assault_aoa",
    "name": "Sustained Assault (Abundance of Apocrypha)",
    "cost": 25,
    "prerequisites": {
      "keywords": [
        "ASPECT WARRIOR"
      ],
      "other": "Striking Scorpion aspect, Weapon Skill rating 6+"
    },
    "effect": "You are unrelenting, landing blow after ferocious blow upon your foes. When you succeed at a melee attack and score a critical hit, you may choose to make a second attack instead of inflicting a critical hit. This second attack cannot generate further attacks.",
    "flavor": "",
    "source": "apocrypha",
    "page": 252
  },
  {
    "id": "swift_attack",
    "name": "Swift Attack",
    "cost": 30,
    "prerequisites": {
      "skills": {
        "weaponSkill": 4
      }
    },
    "effect": "[AI-Generated] When making a Multi-Attack with melee weapons, you may make one additional attack.",
    "flavor": "[AI-Generated] Your blade moves faster than the eye can follow, striking again and again in rapid succession.",
    "source": "core",
    "page": null
  },
  {
    "id": "swiftstep_aoa",
    "name": "Swiftstep (Abundance of Apocrypha)",
    "cost": 20,
    "prerequisites": {
      "keywords": [
        "ASPECT WARRIOR"
      ],
      "other": "Agility 7+"
    },
    "effect": "You lead your warriors across the battlefield at a tremendous pace, delivering them to battle swiftly. When you or your squad, takes the Run or Sprint action, increase your Speed by +3.",
    "flavor": "",
    "source": "apocrypha",
    "page": 252
  },
  {
    "id": "swooping_barrage_aoa",
    "name": "Swooping Barrage (Abundance of Apocrypha)",
    "cost": 20,
    "prerequisites": {
      "keywords": [
        "ASPECT WARRIOR"
      ],
      "other": "Swooping Hawk aspect"
    },
    "effect": "Your munitions are always well-placed for maximum effect. When you, or a member of your squad, makes an attack using grenades or a grenade launcher of some kind, add an automatic Exalted Icon to the attack.",
    "flavor": "",
    "source": "apocrypha",
    "page": 252
  },
  {
    "id": "swooping_dive_aoa",
    "name": "Swooping Dive (Abundance of Apocrypha)",
    "cost": 25,
    "prerequisites": {
      "keywords": [
        "ASPECT WARRIOR"
      ],
      "other": "Shining Spear aspect"
    },
    "effect": "You descend from the skies upon your shining steed, to tremendous effect. When you, or a member of your squad, moves with their jetbike with the intention of charging into melee, you increase the normal charge bonus to your melee attack to +3d, and ignore the penalty for moving at breakneck speed.",
    "flavor": "",
    "source": "apocrypha",
    "page": 252
  },
  {
    "id": "sword_of_the_emperor",
    "name": "Sword of the Emperor",
    "cost": 20,
    "prerequisites": {
      "keywords": [
        "ADEPTUS ASTARTES"
      ],
      "talents": [
        "orthopraxy"
      ]
    },
    "effect": "Whether reciting words only you can hear or announcing your faith in a deafening bellow, your words ring in the ears of an ally, upon them your blessing bestows them the vigour of the Emperor and His fiery wrath. A single affected target with the Astartes Keyword, within 20m, inflicts with their next melee attack, if it hits, a number of Mortal Wounds equal to your Rank. By spending a further point of Faith the effect of this Litany is sustained for a further round.",
    "flavor": "[AI-Generated] Your prayers make a brother's blade burn with righteous fury, cutting through armor as if it were nothing.",
    "isLitany": true,
    "source": "voa",
    "page": 58
  },
  {
    "id": "take_cover_aoa",
    "name": "Take Cover! (Abundance of Apocrypha)",
    "cost": 20,
    "prerequisites": {
      "keywords": [
        "ASTRA MILITARUM"
      ]
    },
    "effect": "If you mean to survive to fight another day, it helps to put something between you and the enemy. When you are targeted by a ranged attack while in cover, you may take cover as a Reflexive action to increase your Defence by +Rank until the start of your next turn. If you do so, you may not move during your next turn. Tears of Isha",
    "flavor": "",
    "source": "apocrypha",
    "page": 244
  },
  {
    "id": "talissera_bonding_aoa",
    "name": "Ta’lissera Bonding (Abundance of Apocrypha)",
    "cost": 10,
    "prerequisites": {
      "species": [
        "au"
      ]
    },
    "effect": "When you attempt a Resolve or Conviction Test, if you roll a 6 on your Wrath die, the test is automatically successful, regardless of any other factors.",
    "flavor": "You undertook the Ta'lissera rite, bonding you with your teammates in the ultimate expression of unity and respect. That bond is unbreakable.",
    "source": "apocrypha",
    "page": 80
  },
  {
    "id": "tank_killer_aoa",
    "name": "Tank Killer (Abundance of Apocrypha)",
    "cost": 25,
    "prerequisites": {
      "keywords": [
        "ASPECT WARRIOR"
      ],
      "other": "Fire Dragon aspect"
    },
    "effect": "You have an eye for the flaws in armoured targets and can fine-tune the use of your weapons to exploit these flaws easily. When you make an attack with a Firepike or similar weapon, the weapon gains the Sniper (2) trait. If the weapon had the Blast (X) and/or Spread traits, it loses them while it benefits from this ability.",
    "flavor": "",
    "source": "apocrypha",
    "page": 252
  },
  {
    "id": "tears_of_isha_aoa",
    "name": "Tears of Isha (Abundance of Apocrypha)",
    "cost": 40,
    "prerequisites": {
      "species": [
        "ghost warrior"
      ]
    },
    "effect": "When you roll Determination, you heal 1 Wound for each Icon rolled beyond those needed to negate an attack’s damage. That is, if you took 6 damage, and rolled 8 Icons, you would heal 2 Wounds. Tormented Manifestation",
    "flavor": "Legend says that the first spirit stones were the tears wept by the mother-goddess Isha, cast to the material world that she might protect her children.",
    "source": "apocrypha",
    "page": 244
  },
  {
    "id": "techno_animist",
    "name": "Techno-animist",
    "cost": 10,
    "prerequisites": {
      "skills": {
        "tech": 3
      },
      "keywords": [
        "ADEPTUS MECHANICUS"
      ]
    },
    "effect": "You can use Tech (Int) instead of Medicae (Int) to remove Wounds, Shock, and Conditions from targets with the ADEPTUS MECHANICUS Keyword (Wrath & Glory Rulebook, page 124).",
    "flavor": "Your skill in repairing augmetics and cyber-implants can restore servitors and the techno-faithful to functionality.",
    "source": "redacted2",
    "page": 71
  },
  {
    "id": "telecryptographer",
    "name": "Telecryptographer",
    "cost": 10,
    "prerequisites": {
      "skills": {
        "scholar": 2,
        "tech": 2
      }
    },
    "effect": "You gain +Double Rank bonus dice on Tests to jam, intercept or decode enemy vox traffic (or the equivalent). If any of your allies are equipped with a vox unit, you can spend a Respite to encrypt their communications to prevent unauthorised access. Enemies can only intercept the vox traffic by succeeding in an Opposed Tech (Int) Test against you, and you gain +Double Rank bonus dice on that Test.",
    "flavor": "You are a student of informational warfare, as fluent at intercepting enemy communications as guarding your own.",
    "source": "redacted2",
    "page": 67
  },
  {
    "id": "tempest_of_blades_aoa",
    "name": "Tempest of Blades (Abundance of Apocrypha)",
    "cost": 30,
    "prerequisites": {
      "keywords": [
        "ASPECT WARRIOR"
      ],
      "other": "Dire Avenger, Ballistic Skill rating 6+"
    },
    "effect": "Little can withstand the tempest of blades that issues forth from shuriken weapons under your command. When you or any member of you squad, scores a critical when making a ranged attack with a weapon with the SHURIKEN keyword, they may choose to make a second attack with that weapon instead of inflicting a critical hit. These additional attacks may not generate extra attacks of their own.",
    "flavor": "",
    "source": "apocrypha",
    "page": 252
  },
  {
    "id": "tenacious",
    "name": "Tenacious",
    "cost": 30,
    "prerequisites": {},
    "effect": "You recover 1 Shock for every Exalted Icon you roll when you roll Determination (p.196).",
    "flavor": "You have an uncanny knack for mental perseverance.",
    "source": "core",
    "page": 140
  },
  {
    "id": "the_flesh_is_weak",
    "name": "The Flesh is Weak",
    "cost": 30,
    "prerequisites": {},
    "effect": "You no longer need to breathe and you do not bleed. As a result, you aren't affected by Bleeding (p.199) or Suffocation (p.201). You gain +Rank bonus dice to Tech (Int) Tests and Determination rolls. You suffer +2DN to Persuasion (Fel) Tests. When you take this Talent, you may heal any Memorable or Traumatic Injuries (p.194-195).",
    "flavor": "Almost all of your biology has been replaced with augmetic components. You may have taken this procedure to repair a gruesome injury, or as a personal expression of faith. The replacements are much sturdier than your former biology but have dramatically affected your appearance.",
    "source": "core",
    "page": 140
  },
  {
    "id": "the_imperiums_sword",
    "name": "The Imperium's Sword",
    "cost": 30,
    "prerequisites": {
      "skills": {
        "athletics": 3,
        "weaponSkill": 3
      },
      "keywords": [
        "ADEPTUS ASTARTES"
      ]
    },
    "effect": "You may move an additional +(Rank) metres when you charge. In addition, the attack you make as part of a Charge gains +1 ED, or +2 ED when attacking a Mob.",
    "flavor": "Always first to the fray, you hurl yourself into combat like a whirlwind of vengeance.",
    "source": "voa",
    "page": 47
  },
  {
    "id": "tormented_manifestation_aoa",
    "name": "Tormented Manifestation (Abundance of Apocrypha)",
    "cost": 5,
    "prerequisites": {
      "keywords": [
        "PSYKER"
      ],
      "species": [
        "human"
      ]
    },
    "effect": "Select a single psychic discipline. You may purchase powers from that discipline at half their normal cost, rounded up. Whenever you attempt to use a psychic power from that discipline, you suffer Shock equal to the power’s DN. You may reduce the Shock suffered by twice your Rank but suffer one of the following conditions instead: Bleeding, Blinded, Fear, On Fire, Poisoned (3), Staggered. Transhuman Physiology",
    "flavor": "Your powers are a curse, resulting in continual agony.",
    "source": "apocrypha",
    "page": 245
  },
  {
    "id": "touched_by_fate",
    "name": "Touched By Fate",
    "cost": 20,
    "prerequisites": {},
    "effect": "You begin each session with an additional +Rank Wrath Points.",
    "flavor": "Your luck carries you through, even when Wargear or faith might falter.",
    "source": "core",
    "page": 140
  },
  {
    "id": "trademark_weapon",
    "name": "Trademark Weapon",
    "cost": 30,
    "prerequisites": {},
    "effect": "Choose one of your weapons to become a Trademark Weapon. This Talent only affects that weapon, and no others of its type (for example, a single modified Chainsword, not all Chainswords). Whenever you make a successful attack with your Trademark Weapon, you deal +Double Rank additional ED. If you lose or destroy your Trademark Weapon, you can no longer receive any benefits from this Talent. Work with the GM to decide if an appropriate replacement can be found; this could be the focus of an entire adventure.",
    "flavor": "You have trained extensively with a single weapon that you keep on your person at all times. It has almost become an extension of your body.",
    "requiresChoice": true,
    "choiceType": "weapon_owned",
    "choiceLabel": "Trademark Weapon",
    "choiceDescription": "Choose one of your weapons to become your Trademark Weapon",
    "source": "core",
    "page": 141
  },
  {
    "id": "transhuman",
    "name": "Transhuman [Attribute]",
    "cost": 60,
    "prerequisites": {
      "other": "[Attribute] Rating 5+"
    },
    "effect": "When you take this Talent, you must select one of your Attributes with a rating of 5 or higher. This Talent applies to that Attribute. Whenever you make a Test using the selected Attribute, you gain +Double Rank bonus dice.",
    "flavor": "",
    "requiresChoice": true,
    "choiceType": "attribute",
    "choiceOptions": [
      "Strength",
      "Toughness",
      "Agility",
      "Initiative",
      "Willpower",
      "Intellect",
      "Fellowship"
    ],
    "choiceLabel": "Attribute",
    "choiceDescription": "Choose an attribute with rating 5+ to enhance",
    "source": "core",
    "page": 141
  },
  {
    "id": "transhuman_physiology",
    "name": "Transhuman Physiology",
    "cost": 40,
    "prerequisites": {
      "attributes": {
        "toughness": 6
      },
      "keywords": [
        "ADEPTUS ASTARTES"
      ]
    },
    "effect": "When an attack deals less than (Rank) Wounds to you, you may immediately choose to convert them to Shock as if you had automatically received (Rank) Icons while rolling Determination. In addition, when converting Wounds to Shock through this method or with standard Determination rolls, you receive one less Shock per instance of conversion, to a minimum of 1.",
    "flavor": "Your constitution is such that no blade, bolt, or other weapon can keep you down for long.",
    "source": "voa",
    "page": 27
  },
  {
    "id": "transhuman_physiology_aoa",
    "name": "Transhuman Physiology (Abundance of Apocrypha)",
    "cost": 20,
    "prerequisites": {
      "species": [
        "primaris"
      ]
    },
    "effect": "When you are the target of an attack, you may spend 1 Wrath. Your Resilience is increased to be equal to the Base Damage of the attacking weapon. This is done before the effects of AP are applied. Unparalleled Mastery",
    "flavor": "Your enhanced form can withstand injuries that would slay even Firstborn Astartes.",
    "source": "apocrypha",
    "page": 245
  },
  {
    "id": "trapmaster",
    "name": "Trapmaster",
    "cost": 10,
    "prerequisites": {
      "skills": {
        "survival": 3
      }
    },
    "effect": "During a Regroup, you can Test Survival (Wil) to set a trap around your current location instead of removing Wounds. The DN is usually 3, but may increase depending on the availability of tools and materials. Success constructs a single trap. When you engage in combat around this location, you may use a Reflexive Action when an enemy moves to reveal that they have stumbled into your trap. On a successful DN 3 Survival (Wil) or Tech (Int) attack Test, the trap is activated, and inflicts damage per the profile below. If targeting a Mob, additional Icons hit additional Troops as normal. A trap can only be activated once. Trap Profile: Damage 7, ED 2, AP -, Traits: Blast (6), Brutal, Inflict (Prone). Shifts on the Test to create the trap can be spent to: Increase the ED by +Rank. Incorporate a grenade you already have into the trap, replacing the weapon profile above with the profile of the grenade (ignoring Range). Add one of the following Traits: Inflict (Bleeding), Inflict (Blinded), Inflict (On Fire), Inflict (Poisoned 3), Inflict (Restrained), Silent. This option may be chosen more than once, selecting a different Trait each time. Providing detail about the trap you craft may affect what Keywords it has, and possibly expand the range of available Traits you can spend Shifts on.",
    "flavor": "When you have time to prepare for combat you can transform the battlefield into a deathtrap.",
    "source": "redacted2",
    "page": 66
  },
  {
    "id": "trip_attack",
    "name": "Trip Attack",
    "cost": 10,
    "prerequisites": {
      "skills": {
        "athletics": 2
      }
    },
    "effect": "When you succeed on an Interaction Attack using Athletics (Wrath & Glory Rulebook, page 190), your enemy gains the Prone Condition, in addition to other effects. Prone enemies Engaged with you can only remove the Condition on their turn by spending a Combat Action. Allies may still help them stand with a Simple Action.",
    "flavor": "You employ throws and leg sweeps to keep your enemy on the ground and at your mercy.",
    "source": "redacted2",
    "page": 67
  },
  {
    "id": "trueborn",
    "name": "Trueborn",
    "cost": 10,
    "prerequisites": {
      "keywords": [
        "DRUKHARI"
      ]
    },
    "effect": "Any DRUKHARI weapon you requisition is delivered with its first weapon upgrade installed. You may choose any available weapon upgrades, so long as the Value and Rarity of the upgrade is not greater than the weapon's Value or Rarity.",
    "flavor": "You were born through conventional biological means, rather than from the birthing vats of the Haemonculi. This is considered a mark of prestige among the denizens of Commorragh. You have learned to leverage this birthright to obtain the very best weaponry.",
    "source": "aeldari",
    "page": 62
  },
  {
    "id": "turn_aside_blow_aoa",
    "name": "Turn Aside Blow (Abundance of Apocrypha)",
    "cost": 20,
    "prerequisites": {
      "keywords": [
        "ASPECT WARRIOR"
      ],
      "other": "Weapon Skill 6+"
    },
    "effect": "You are a master of parrying and deflecting incoming attacks and has even modified their armour to include additional parrying surfaces on their hands and forearms. When you use Full Defence against melee attacks, you may make a Weapon Skill test instead of simply rolling Initiative.",
    "flavor": "",
    "source": "apocrypha",
    "page": 253
  },
  {
    "id": "twin_focus",
    "name": "Twin Focus",
    "cost": 20,
    "prerequisites": {
      "skills": {
        "psychicMastery": 4
      }
    },
    "effect": "The DN penalty from sustaining multiple psychic powers is decreased by 2.",
    "flavor": "You have practiced the art of splitting your thoughts, allowing you to more effectively focus on manipulating the Warp in two ways at once.",
    "source": "core",
    "page": 141
  },
  {
    "id": "unbreakable_guard",
    "name": "Unbreakable Guard",
    "cost": 10,
    "prerequisites": {},
    "effect": "When you benefit from a Full Defence (Wrath & Glory Rulebook, page 187), your Defence is further increased by +Rank.",
    "flavor": "Whether stalling for time, acting as a distraction, or blocking an enemy advance, you are almost untouchable when dedicated to defence.",
    "source": "redacted2",
    "page": 68
  },
  {
    "id": "uncanny",
    "name": "Uncanny [Trait]",
    "cost": 40,
    "prerequisites": {},
    "effect": "Increase one of these Traits by +Rank: Conviction, Defence, Resilience, Resolve, Shock, Determination, Speed, or Wounds.",
    "flavor": "",
    "requiresChoice": true,
    "choiceType": "trait",
    "choiceOptions": [
      "Conviction",
      "Defence",
      "Resilience",
      "Resolve",
      "Shock",
      "Determination",
      "Speed",
      "Wounds"
    ],
    "choiceLabel": "Trait",
    "choiceDescription": "Choose which trait to increase by +Rank",
    "source": "core",
    "page": 141
  },
  {
    "id": "uncompromising_fire",
    "name": "Uncompromising Fire",
    "cost": 20,
    "prerequisites": {
      "attributes": {
        "initiative": 5
      },
      "keywords": [
        "ADEPTUS ASTARTES"
      ]
    },
    "effect": "On your turn in combat, you may complete an additional Simple Action that does not involve significant physical motion, such as making an Awareness (Int) Test to spot a hidden enemy or giving orders with Leadership (Wil), but not reloading a weapon or kicking down a barricade. This restriction only applies to the bonus Simple Action gained from this Talent.",
    "flavor": "Combat is so routine to you that it has receded to a reflexive level, freeing your conscious mind to perform other tasks.",
    "source": "voa",
    "page": 50
  },
  {
    "id": "unifying_mantra_aoa",
    "name": "Unifying Mantra (Abundance of Apocrypha)",
    "cost": 20,
    "prerequisites": {
      "keywords": [
        "T'AU EMPIRE",
        "ETHEREAL CASTE",
        "PRIEST"
      ],
      "other": "Invocations of the Ethereals"
    },
    "effect": "If this Prayer is successful, then while the Prayer remains in effect, a single group allied T’au numbering no more than your Willpower score, may add +Rank to their Resolve and Conviction.",
    "flavor": "With simple eloquence does the chanting of the Ethereal remind their comrades of their place within the Greater Good, and of how those of all castes are stronger when they stand shoulder to shoulder against adversity than when they strive alone.",
    "source": "apocrypha",
    "page": 258
  },
  {
    "id": "unnatural",
    "name": "Unnatural [Skill]",
    "cost": 60,
    "prerequisites": {
      "other": "[Skill] Rating 4+"
    },
    "effect": "Choose any Skill with a rating of 4+. When making a Test with the selected Skill, reduce any DN modifiers by –Double Rank, to a minimum of 0. This does not change the task's base difficulty, just any modifiers. Examples include attempting a Test without appropriate tools, in complete darkness, or a specific combat option.",
    "flavor": "",
    "requiresChoice": true,
    "choiceType": "skill_any",
    "choiceLabel": "Skill",
    "choiceDescription": "Choose a skill with rating 4+ to enhance",
    "source": "core",
    "page": 141
  },
  {
    "id": "unparalleled_mastery_aoa",
    "name": "Unparalleled Mastery (Abundance of Apocrypha)",
    "cost": 30,
    "prerequisites": {
      "skills": {
        "psychicMastery": 5
      },
      "keywords": [
        "PSYKER"
      ],
      "species": [
        "aeldari"
      ]
    },
    "effect": "You may attempt to use multiple psychic powers in a single turn, as part of a Multi-Action. You may use no more than 1+Rank psychic powers in one turn. Uphold the Honour of the Emperor [Vow]",
    "flavor": "The incredible discipline of the Aeldari makes them amongst the most formidable psykers in the galaxy.",
    "source": "apocrypha",
    "page": 245
  },
  {
    "id": "unremarkable",
    "name": "Unremarkable",
    "cost": 20,
    "prerequisites": {
      "keywords": [
        "IMPERIUM"
      ]
    },
    "effect": "Characters of a higher social class with the IMPERIUM keyword, such as planetary governors, Imperial nobility, or manufactorum owners, ignore you completely unless you attract undue attention to yourself. Anyone attempting to notice or track you in a crowded area, or trying to remember your face, suffers +2DN.",
    "flavor": "You are forgettable and blend into crowds easily.",
    "source": "core",
    "page": 96
  },
  {
    "id": "unshakable_vengeance",
    "name": "Unshakable Vengeance",
    "cost": 20,
    "prerequisites": {
      "keywords": [
        "ADEPTA SORORITAS"
      ]
    },
    "effect": "You gain +1 Faith. Whenever you suffer one or more Wounds, you may spend 1 Faith as a Reflexive Action to immediately make a Bolter attack against the target that dealt you damage, and may reroll all dice that do not result in Icons on the attack Tests as though you had spent a point of Wrath.",
    "flavor": "You wield the sacred Bolter as a beneficent gift from the Emperor Himself, your faith a conduit for His revenge against the enemies of the glorious Imperium.",
    "isFaithTalent": true,
    "source": "redacted2",
    "page": 70
  },
  {
    "id": "uphold_the_honour_of_the_emperor_vow_aoa",
    "name": "Uphold the Honour of the Emperor [Vow] (Abundance of Apocrypha)",
    "cost": 20,
    "prerequisites": {
      "keywords": [
        "BLACK TEMPLARS"
      ]
    },
    "effect": "You increase your Resilience by +Rank. However, you cannot gain the benefits of cover at any time. You may only have one Vow talent. During downtime, you may replace this talent with any other BLACK TEMPLARS talent marked as a [VOW]. Victor of the Blood Games",
    "flavor": "You will not fall while a single enemy draws breath.",
    "source": "apocrypha",
    "page": 245
  },
  {
    "id": "verse_of_holy_piety",
    "name": "Verse of Holy Piety",
    "cost": 10,
    "prerequisites": {
      "keywords": [
        "ADEPTA SORORITAS"
      ]
    },
    "effect": "You gain +1 Faith. As a Simple Action you may spend 1 Faith to utter the verse of holy piety. Any character with the IMPERIUM Keyword hearing the verse automatically fails any Fellowship (Deception) Tests and suffers Shock damage equal to double your Rank.",
    "flavor": "You intone a verse that seems to imbue the air itself with a measure of the Emperor's righteous presence, forcing the faithful to speak truthfully.",
    "isFaithTalent": true,
    "source": "redacted2",
    "page": 70
  },
  {
    "id": "victor_of_the_blood_games_aoa",
    "name": "Victor of the Blood Games (Abundance of Apocrypha)",
    "cost": 30,
    "prerequisites": {
      "species": [
        "custodian"
      ]
    },
    "effect": "What foe could best a warrior who has pierced the defences of Holy Terra itself? Each turn in combat, you may add one bonus die to a Test, add +1 to the damage value of an attack, or increase the severity of a Critical Hit as if you had spent a point of Glory. War Hymns",
    "flavor": "",
    "source": "apocrypha",
    "page": 245
  },
  {
    "id": "wall_of_fire_aoa",
    "name": "Wall of Fire (Abundance of Apocrypha)",
    "cost": 25,
    "prerequisites": {
      "keywords": [
        "ASPECT WARRIOR"
      ],
      "other": "Fire Dragon aspect"
    },
    "effect": "You leave flaming ruin in your foes’ path, hindering their attempts to get close. When you are armed with a Dragon’s Breath Flamer or other FIRE weapon, you may spend 1 Glory as a Reflexive Action when an enemy declares a charge to create a momentary wall of flame within 8m, which is up to 5m wide. Any enemy who moves through this wall of flame immediately suffers 1d3+1 Mortal Wounds and gains the On Fire condition.",
    "flavor": "",
    "source": "apocrypha",
    "page": 253
  },
  {
    "id": "war_hymn_aoa",
    "name": "War Hymn (Abundance of Apocrypha)",
    "cost": 20,
    "prerequisites": {
      "keywords": [
        "ADEPTUS MINISTORUM",
        "IMPERIUM",
        "PRIEST"
      ],
      "other": "Hymns of Battle"
    },
    "effect": "If this Prayer is successful, you and all allies with the IMPERIUM keyword within 12m of you may re-roll up to Double Rank dice on melee attacks while the Prayer remains in effect.",
    "flavor": "Suffer not the enemies of Mankind to live. Smite them down with all your strength and fury.",
    "source": "apocrypha",
    "page": 103
  },
  {
    "id": "war_hymns_aoa",
    "name": "War Hymns (Abundance of Apocrypha)",
    "cost": 20,
    "prerequisites": {
      "keywords": [
        "ADEPTUS MINISTORUM"
      ]
    },
    "effect": "You may sing war hymns as a simple action, and all allies with the IMPERIUM keyword within 15+Rank metres gain +Rank bonus dice on all melee attacks until the start of your next turn.",
    "flavor": "Your voice is heard above the clamour and clangour of battle, rallying the servants of the Emperor to greater heights of piety and fury.",
    "source": "apocrypha",
    "page": 103
  },
  {
    "id": "war_shout_aoa",
    "name": "War Shout (Abundance of Apocrypha)",
    "cost": 40,
    "prerequisites": {
      "keywords": [
        "ASPECT WARRIOR"
      ],
      "other": "Howling Banshee aspect"
    },
    "effect": "Your war-cry leaves enemies shocked and scarcely able to retaliate. When you, or a member of your squad, charges using a Banshee Mask, enemies charged suffer the Hindered (4) condition, rather than Hindered (2).",
    "flavor": "",
    "source": "apocrypha",
    "page": 253
  },
  {
    "id": "warden_of_souls",
    "name": "Warden of Souls",
    "cost": 10,
    "prerequisites": {
      "attributes": {
        "willpower": 4
      },
      "keywords": [
        "YNNARI"
      ]
    },
    "effect": "During combat, you may call upon the spirits to heal you as a Combat Action. If you succeed on a DN 1 Resolve Test, you regain Rank Wounds, plus additional Wounds equal to the number of Shifted Exalted Icons.",
    "flavor": "You are chosen by Ynnead to safeguard the spirits of many departed Aeldari. In return, those souls watch over you in times of need, infusing you with strength to avoid joining their number.",
    "source": "aeldari",
    "page": 62
  },
  {
    "id": "warped_mind",
    "name": "Warped Mind",
    "cost": 30,
    "prerequisites": {
      "skills": {
        "psychicMastery": 4
      }
    },
    "repeatable": true,
    "requiresChoice": true,
    "choiceType": "discipline_unlock",
    "choiceDescription": "Choose a psychic discipline to unlock:",
    "effect": "You may learn psychic powers from an additional psychic discipline. You may choose to take Corruption to reduce the XP cost of this Talent. For every point of Corruption you take, reduce the XP cost by 5.",
    "flavor": "You have opened your mind to access another psychic discipline, either through intense discipline and study or traumatic exposure to the Warp.",
    "source": "core",
    "page": 141
  },
  {
    "id": "warpsight_plea_aoa",
    "name": "Warp-sight Plea (Abundance of Apocrypha)",
    "cost": 20,
    "prerequisites": {
      "keywords": [
        "CHAOS",
        "PRIEST"
      ],
      "other": "Prayers to the Dark Gods"
    },
    "effect": "If this Prayer is successful, then while the Prayer remains in effect, you and all allies with the CHAOS keyword within 12m add +Rank bonus dice to ranged attacks.",
    "flavor": "You entreat your dark masters to guide your followers’ aim, granting their shots unerring accuracy.",
    "source": "apocrypha",
    "page": 257
  },
  {
    "id": "warsage_aoa",
    "name": "War-Sage (Abundance of Apocrypha)",
    "cost": 10,
    "prerequisites": {
      "keywords": [
        "PSYKER"
      ],
      "species": [
        "adeptus astartes",
        "primaris astartes"
      ]
    },
    "effect": "You can direct that power to bolster your prowess. You may ignore the DN increase for sustaining a Psychic Power as long as you are sustaining only one power, and that power affects only you. Whispering Spirits",
    "flavor": "Your psychic might has been honed into a weapon deadlier than any blade or gun.",
    "source": "apocrypha",
    "page": 245
  },
  {
    "id": "web_of_deceit_aoa",
    "name": "Web of Deceit (Abundance of Apocrypha)",
    "cost": 40,
    "prerequisites": {
      "keywords": [
        "ASPECT WARRIOR"
      ],
      "other": "Warp Spider aspect"
    },
    "effect": "You know hidden paths through the Warp and Webway and can lead your students to places where your skills are most necessary. Once per scene, you may perform a warp jump by spending a point of Wrath and taking a Full Action. You and your squad immediately vanish from the battlefield, reappearing anywhere within 500 metres, though you may not reappear within 10m of an enemy.",
    "flavor": "",
    "source": "apocrypha",
    "page": 253
  },
  {
    "id": "whatever_the_cost",
    "name": "Whatever The Cost",
    "cost": 10,
    "prerequisites": {},
    "effect": "You gain 2 Icons for every point of Wealth you spend on Requisition Tests, instead of the usual 1. However, if you roll a Complication on a Requisition Test you lose 2 Wealth instead of the usual 1.",
    "flavor": "You don't hesitate to pay whatever it takes to get what you want, an uncommon generosity that endears you to your suppliers.",
    "source": "redacted2",
    "page": 68
  },
  {
    "id": "whirling_blades_aoa",
    "name": "Whirling Blades (Abundance of Apocrypha)",
    "cost": 30,
    "prerequisites": {
      "keywords": [
        "ASPECT WARRIOR"
      ],
      "other": "Howling Banshee aspect"
    },
    "effect": "You are a razor-edged whirlwind in battle, slicing apart any foe who steps within reach. If you are wielding a pair of Mirrorswords or other Paired weapon, you may ignore up to 4 points of DN penalty when making a multi-attack in melee. Further, when making a multi- action in melee, you may make up to three melee attacks with their Mirrorswords, each as separate actions within a multi-action.",
    "flavor": "",
    "source": "apocrypha",
    "page": 253
  },
  {
    "id": "whirlwind_of_rage",
    "name": "Whirlwind of Rage",
    "cost": 20,
    "prerequisites": {
      "skills": {
        "athletics": 4
      },
      "keywords": [
        "ADEPTUS ASTARTES"
      ]
    },
    "effect": "When attacking as part of a Charge, you may shift up to (Rank) Exalted Icons for +2 ED each instead of the standard +1 ED.",
    "flavor": "Raw gene-enhanced muscle mass aids your brutal charges, driven by a hatred of the unclean.",
    "source": "voa",
    "page": 50
  },
  {
    "id": "whispering_spirits_aoa",
    "name": "Whispering Spirits (Abundance of Apocrypha)",
    "cost": 15,
    "prerequisites": {
      "keywords": [
        "YNNARI"
      ],
      "species": [
        "aeldari",
        "drukhari"
      ]
    },
    "effect": "Enemies within 3m of you adds +1 to the DN of Resolve tests for every two Soul tokens you possess. Witch’s Nightmare",
    "flavor": "The Ynnari are surrounded by the souls of the dead, whose sibilant whispers distract and unnerve nearby foes.",
    "source": "apocrypha",
    "page": 245
  },
  {
    "id": "white_hot_death",
    "name": "White-Hot Death",
    "cost": 10,
    "prerequisites": {},
    "effect": "When you fire a weapon using Supercharge (Wrath & Glory Rulebook, page 210) you add an additional +Rank ED.",
    "flavor": "You are one of the few daredevil warriors who has lived long enough to master plasma weaponry.",
    "source": "redacted2",
    "page": 68
  },
  {
    "id": "wild_attack",
    "name": "Wild Attack",
    "cost": 10,
    "prerequisites": {},
    "effect": "Whenever you make an All-Out Attack you gain +Rank bonus dice. Additionally, you can choose to sacrifice Shock equal to your Rank. The All-Out Attack gains +ED equal to the amount of Shock sacrificed.",
    "flavor": "What you lack in self-control and martial discipline, you make up for in sheer unpredictability.",
    "source": "redacted2",
    "page": 68
  },
  {
    "id": "wings_of_fire",
    "name": "Wings Of Fire",
    "cost": 10,
    "prerequisites": {
      "attributes": {
        "agility": 5
      }
    },
    "effect": "You fly with such confidence that jump packs are like extensions of your own body. You ignore the first Complication per scene related to moving by Jump Pack (Wrath & Glory Rulebook, page 237).",
    "flavor": "You fly with such confidence that jump packs are like extensions of your own body.",
    "source": "redacted2",
    "page": 68
  },
  {
    "id": "wisdom_of_the_guides_aoa",
    "name": "Wisdom of the Guides (Abundance of Apocrypha)",
    "cost": 20,
    "prerequisites": {
      "keywords": [
        "T'AU EMPIRE",
        "ETHEREAL CASTE",
        "PRIEST"
      ],
      "other": "Invocations of the Ethereals"
    },
    "effect": "If this Prayer is successful, then immediately add 1+Rank Glory to the Glory pool.",
    "flavor": "An unspoken sense of serene enlightenment flows through the T’au ranks. None questions its source, for all understand this is the wisdom of the Ethereals made manifest amongst them. Thus offered the calm for fresh perspective amidst the mayhem of battle, the T’au commanders swiftly glean insights into the strategic ebb and flow.",
    "source": "apocrypha",
    "page": 258
  },
  {
    "id": "wise_orator",
    "name": "Wise Orator",
    "cost": 30,
    "prerequisites": {
      "skills": {
        "leadership": 4
      },
      "keywords": [
        "ADEPTUS ASTARTES"
      ]
    },
    "effect": "You carry an air of authority and wisdom any faithful servant of the Emperor can recognise. Those who stop and listen to you are invariably impressed by insight, decreasing the DN to persuade or influence loyal Imperial citizens and soldiers when making a Leadership (Wil) Test. If using the optional NPC Attitudes rules (Wrath & Glory Core Rulebook, page 168), you can treat all Neutral NPCs as having a Helpful Attitude. In addition, your sermons carry particular weight with your Astartes brethren. When reciting a Litany of Battle (page 57), any affected targets other than yourself retain the benefits of the Litany for an additional turn after you cease to sustain the Litany. This effect stacks with any similar products from Potency.",
    "flavor": "You carry an air of authority and wisdom any faithful servant of the Emperor can recognise.",
    "source": "voa",
    "page": 50
  },
  {
    "id": "witchs_nightmare_aoa",
    "name": "Witch’s Nightmare (Abundance of Apocrypha)",
    "cost": 30,
    "prerequisites": {
      "attributes": {
        "willpower": 4
      },
      "species": [
        "pariah"
      ]
    },
    "effect": "Creatures possessing the DAEMON or PSYKER keywords must make a Terror test with a DN equal to 2+Rank when they encounter you, even if they’re normally immune to terror. As you cause terror to them, you are immune to fear, terror, or Intimidation Interaction attacks caused by DAEMONS and PSYKERS. Wonders of the Brôkhyr",
    "flavor": "Your presence is an impossible void to psykers, and they cannot bear your presence.",
    "source": "apocrypha",
    "page": 246
  },
  {
    "id": "withdraw_aoa",
    "name": "Withdraw (Abundance of Apocrypha)",
    "cost": 30,
    "prerequisites": {
      "keywords": [
        "ASPECT WARRIOR"
      ],
      "other": "Agility 6+"
    },
    "effect": "You are elusive and cannot be held in any battles but the ones they choose to fight. When you or a member of your squad moves out of Engagement with an enemy, you do not provoke Reflexive Attacks from that enemy: you are always considered to have taken the Fall Back action.",
    "flavor": "",
    "source": "apocrypha",
    "page": 249
  },
  {
    "id": "wonders_of_the_brôkhyr_aoa",
    "name": "Wonders of the Brôkhyr (Abundance of Apocrypha)",
    "cost": 20,
    "prerequisites": {
      "skills": {
        "tech": 5
      },
      "keywords": [
        "LEAGUES OF VOTANN"
      ]
    },
    "effect": "You never count technology with the IMPERIUM keyword as being foreign or unfamiliar. When you score a Wrath Critical on a Tech test to repair a device of Imperial or Votann origin, you may declare that the device now “works properly”. The GM will determine the precise extent and effect of this improvement with you.",
    "flavor": "Your forebears taught you the ways of technology better than the craft of those superstitious tech- priests.",
    "source": "apocrypha",
    "page": 246
  },
  {
    "id": "wraith_slipping",
    "name": "Wraith-Slipping",
    "cost": 10,
    "prerequisites": {
      "attributes": {
        "agility": 5
      },
      "keywords": [
        "ADEPTUS ASTARTES",
        "RAVEN GUARD"
      ]
    },
    "effect": "You may ignore penalties to Stealth (A) Tests from your size, wargear, or lack of camouflage.",
    "flavor": "In the traditions of the Raven Guard, many esoteric physical and mental exercises prepare battle-brothers for stealth operations. They are collectively known as 'wraith-slipping,' and you are versed in every single one.",
    "source": "voa",
    "page": 50
  },
  {
    "id": "wrathful_entreaty_aoa",
    "name": "Wrathful Entreaty (Abundance of Apocrypha)",
    "cost": 20,
    "prerequisites": {
      "keywords": [
        "CHAOS",
        "PRIEST",
        "KHORNE"
      ],
      "other": "Prayers to the Dark Gods"
    },
    "effect": "If this Prayer is successful, then while the Prayer remains in effect, you add +Rank to your Strength.",
    "flavor": "Drawing blood from your palm, you request that the Lord of Skulls impart a measure of his furious strength to you.",
    "source": "apocrypha",
    "page": 257
  },
  {
    "id": "zephyrs_grace_aoa",
    "name": "Zephyr’s Grace (Abundance of Apocrypha)",
    "cost": 20,
    "prerequisites": {
      "keywords": [
        "T'AU EMPIRE",
        "ETHEREAL CASTE",
        "PRIEST"
      ],
      "other": "Invocations of the Ethereals"
    },
    "effect": "If this Prayer is successful, then while the Prayer remains in effect, a single group of allied T'au numbering no more than your Willpower score, may add +Rank to their Defence so long as they moved in their previous turn.",
    "flavor": "As a breath of air slips unseen and unheard through blades of grass in a night-time forest, so do the T'au filter swift and silent across the battlefield.",
    "source": "apocrypha",
    "page": 258
  },
  {
    "id": "benediction_of_darkness_dh",
    "name": "Benediction of Darkness",
    "cost": 20,
    "prerequisites": {
      "keywords": [
        "CHAOS"
      ]
    },
    "effect": "Activate this Prayer as a Simple Action to blanket you and all allies within 10m in darkness. Until the end of the Round, tests against those affected suffer vision penalties (Wrath & Glory page 191), increasing the level of darkness two steps (to a maximum of total darkness), or imposing the effects of very dim light in otherwise well-lit conditions. Favoured Effect: From the darkness you conjure shadowy doppelgangers of your allies. Any attack Tests against affected targets until the end of the Round automatically fail, unless the attacker scores at least one Icon on a Wrath Die. Gain +1 Corruption.",
    "flavor": "Nightmares lurk beyond the rays of sunlight; becoming one with the dark is the true path to glory. This is a Prayer to the Dark Gods, activated using Ruin.",
    "isPrayer": true,
    "source": "dh",
    "page": 126
  },
  {
    "id": "daemonic_summoning_dh",
    "name": "Daemonic Summoning",
    "cost": 30,
    "prerequisites": {
      "keywords": [
        "CHAOS"
      ]
    },
    "effect": "Activate this Prayer with a Full-Round Action to summon a Threat with the DAEMON and CHAOS Keywords within 25m of you. The summoned Threat must be an Elite-level Threat at your Tier, or a Mob of Double Rank +2 Troops. The Daemons' actions once it enters reality are left entirely to the GM's discretion. They disappear after 3 Rounds, if not destroyed before then. Favoured Effect: Instead of summoning a Daemon, you may force it to possess a willing or unconscious host. The character gains access to the Threat's Bonuses and Abilities (including Daemonic Determination). They cannot use effects that require them to spend Ruin, or use equipment they do not have, and use their own stats for any Tests required to activate the Daemon's powers. After 3 Rounds, the host makes a Conviction Test, with a DN equal to the possessing Daemon's Willpower. If they fail, the Daemon makes a permanent home in the host's body, per the Dark Passenger Perils of the Warp effect. Gain +1 Corruption.",
    "flavor": "The legions of the warp will answer the call of those who facilitate their perversion of reality. This is a Prayer to the Dark Gods, activated using Ruin.",
    "isPrayer": true,
    "source": "dh",
    "page": null
  },
  {
    "id": "dark_zeal_dh",
    "name": "Dark Zeal",
    "cost": 30,
    "prerequisites": {
      "keywords": [
        "CHAOS"
      ],
      "attributes": {
        "willpower": 3
      }
    },
    "effect": "Activate this Prayer as a Simple Action to give you and all allies within 10m +Double Rank bonus dice on all Weapon Skill (I) Tests made until the end of the Round. Favoured Effect: The effects of this Prayer last until the end of the current combat. Gain +1 Corruption.",
    "flavor": "There is purity in your hatred of unbelievers who blaspheme against the Ruinous Powers. This is a Prayer to the Dark Gods, activated using Ruin.",
    "isPrayer": true,
    "source": "dh",
    "page": 126
  },
  {
    "id": "embrace_the_gods_dh",
    "name": "Embrace the God(s)",
    "cost": 20,
    "prerequisites": {
      "keywords": [
        "CHAOS"
      ],
      "attributes": {
        "willpower": 3
      },
      "other": "KHORNE, NURGLE, SLAANESH, or TZEENTCH Keyword"
    },
    "effect": "Activate this Prayer as a Simple Action to give you and all allies within 10m who share your [MARK OF CHAOS] Keyword the listed benefit until the end of the Round: KHORNE: You gain +2 bonus dice when making an All-Out Attack. NURGLE: You gain +1 Toughness (which therefore provides +1 Resilience, Wounds, and Determination as well). SLAANESH: You gain +2 bonus dice on Awareness (Int) and Persuasion (Fel) Tests. TZEENTCH: You gain the PSYKER Keyword and the Invoke Luck psychic power. Favoured Effect: The effects of this Prayer last until the end of the current scene or combat. Gain +1 Corruption.",
    "flavor": "All burdened with attentions from the infernal pantheon shall be recognised by their Mark. This is a Prayer to the Dark Gods, activated using Ruin.",
    "isPrayer": true,
    "source": "dh",
    "page": null
  },
  {
    "id": "litany_of_despair_dh",
    "name": "Litany of Despair",
    "cost": 20,
    "prerequisites": {
      "keywords": [
        "CHAOS"
      ],
      "attributes": {
        "willpower": 3
      }
    },
    "effect": "Activate this Prayer with a Combat Action to inflict the Hindered Condition on all enemies within 10m. Favoured Effect: All enemies within 10m must make a DN 5 Corruption Test. Gain +1 Corruption.",
    "flavor": "Even unbelievers cannot deny the truth of Chaos once it takes root in their soul. This is a Prayer to the Dark Gods, activated using Ruin.",
    "isPrayer": true,
    "source": "dh",
    "page": 126
  },
  {
    "id": "forge_the_sword_dh",
    "name": "Forge the Sword",
    "cost": 20,
    "prerequisites": {
      "keywords": [
        "CHAOS"
      ],
      "attributes": {
        "tech": 1
      }
    },
    "effect": "Activate this Prayer with a 30 minute ritual to transform a weapon with the BLADE Keyword into a Daemon Weapon. The weapon gains the Warp Weapon Trait; depending on the allegiance of the Daemon it also gains: KHORNE - Inflict (Bleeding), NURGLE - Inflict (Poisoned 4), SLAANESH - Agonising, TZEENTCH - Force. In addition, any attacks with the daemon weapon convert an extra die into a Wrath Die. The attack triggers a Wrath Critical if any Wrath Dice score an Exalted Icon. However, any Complications rolled trigger a Perils of the Warp effect. You may also activate this Prayer with a 30 minute ritual to bind a Daemon to a vehicle, transforming it into a Daemon Engine. Drivers of the vehicle convert an extra die into a Wrath Die when making Pilot (A) Tests to operate it (following the rules for extra Wrath Dice above), and all weapons aboard the vehicle gain the Warp Weapon Trait and the Cognis Trait. After one day, or when the wielder/driver of the device is Dying, the Daemon breaks its bonds and escapes to the Warp, ending the effects of this Prayer. Favoured Effect: The Daemon's bonds are permanent. If the wielder/driver uses the device whilst Dying, they only trigger Wrath Criticals if all Wrath Dice rolled score Exalted Icons, but suffer Traumatic Injuries and Perils of the Warp effects from Complications as normal. Gain +1 Corruption.",
    "flavor": "Those schooled in malevolent artifice shall wield the tools of the Arkifane as their own. This is a Prayer to the Dark Gods, activated using Ruin.",
    "isPrayer": true,
    "source": "dh",
    "page": null
  }
]
